<?php
// +----------------------------------------------------------------------
// | Hunagli.
// +----------------------------------------------------------------------
// | Copyright (c) 2016 http://www.abc3210.com, All rights reserved.
// +----------------------------------------------------------------------
// | Author: fuqt08 <admin@abc3210.com> 2018/1/22
// +----------------------------------------------------------------------

namespace lunar;

class Hunagli extends Lunar
{
    //五行纳音
    public static $naYin = [
        '甲子' => '海中金', '乙丑' => '海中金', '丙寅' => '炉中火', '丁卯' => '炉中火', '戊辰' => '大林木',
        '己巳' => '大林木', '庚午' => '路旁土', '辛未' => '路旁土', '壬申' => '剑锋金', '癸酉' => '剑锋金',
        '甲戌' => '山头火', '乙亥' => '山头火', '丙子' => '涧下水', '丁丑' => '涧下水', '戊寅' => '城头土',
        '己卯' => '城头土', '庚辰' => '白腊金', '辛巳' => '白腊金', '壬午' => '杨柳木', '癸未' => '杨柳木',
        '甲申' => '泉中水', '乙酉' => '泉中水', '丙戌' => '屋上土', '丁亥' => '屋上土', '戊子' => '霹雳火',
        '己丑' => '霹雳火', '庚寅' => '松柏木', '辛卯' => '松柏木', '壬辰' => '长流水', '癸巳' => '长流水',
        '甲午' => '砂石金', '乙未' => '砂石金', '丙申' => '山下火', '丁酉' => '山下火', '戊戌' => '平地木',
        '己亥' => '平地木', '庚子' => '壁上土', '辛丑' => '壁上土', '壬寅' => '金箔金', '癸卯' => '金箔金',
        '甲辰' => '覆灯火', '乙巳' => '覆灯火', '丙午' => '天河水', '丁未' => '天河水', '戊申' => '大驿土',
        '己酉' => '大驿土', '庚戌' => '钗环金', '辛亥' => '钗环金', '壬子' => '桑柘木', '癸丑' => '桑柘木',
        '甲寅' => '大溪水', '乙卯' => '大溪水', '丙辰' => '沙中土', '丁巳' => '沙中土', '戊午' => '天上火',
        '己未' => '天上火', '庚申' => '石榴木', '辛酉' => '石榴木', '壬戌' => '大海水', '癸亥' => '大海水'
    ];
    //60甲子
    protected $jiaZi = [
        "甲子", "乙丑", "丙寅", "丁卯", "戊辰", "己巳", "庚午", "辛未", "壬申", "癸酉", "甲戌", "乙亥", "丙子", "丁丑", "戊寅", "己卯", "庚辰", "辛巳", "壬午", "癸未", "甲申", "乙酉", "丙戌", "丁亥", "戊子", "己丑", "庚寅", "辛卯", "壬辰", "癸巳", "甲午", "乙未", "丙申", "丁酉", "戊戌", "己亥", "庚子", "辛丑", "壬寅", "癸卯", "甲辰", "乙巳", "丙午", "丁未", "戊申", "己酉", "庚戌", "辛亥", "壬子", "癸丑", "甲寅", "乙卯", "丙辰", "丁巳", "戊午", "己未", "庚申", "辛酉", "壬戌", "癸亥"
    ];
    //五行表
    public static $wuXing = [
        '甲子' => '金', '乙丑' => '金', '丙寅' => '火', '丁卯' => '火', '戊辰' => '木', '己巳' => '木', '庚午' => '土',
        '辛未' => '土', '壬申' => '金', '癸酉' => '金', '甲戌' => '火', '乙亥' => '火', '丙子' => '水', '丁丑' => '水',
        '戊寅' => '土', '己卯' => '土', '庚辰' => '金', '辛巳' => '金', '壬午' => '木', '癸未' => '木', '甲申' => '水',
        '乙酉' => '水', '丙戌' => '土', '丁亥' => '土', '戊子' => '火', '己丑' => '火', '庚寅' => '木', '辛卯' => '木',
        '壬辰' => '水', '癸巳' => '水', '甲午' => '金', '乙未' => '金', '丙申' => '火', '丁酉' => '火', '戊戌' => '木',
        '己亥' => '木', '庚子' => '土', '辛丑' => '土', '壬寅' => '金', '癸卯' => '金', '甲辰' => '火', '乙巳' => '火',
        '丙午' => '水', '丁未' => '水', '戊申' => '土', '己酉' => '土', '庚戌' => '金', '辛亥' => '金', '壬子' => '木',
        '癸丑' => '木', '甲寅' => '水', '乙卯' => '水', '丙辰' => '土', '丁巳' => '土', '戊午' => '火', '己未' => '火',
        '庚申' => '木', '辛酉' => '木', '壬戌' => '水', '癸亥' => '水',
    ];
    //地支相冲
    protected $dzChong = [
        ["子", "午"],
        ["丑", "未"],
        ["寅", "申"],
        ["卯", "酉"],
        ["辰", "戌"],
        ["巳", "亥"],
    ];
    //地支对应生肖
    protected $dzTosx = [
        "子" => "鼠", "丑" => "牛", "寅" => "虎", "卯" => "兔", "辰" => "龙", "巳" => "蛇",
        "午" => "马", "未" => "羊", "申" => "猴", "酉" => "鸡", "戌" => "狗", "亥" => "猪"
    ];

    /**
     * 重写获取年天干地支
     * @return array 0:天干 1:地支
     */
    public function getLunarGanzhiYear()
    {
        //节气数据
        $result = $this->getJieQi();
        $year = $this->getLunarYear();

        //如果节气还没到立春， 那么还是去年
        if ($result['next'][0] == '立春' && $year == $this->dateTime->format('Y')) {
            $year = (int)$year - 1;
        } else if ($result['current'][0] == '立春' && $this->getLunarYearMonth()[0] == '腊月') {
            $year = (int)$year + 1;
        }

        $lunarYear = (string)$year;
        return [$this->tianGan[$lunarYear{3}], $this->diZhi[$year % 12]];
    }

    /**
     * 重写 获取月天干地支
     * @return array 0:天干 1:地支
     */
    public function getLunarGanzhiMonth()
    {
        //节气数据
        $result = $this->getJieQi();
        $year = $this->getLunarYear();
        $nT = $this->getLunarGanzhiYear()[0];
        //如果$m == 腊月  而且 $result['current'][0] == 00  的话那么年份减去1
        $num = array_keys($this->jieQi, $result['current'][0]);

        $offset = $num[0] / 2 + 4;
        if ($nT == '甲' || $nT == '己') {
            $jiNianMonthT = $this->tianGan[(2 + $offset) % 10];
            $jiNianMonthD = $this->diZhi[(2 + $offset) % 12];
        } elseif ($nT == '乙' || $nT == '庚') {
            $jiNianMonthT = $this->tianGan[(4 + $offset) % 10];
            $jiNianMonthD = $this->diZhi[(2 + $offset) % 12];
        } elseif ($nT == '丙' || $nT == '辛') {
            $jiNianMonthT = $this->tianGan[(6 + $offset) % 10];
            $jiNianMonthD = $this->diZhi[(2 + $offset) % 12];
        } elseif ($nT == '丁' || $nT == '壬') {
            $jiNianMonthT = $this->tianGan[(8 + $offset) % 10];
            $jiNianMonthD = $this->diZhi[(2 + $offset) % 12];
        } elseif ($nT == '戊' || $nT == '癸') {
            $jiNianMonthT = $this->tianGan[$offset % 10];
            $jiNianMonthD = $this->diZhi[(2 + $offset) % 12];
        }
        return [$jiNianMonthT, $jiNianMonthD];
    }

    /**
     * 重写 获取日天干地支
     * @return array 0:天干 1:地支
     */
    public function getLunarGanzhiDay()
    {
        $dayCyclical = $this->dateTime->getTimestamp() / 86400 + 29219 + 18;
        //如果时 大于19时  就不四舍五入
        if ((int)$this->dateTime->format('H') < 15) {
            $dayCyclical = round($dayCyclical);
        }
        $dayCyclical = abs($dayCyclical);
        if ((int)$this->dateTime->format('H') >= 23) {
            $dayCyclical++;
        }
        return [$this->tianGan[($dayCyclical + 4) % 10], $this->diZhi[($dayCyclical + 4) % 12]];
    }

    /**
     * 重写
     * 根据距离正月初一的天数计算的农历日期
     * @return array 0:年 1:月 2:日 3:年天干地支 4:月天干地支 5:日天干地支 6:生肖 7:数字农历年月日
     */
    public function getLunarByBetween()
    {
        //获取现在是农历那年
        $year = $this->getLunarYear();
        $yearMonth = $this->getLunarYearMonth();
        $yearDay = $this->getLunarYearDay();

        $jieri = $this->getJieRi();

        $lunarArray = [
            'nongli' => [
                'y' => self::toYear($year),
                'm' => $yearMonth[0],
                'd' => $yearDay[0],
            ],
            'shengxiao' => $this->getShengXiao(),
            '_nongli' => [
                'y' => $year,
                'm' => $yearMonth[1],
                'd' => $yearDay[1],
            ],
            'jinian' => [
                'y' => $this->getLunarGanzhiYear(),
                'm' => $this->getLunarGanzhiMonth(),
                'd' => $this->getLunarGanzhiDay(),
            ],
            'jie_ri' => isset($jieri[0]) ? $jieri[0] : '',
        ];

        return $lunarArray;
    }

    /**
     * 获取生肖
     */
    public function getShengXiao()
    {
        //年柱地支获取生肖
        $zodiacs = $this->getLunarGanzhiYear();
        $zodiacsList = array_keys($this->diZhi, $zodiacs[1]);
        return $this->zodiacsData[$zodiacsList[0]];
    }

    /**
     * 根据每天的日干来调取数据的喜神、阳贵神、阴贵神、福神的方位
     * @return array
     */
    public function getPosition()
    {
        $rgz = $this->getLunarGanzhiDay();
        return self::getPositionbyTg($rgz[0]);
    }

    /**
     * 获得八门方位
     * @return mixed
     */
    public function getBaMenPosition()
    {
        $rgz = join('', $this->getLunarGanzhiDay());

        return self::getBaMenbyGz($rgz);
    }

    /**
     * 彭祖百忌 根据日干支
     */
    public function getPengZuBaiJi()
    {
        $list = [
            "甲" => "甲不开仓财物耗散",
            "乙" => "乙不栽植千株不长",
            "丙" => "丙不修灶必见灾殃",
            "丁" => "丁不剃头头必生疮",
            "戊" => "戊不受田田主不祥",
            "己" => "己不破券二比并亡",
            "庚" => "庚不经络织机虚张",
            "辛" => "辛不合酱主人不尝",
            "壬" => "壬不汲水更难提防",
            "癸" => "癸不词讼理弱敌强",
        ];
        $list2 = [
            "子" => "子不问卜自惹祸殃",
            "丑" => "丑不冠带主不还乡",
            "寅" => "寅不祭祀神鬼不尝",
            "卯" => "卯不穿井水泉不香",
            "辰" => "辰不哭泣必主重丧",
            "巳" => "巳不远行财物伏藏",
            "午" => "午不苫盖屋主更张",
            "未" => "未不服药毒气入肠",
            "申" => "申不安床鬼祟入房",
            "酉" => "酉不宴客醉坐颠狂",
            "戌" => "戌不吃犬作怪上床",
            "亥" => "亥不嫁娶不利新郎",
        ];
        //日干支
        $rgz = $this->getLunarGanzhiDay();
        $res = [
            $list[$rgz[0]], $list2[$rgz[1]]
        ];
        return $res;
    }

    /**
     * 返回彭祖百忌含解释
     */
    public function getDetailPengZuBaiJi()
    {
        $list = [
            "甲" => "甲日这天不要打开仓库取用东西，现在可引申为用存折取款，否则钱财会源源不断的用出去。",
            "乙" => "乙日不要种植花卉、粮食，这天种植的作物，收成会很差。",
            "丙" => "丙日不要修建厨房的灶（土灶，现在的天然气炉子不忌），否则会招致火灾。",
            "丁" => "丁日不剃头，剃头之后头部容易生疮。",
            "戊" => "戊日不可接受他人赠送或购买的田地（可引申为屋宅），原来田地的主人不一定是卖给你的人，引申为田地、屋宅的产权有问题。",
            "己" => "己日不能撕毁合同，撕毁合同之后，甲乙双方都会有大的灾难。",
            "庚" => "庚日不要使用针灸治病，否则导致经络虚松。",
            "辛" => "辛日不要做酱料，可引申为发酵业的事情。做的东西连做的人都不愿吃，跟不谈能不能卖出去了。",
            "壬" => "壬日这天不要从井里打水，会有意外发生；可引申为这天不要修护江堤。",
            "癸" => "癸日不宜主动上诉、打官司，否则即使自己粘住理，也会变成不在理，而对方会胜出官司。",
            "子" => "子日这天不要问先生卜卦的结果，更不要卜卦，否则好事也要变成坏事。",
            "丑" => "丑日不要上任出行，否则会客死他乡。",
            "寅" => "寅日不要祭奠祖先、亡灵，这天祭拜，阴间的亡人是收不到的。",
            "卯" => "卯日不要打井，打出的进水味道不好。",
            "辰" => "辰日不可因为事情而哭泣，否则会有丧事再次发生。",
            "巳" => "巳日不要外出旅游，走较远的亲戚，否则家里会遭贼，家里的钱财要藏好。",
            "午" => "午日这天不要盖屋顶，也就是这天不要建筑封顶。自己盖的房子，会自己缺钱而卖掉。",
            "未" => "未日不宜服药，是药三分毒，这个毒气会渗入体内。",
            "申" => "申日不要安置床铺，这天安置床铺，鬼会跟着进入室内。",
            "酉" => "酉日不要会见客人，也不要去拜会客人，否则对主人和客人都不好。引申为生意谈不成。",
            "戌" => "戌日不要吃狗肉，否则会引来怪事情。",
            "亥" => "亥日不要结婚，否则会离婚。"
        ];
        //日干支
        $rgz = $this->getLunarGanzhiDay();

        $res = [
            isset($list[$rgz[0]]) ? $list[$rgz[0]] : '',
            isset($list[$rgz[1]]) ? $list[$rgz[1]] : ''
        ];
        return $res;
    }

    /**
     * 建除十二神
     */
    public function getJianChu()
    {
        $dz = ["寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌", "亥", "子", "丑"];
        $list = [
            ["建", "除", "满", "平", "定", "执", "破", "危", "成", "收", "开", "闭"],
            ["闭", "建", "除", "满", "平", "定", "执", "破", "危", "成", "收", "开"],
            ["开", "闭", "建", "除", "满", "平", "定", "执", "破", "危", "成", "收"],
            ["收", "开", "闭", "建", "除", "满", "平", "定", "执", "破", "危", "成"],
            ["成", "收", "开", "闭", "建", "除", "满", "平", "定", "执", "破", "危"],
            ["危", "成", "收", "开", "闭", "建", "除", "满", "平", "定", "执", "破"],
            ["破", "危", "成", "收", "开", "闭", "建", "除", "满", "平", "定", "执"],
            ["执", "破", "危", "成", "收", "开", "闭", "建", "除", "满", "平", "定"],
            ["定", "执", "破", "危", "成", "收", "开", "闭", "建", "除", "满", "平"],
            ["平", "定", "执", "破", "危", "成", "收", "开", "闭", "建", "除", "满"],
            ["满", "平", "定", "执", "破", "危", "成", "收", "开", "闭", "建", "除"],
            ["除", "满", "平", "定", "执", "破", "危", "成", "收", "开", "闭", "建"],
        ];
        $ygz = $this->getLunarGanzhiMonth();
        $rgz = $this->getLunarGanzhiDay();
        $yIndex = (int)array_search($ygz[1], $dz);
        $rIndex = (int)array_search($rgz[1], $dz);
        return $list[$yIndex][$rIndex];
    }

    /**
     * 今日合害
     * @return array
     */
    public function getTodayHeHai()
    {
        $rgz = $this->getLunarGanzhiDay();
        $list0 = $this->dzTosx;
        //地支三合
        $list = [
            '子' => ['辰', '申'],
            '丑' => ['巳', '酉'],
            '寅' => ['午', '戌'],
            '卯' => ['亥', '未'],
            '辰' => ['子', '申'],
            '巳' => ['酉', '丑'],
            '午' => ['寅', '戌'],
            '未' => ['亥', '卯'],
            '申' => ['辰', '子'],
            '酉' => ['巳', '丑'],
            '戌' => ['午', '寅'],
            '亥' => ['卯', '未'],

        ];
        //地支相冲
        $list2 = $this->dzChong;
        //地支六合
        $list3 = [
            ["子", "丑"],
            ["寅", "亥"],
            ["卯", "戌"],
            ["辰", "酉"],
            ["巳", "申"],
            ["午", "未"],
        ];
        //地支三会
        $list4 = [
            ["寅", "卯", "辰"],
            ["巳", "午", "未"],
            ["申", "酉", "戌"],
            ["亥", "子", "丑"],
        ];
        //地支相害（相穿）
        $list5 = [
            ["子", "未"],
            ["丑", "午"],
            ["寅", "巳"],
            ["卯", "辰"],
            ["申", "亥"],
            ["酉", "戌"],
        ];
        //地支相破
        $list6 = [
            ["子", "酉"],
            ["卯", "午"],
            ["辰", "丑"],
            ["未", "戌"],
            ["寅", "亥"],
            ["巳", "申"]
        ];
        //地支相刑
        $list7 = [
            ["子", "卯"],
            ["寅", "巳", "申"],
            ["丑", "未", "戌"],
            ["辰", "午", "未"]
        ];

        $sanHeList = $list[$rgz[1]];
        $getShenXiao = function ($list, $dz, $shenXiaoList) {
            $sx = [];
            foreach ($list as $v) {
                if (in_array($dz, $v)) {
                    foreach ($v as $v1) {
                        if ($v1 != $dz) {
                            $sx[] = $shenXiaoList[$v1];
                        }
                    }
                    break;
                }
            }
            if (empty($sx)) {
                return '';
            }
            return $sx;
        };
        //六合
        $liuHe = $getShenXiao($list3, $rgz[1], $list0);
        //相冲
        $xiangChong = $getShenXiao($list2, $rgz[1], $list0);
        //三会
        $sanHui = $getShenXiao($list4, $rgz[1], $list0);
        //相害
        $xianHai = $getShenXiao($list5, $rgz[1], $list0);
        //相破
        $xianPo = $getShenXiao($list6, $rgz[1], $list0);
        //相刑
        $xianXing = $getShenXiao($list7, $rgz[1], $list0);
        $res = [
            'san_he' => [$list0[$sanHeList[0]], $list0[$sanHeList[1]]],
            'liu_he' => is_array($liuHe) ? $liuHe[0] : '',
            'xian_chong' => is_array($xiangChong) ? $xiangChong[0] : '',
            'san_hui' => $sanHui,
            'xian_hai' => is_array($xianHai) ? $xianHai[0] : '',
            'xian_po' => is_array($xianPo) ? $xianPo[0] : '',
            'xian_xing' => $xianXing
        ];
        return $res;
    }

    /**
     * 获取纳音
     * @return array
     */
    public function getNayin()
    {
        $tgdz = $this->getLunarTganDzhi();

        return [
            'y' => self::$naYin[$tgdz['y'][0] . $tgdz['y'][1]],
            'm' => self::$naYin[$tgdz['m'][0] . $tgdz['m'][1]],
            'd' => self::$naYin[$tgdz['d'][0] . $tgdz['d'][1]],
        ];
    }

    /**
     * 星宿
     * @return mixed
     */
    public function getXingSu()
    {
        $startTime = strtotime('1901-01-01 0:0:0');
        $time = $this->dateTime->getTimestamp();
        $index = 24 + ((int)($time - $startTime) / 86400) % 28;
        if ($index > 28) {
            $index = $index - 28;
        }
        if ($index < 1) {
            $index = 1;
        }
        //星宿
        $xingsu = [
            [],
            ["虚日鼠", ["虚星造作主灾殃，男女孤眠不一双。", "内乱风声无礼节，儿孙媳妇伴人床。", "开门放水遭灾殃，虎咬蛇伤又卒亡。", "三三五五连病疾，家破人亡不可当。"]],
            ["危月燕", ["危星不可造高楼，自遭刑吊见血光。", "三年孩儿遭水厄，后生出外不还乡。", "埋葬若还逢此日，周年百日卧高床。", "三年五载一悲伤，开门放水到官堂。"]],
            ["室火猪", ["室星修造进田牛，儿孙代代近王侯。", "富贵荣华天上至，寿如彭祖八千秋。", "开门放水招财帛，和合姻婚生贵儿。", "埋葬若能依此日，门庭兴旺福无休。"]],
            ["壁水獝", ["壁星造作主增财，丝蚕大熟福滔天。", "奴婢自来人口进，开门放水出英贤。", "埋葬招财官品进，家中诸事乐陶然。", "婚姻吉利生贵子，早播名声着祖鞭。"]],
            ["奎木狼", ["奎星造作得祯祥，家下荣和大吉昌。", "若是埋葬阴卒死，当年定主两三丧。", "看看军令刑伤到，重重官司主瘟皇。", "开门放水招灾祸，三年两次损儿郎。"]],
            ["娄金狗", ["娄星竖柱起门庭，财旺家和事事兴。", "外进钱财百日进，一家兄弟播高名。", "婚姻进益生贵子，玉帛金银箱满堂。", "放水开门皆吉利，男荣女贵寿安宁。"]],
            ["胃土雉", ["胄星造作事如何，富贵荣华喜事多。", "埋葬贵临官禄位，夫妇齐眉永保康。", "婚姻遇此家富贵，三灾九祸不逢他。", "从此门庭多吉庆，儿孩代代拜金皆。"]],
            ["昴日鸡", ["昴星造作进田牛，埋葬官灾不得休。", "重丧二日三人死，尽卖田园不记增。", "开门放水招灾祸，三岁孩儿白了头。", "婚姻不可逢此日，死别生离是可悲。"]],
            ["毕月乌", ["毕星造作主双全，买得田园有粟钱。", "埋葬此日添官职，田蚕大熟永丰年。", "开门放水皆吉庆，合家人口得安然。", "婚姻若还逢此日，生得孩儿福寿全。"]],
            ["觜火猴", ["觜星造作有徒刑，三年必定主伶仃。", "埋葬卒死多因此，取定寅年使杀人。", "三丧不止皆由此，一人药毒二人身。", "家门田地皆退败，仓库金银化作尘。"]],
            ["参水猿", ["参星造作旺人家，文星照耀大光华。", "只因造作田财旺，埋葬招疾哭黄沙。", "开门放水加官职，房房子孙见田加。", "婚姻许定遭刑克，男女朝开暮落花。"]],
            ["井木犴", ["井星造作旺蚕田，金榜题名第一先。", "埋葬须防惊卒死，狂颠风疾入黄泉。", "开门放水招财帛，牛马猪羊旺莫言。", "寡妇田塘来入宅，儿孙兴旺有余钱。"]],
            ["鬼金羊", ["鬼星起造卒人亡，堂前不见主人郎。", "埋葬此日官禄至，儿孙代代近君王。", "开门放水须伤死，嫁给夫妻不久长。", "修土筑墙伤产女，手扶双女泪汪汪。"]],
            ["柳土獐", ["柳星造作主遭官，昼夜偷闲不暂安。", "埋葬瘟疫多疾病，田园退尽守冬寒。", "开门放水遭袭瞎，腰驼背曲似弓弯。", "更有棒刑宜谨慎，妇人随客走盘桓。"]],
            ["星日马", ["星宿日好造新房，进职加官近帝王。", "不可埋葬并放水，凶星临位女人亡。", "生离死别无心恋，要自归休别嫁郎。", "孔子九曲殊难度，放水开门天命伤。"]],
            ["张月鹿", ["张星日好造龙轩，年年并见进庄田。", "埋葬不久升官职，代代为官近帝前。", "开门放水招财帛，婚姻和合福绵绵。", "田蚕大利仓库满，百般顺意自安然。"]],
            ["翼火蛇", ["翼星不利架高堂，三年二载见瘟疫。", "埋葬若还逢此日，子孙必定走他乡。", "婚姻此日不宜利，归家定是不相当。", "开门放水家须破，少女恋花贪外郎。"]],
            ["轸水蚓", ["轸星临水造龙宫，代代为官受勒封。", "富贵荣华增寿禄，库满仓盈自昌隆。", "埋葬文星来照助，宅舍安宁不见凶。", "更有为官沾帝宠，婚姻龙子出龙宫。"]],
            ["角木蛟", ["角星造作主荣昌，外进田财及女郎。", "嫁娶婚姻出贵子，文人及第见君王。", "惟有葬埋不可用，三年之后主瘟疫。", "起工修筑坟基地，当前立见主人亡。"]],
            ["亢金龙", ["亢星造作长房当，十日之中主有殃。", "田地消磨官失职，投军定是虎狼伤。", "嫁娶婚姻用此日，儿孙新妇守空房。", "埋葬若还逢此日，当时灾祸主重伤。"]],
            ["氐土貉", ["氏星造作主灾凶，费尽田园仓库空。", "埋葬不可用此日，悬绝吊胫祸重重。", "若是婚姻离别散，夜招浪子入房中。", "行船必定遭沉没，更生聋哑子孙穷。"]],
            ["房日兔", ["房星造作田园进，血财牛马遍山冈。", "更招外处田庄宅，荣华富贵福禄康。", "埋葬若然用此日，高官进职拜君王。", "嫁娶嫦娥至月殿，三年抱子至朝堂。"]],
            ["心月狐", ["心星造作大为凶，更遭刑讼狱囚中。", "忤逆官非宅产退，埋葬卒暴死相从。", "婚姻若是逢此日，子死儿亡泪满胸。", "三年之内连遭祸，事事教君没始终。"]],
            ["尾火虎", ["尾星造作主天恩，富贵荣华福禄增。", "招财进宝与田宅，和合婚姻贵子孙。", "埋葬若能依此日，男清女正子孙兴。", "开门放水招田宅，代代公侯远播名。"]],
            ["箕水豹", ["箕星造作主高强，岁岁年年大吉昌。", "埋葬修坟大吉利，田蚕牛马遍山冈。", "开门放水招田宅，箧满金银谷满仓。", "福荫高官加禄位，六亲丰足乐安康。"]],
            ["斗木獬", ["斗星造作主招财，文武官员位鼎台。", "田宅家财千万进，坟茔修筑富贵来。", "开门放水招牛马，旺蚕男女主和谐。", "遇此吉星来照护，时支福庆永无灾。"]],
            ["牛金牛", ["牛星造作主灾危，九横三灾不可推。", "家宅不安人口退，田蚕不利主人衰。", "嫁娶婚姻皆自损，金银财谷渐无之。", "若是开门并放水，牛猪羊马亦伤悲。"]],
            ["女土蝠", ["女星造作损婆娘，兄弟相嫌似虎狼。", "埋葬生灾逢鬼怪，颠邪疾病主瘟疔。", "为事遭官财失散，泻利流连不可当。", "开门放水逢此日，全家财散主离乡。"]],
        ];
        return $xingsu[$index];
    }

    /**
     * 空亡
     * @return string
     */
    public function getKongWang()
    {
        $gz = [
            'y' => $this->getLunarGanzhiYear(),
            'm' => $this->getLunarGanzhiMonth(),
            'd' => $this->getLunarGanzhiDay()
        ];
        $res = [];
        foreach ($gz as $k2 => $v2) {
            $tmp = join('', $v2);
            $res[$k2] = self::getKongWangbyGz($tmp);
        }
        return $res;
    }

    /**
     * 值　日
     */
    public function getZhiRi()
    {
        $mgz = $this->getLunarGanzhiMonth();
        $rgz = $this->getLunarGanzhiDay();
        return self::getZhiRiByDz($mgz[1], $rgz[1]);
    }

    /**
     * 获取星座
     * @return boolean|string
     */
    public function getXingZuo()
    {
        $day = (int)$this->dateTime->format('d');
        $month = (int)$this->dateTime->format('m');
        return $this->getConstellation($month, $day);
    }

    /**
     * 获得吉凶宜忌
     */
    public function getJiXiong()
    {
        $mgz = $this->getLunarGanzhiMonth();
        $list = ['寅' => 1, '卯' => 2, '辰' => 3, '巳' => 4, '午' => 5, '未' => 6, '申' => 7, '酉' => 8, '戌' => 9, '亥' => 10, '子' => 11, '丑' => 12];
        $rgz = $this->getLunarGanzhiDay();
        $gz = join('', $rgz);
        $jiXiongArr = $this->getJixiongArr();
        $res = $jiXiongArr[$gz][$list[$mgz[1]]];
        $list = [
            'jishen' => [],
            'xiong' => [],
            'ji' => [],
            'yi' => []
        ];
        if (!empty($res)) {
            $list = [
                'jishen' => $res['jishen'],
                'xiong' => $res['xiong'],
                'ji' => $res['ji'],
                'yi' => $res['yi']
            ];
        }
        return $list;
    }

    /**
     * 吉凶原始数据
     * @return mixed
     */
    public function getJixiongArr()
    {
        static $jxData;
        if (empty($jxData) || !is_array($jxData)) {
            $filename = __DIR__ . "/data/jixiong.txt";
            $handle = fopen($filename, "r");
            //读取二进制文件时，需要将第二个参数设置成'rb'
            $contents = fread($handle, filesize($filename));
            fclose($handle);
            $str = gzuncompress($contents);
            $jxData = json_decode($str, JSON_UNESCAPED_UNICODE);
        }
        return $jxData;
    }

    /**
     * 获得当天时辰全部详情
     * @return array
     */
    public function getHourDetail()
    {
        $res = [];
        $jiNianDay = $this->getLunarGanzhiDay();
        $dgz = join('', $jiNianDay);//天干支
        $jiNianDayT = $jiNianDay[0];
        //时辰吉 按日天干地支获得
        $list = [
            "甲子" => "子丑卯午申酉", "甲寅" => "子丑辰巳未戌", "甲辰" => "寅辰巳申酉亥", "甲午" => "子丑卯午申酉",
            "甲申" => "子丑辰巳未戌", "甲戌" => "寅辰巳未申酉亥", "己丑" => "寅卯巳申戌", "己卯" => "子寅卯午未酉",
            "己巳" => "丑辰午未戌亥", "己未" => "寅卯巳申戌亥", "己酉" => "子寅卯午未酉", "己亥" => "丑辰午未戌亥",
            "乙丑" => "寅卯巳申戌亥", "乙卯" => "子寅卯午未酉", "乙巳" => "丑辰午戌亥", "乙未" => "寅卯巳申戌亥",
            "乙酉" => "子寅卯午未酉", "乙亥" => "丑辰午戌亥", "庚子" => "子丑卯午申酉", "庚寅" => "子丑辰巳未戌",
            "庚辰" => "寅辰巳酉亥", "庚午" => "子丑卯午申酉", "庚申" => "子丑辰巳午未戌", "庚戌" => "寅辰巳申酉亥",
            "丙子" => "子丑卯午申酉", "丙寅" => "子丑辰巳未戌", "丙辰" => "寅辰巳申酉亥", "丙午" => "子丑卯午申",
            "丙申" => "子丑辰巳未戌", "丙戌" => "寅辰巳申酉亥", "辛丑" => "寅卯巳申戌亥", "辛卯" => "子寅卯午未酉",
            "辛巳" => "丑辰午未戌", "辛未" => "寅卯巳申戌亥", "辛酉" => "子寅卯午未酉", "辛亥" => "丑辰午戌亥",
            "丁丑" => "寅卯巳申戌亥", "丁卯" => "子寅卯午未酉", "丁巳" => "丑辰午未戌亥", "丁未" => "寅卯巳申戌亥",
            "丁酉" => "子寅卯午未酉", "丁亥" => "丑辰午未戌亥", "壬子" => "子丑卯午申酉", "壬寅" => "子丑辰巳未戌",
            "壬辰" => "寅辰巳申酉亥", "壬午" => "子丑卯午申酉", "壬申" => "子丑辰巳未戌", "壬戌" => "寅辰巳申酉亥",
            "戊子" => "子丑卯午申酉", "戊寅" => "子丑辰巳未戌", "戊辰" => "寅辰巳申酉亥", "戊午" => "子丑卯午申酉",
            "戊申" => "子丑辰巳未戌", "戊戌" => "寅辰巳申酉亥", "癸丑" => "寅卯巳申戌亥", "癸卯" => "子寅卯午酉",
            "癸巳" => "丑辰午未戌亥", "癸未" => "寅卯巳申戌亥", "癸酉" => "子寅卯午未酉", "癸亥" => "丑辰午未戌亥"
        ];
        $list2 = [
            '甲子' => [

                '子' => ['yi' => ['祈福', '订婚', '嫁娶', '开市', '安葬'], 'ji' => ['造船', '乘船']],
                '丑' => ['yi' => ['祈福', '求嗣', '出行', '求财', '嫁娶', '安葬', '祭祀'], 'ji' => ['无']],
                '寅' => [
                    'yi' => ['祭祀', '祈福', '酬神', '订婚', '嫁娶', '出行', '求财', '入宅', '安葬', '赴任'],
                    'ji' => ['上梁', '盖屋', '入殓']
                ],
                '卯' => ['yi' => ['求嗣', '嫁娶', '移徙', '入宅', '开市', '交易', '修造', '安葬'], 'ji' => ['赴任', '出行',]],
                '辰' => [
                    'yi' => ['订婚', '嫁娶', '求财', '开市', '交易', '安床'],
                    'ji' => ['赴任', '修造', '移徙', '出行', '词讼', '祈福', '求嗣', '乘船']
                ],
                '巳' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '入宅', '开市', '交易'], 'ji' => ['开光', '修造', '安葬', '赴任', '出行']],
                '午' => ['yi' => ['无'], 'ji' => ['日时相冲', '诸事不宜']],
                '未' => [
                    'yi' => ['祭祀', '祈福', '酬神', '求财', '见贵', '订婚', '嫁娶', '修造', '安葬', '青龙', '入宅'],
                    'ji' => ['赴任', '出行']
                ],
                '申' => ['yi' => ['求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神']],
                '酉' => [
                    'yi' => ['求财', '见贵', '酬神', '修造', '盖屋', '移徙', '作灶', '安床', '入宅', '开市'],
                    'ji' => ['祭祀', '祈福', '斋醮', '开光', '赴任', '出行']
                ],
                '戌' => ['yi' => ['出行', '求财', '见贵', '嫁娶', '进人口', '移徙', '安葬'], 'ji' => ['赴任', '词讼']],
                '亥' => [
                    'yi' => ['求嗣', '嫁娶', '移徙', '入宅', '开市', '交易', '修造', '安葬', '祈福'],
                    'ji' => ['朱雀须用', '凤凰符制', '否则', '诸事不宜', '赴任', '出行', '求财']
                ]
            ],
            '乙丑' => [
                '子' => [
                    'yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '祭祀'],
                    'ji' => ['上梁', '盖屋', '入殓']
                ],
                '丑' => [
                    'yi' => ['祭祀', '祈福', '酬神', '订婚', '嫁娶', '出行', '求财', '入宅', '安葬'],
                    'ji' => ['造船', '乘船', '朱雀须用', '凤凰符制', '否则', '诸事不宜']
                ],
                '寅' => ['yi' => ['订婚', '嫁娶', '修造', '入宅', '开市', '交易', '安葬'], 'ji' => ['祈福', '求嗣']],
                '卯' => ['yi' => ['赴任', '出行', '求财', '见贵', '订婚', '嫁娶', '入宅', '开市', '安葬', '祈福', '求嗣', '祭祀'], 'ji' => ['无']],
                '辰' => ['yi' => ['无'], 'ji' => ['白虎须用', '麒麟符制', '否则', '诸事不宜', '修造', '动土']],
                '巳' => [
                    'yi' => ['祈福', '求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床', '修造', '盖屋', '移徙'],
                    'ji' => ['赴任', '出行']
                ],
                '午' => [
                    'yi' => ['求嗣', '嫁娶', '入宅', '开市', '交易', '安葬', '求财'],
                    'ji' => ['赴任', '修造', '移徙', '出行', '词讼', '祭祀', '祈福', '斋醮', '开光']
                ],
                '未' => ['yi' => ['无'], 'ji' => ['日时相冲', '诸事不宜']],
                '申' => ['yi' => ['祈福', '求嗣', '出行', '求财', '嫁娶', '赴任', '见贵'], 'ji' => ['开光', '修造', '安葬']],
                '酉' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床'], 'ji' => ['赴任', '出行', '修造']],
                '戌' => [
                    'yi' => ['祈福', '订婚', '嫁娶', '安床', '移徙', '入宅', '修造', '安葬'],
                    'ji' => ['上梁', '盖屋', '入殓', '赴任', '出行']
                ],
                '亥' => [
                    'yi' => ['祭祀', '祈福', '求嗣', '开市', '订婚', '嫁娶', '入宅', '安葬', '修造', '赴任', '出行', '见贵', '求财'],
                    'ji' => ['无']
                ]
            ],
            '丙寅' => [
                '子' => ['yi' => ['赴任', '出行', '求财', '见贵', '祭祀', '酬神'], 'ji' => ['祈福', '求嗣']],
                '丑' => [
                    'yi' => ['修造', '盖屋', '移徙', '作灶', '安床', '入宅', '开市', '赴任', '出行', '求财', '见贵', '嫁娶', '进人口'],
                    'ji' => ['祭祀', '祈福', '斋醮', '酬神']
                ],
                '寅' => ['yi' => ['求嗣', '嫁娶', '移徙', '入宅', '开市', '交易', '安葬', '祈福'], 'ji' => ['赴任', '词讼', '修造', '动土']],
                '卯' => ['yi' => [
                    '赴任', '出行', '求财', '嫁娶', '修造', '移徙', '开市', '安葬'],
                    'ji' => ['朱雀须用', '凤凰符制', '否则', '诸事不宜']
                ],
                '辰' => ['yi' => ['订婚', '嫁娶', '开市', '安葬'], 'ji' => ['赴任', '出行', '祭祀', '祈福', '斋醮', '开光']],
                '巳' => ['yi' => ['求财', '见贵', '订婚', '嫁娶', '入宅', '开市', '安葬'], 'ji' => ['赴任', '出行', '祭祀', '祈福', '斋醮', '开光']],
                '午' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床'], 'ji' => ['白虎须用', '麒麟符制', '否则', '诸事不宜']],
                '未' => ['yi' => ['修造', '盖屋', '移徙', '安床', '入宅', '开市', '开仓', '祭祀', '祈福', '求嗣', '斋醮', '订婚', '嫁娶', '出行'], 'ji' => ['无']],
                '申' => ['yi' => ['无'], 'ji' => ['日时相冲', '诸事不宜']],
                '酉' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床', '入宅', '安葬', '祭祀'], 'ji' => ['赴任', '出行', '修造', '动土']],
                '戌' => ['yi' => ['订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '作灶', '祭祀'], 'ji' => ['祈福', '求嗣', '乘船']],
                '亥' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床', '祭祀'], 'ji' => ['赴任', '出行', '修造', '开光']]
            ],
            '丁卯' => [
                '子' => ['yi' => ['作灶', '祭祀', '祈福', '斋醮', '酬神'], 'ji' => ['赴任', '出行', '修造', '动土']],
                '丑' => ['yi' => ['见贵', '求财', '嫁娶', '进人口', '移徙', '安葬', '祭祀', '祈福', '求嗣', '斋醮', '订婚'], 'ji' => ['赴任', '出行', '修造']],
                '寅' => ['yi' => ['订婚', '嫁娶', '安床', '移徙', '入宅', '修造', '安葬', '求财', '见贵'], 'ji' => ['祭祀', '祈福', '斋醮', '开光', '赴任', '出行']],
                '卯' => ['yi' => ['修造', '盖屋', '移徙', '作灶', '安床', '入宅', '开市', '求嗣', '订婚', '嫁娶'], 'ji' => ['祭祀', '祈福', '斋醮', '开光', '赴任', '出行']],
                '辰' => ['yi' => ['祭祀', '祈福', '求嗣', '斋醮', '订婚', '嫁娶', '安葬'], 'ji' => ['赴任', '出行']],
                '巳' => ['yi' => ['求嗣', '嫁娶', '移徙', '入宅', '开市', '交易', '修造', '安葬', '祈福', '订婚', '赴任', '出行', '见贵', '求财'], 'ji' => ['朱雀须用', '凤凰符制', '否则', '诸事不宜']],
                '午' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '赴任'], 'ji' => ['修造', '动土']],
                '未' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '修造', '入宅', '安葬', '祭祀'], 'ji' => ['无']],
                '申' => ['yi' => ['入宅', '修造', '安葬', '祭祀', '斋醮', '酬神'], 'ji' => ['祈福', '求嗣', '白虎须用', '麒麟符制', '否则', '诸事不宜']],
                '酉' => ['yi' => ['无'], 'ji' => ['日时相冲', '诸事不宜']],
                '戌' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床', '见贵'], 'ji' => ['赴任', '修造', '移徙', '出行', '词讼']],
                '亥' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床', '祭祀', '见贵'], 'ji' => ['赴任', '出行', '修造', '动土']]
            ],
            '戊辰' => [
                '子' => ['yi' => ['求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床'], 'ji' => ['赴任', '修造', '移徙', '出行', '词讼', '祭祀', '祈福', '斋醮', '开光']],
                '丑' => ['yi' => ['酬神', '求财', '见贵', '订婚', '嫁娶', '安葬', '青龙'], 'ji' => ['赴任', '出行', '修造', '动土', '祭祀', '祈福', '斋醮', '开光']],
                '寅' => ['yi' => ['求嗣', '嫁娶', '移徙', '入宅', '开市', '交易', '修造', '安葬', '作灶', '祭祀', '祈福', '斋醮', '酬神', '见贵'], 'ji' => ['赴任', '出行']],
                '卯' => ['yi' => ['求财', '见贵'], 'ji' => ['赴任', '出行', '祭祀', '祈福', '斋醮', '酬神']],
                '辰' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床'], 'ji' => ['上梁', '盖屋', '入殓', '赴任', '出行']],
                '巳' => ['yi' => ['赴任', '出行', '求财', '见贵', '订婚', '嫁娶', '入宅', '开市', '盖屋', '移徙', '作灶', '安床'], 'ji' => ['开光', '修造', '安葬']],
                '午' => ['yi' => ['修造', '安葬', '出行', '求财', '嫁娶'], 'ji' => ['赴任', '词讼', '祈福', '求嗣']],
                '未' => ['yi' => ['祈福', '求嗣', '出行', '入宅', '嫁娶', '修造', '安葬', '赴任', '见贵', '求财'], 'ji' => ['朱雀须用', '凤凰符制', '否则', '诸事不宜']],
                '申' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '赴任', '见贵'], 'ji' => ['修造', '动土']],
                '酉' => ['yi' => ['求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神']],
                '戌' => ['yi' => ['无'], 'ji' => ['日时相冲', '诸事不宜']],
                '亥' => [
                    'yi' => ['修造', '盖屋', '移徙', '安床', '入宅', '开市', '开仓', '见贵', '求财', '订婚', '嫁娶', '进人口'],
                    'ji' => ['祭祀', '祈福', '斋醮', '开光', '赴任', '出行']
                ]
            ],
            '己巳' => [
                '子' => ['yi' => ['祭祀', '祈福', '酬神', '出行', '求财', '见贵', '订婚', '嫁娶', '修造', '安葬', '青龙', '赴任'], 'ji' => ['白虎须用', '麒麟符制', '否则', '诸事不宜']],
                '丑' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床', '修造', '盖屋', '移徙'], 'ji' => ['赴任', '出行']],
                '寅' => ['yi' => ['赴任', '出行', '求财', '见贵', '祭祀', '祈福', '酬神'], 'ji' => ['上梁', '盖屋', '入殓']],
                '卯' => ['yi' => ['入宅', '安葬', '求财', '嫁娶'], 'ji' => ['赴任', '出行', '修造', '动土']],
                '辰' => ['yi' => ['作灶', '修造', '赴任', '见贵', '求财', '出行', '嫁娶', '进人口', '移徙', '安葬'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神']],
                '巳' => ['yi' => ['求嗣', '嫁娶', '移徙', '入宅', '开市', '交易', '安葬', '见贵', '求财'], 'ji' => ['赴任', '出行', '修造', '开光']],
                '午' => ['yi' => ['赴任', '出行', '求财', '见贵', '订婚', '嫁娶', '入宅', '开市', '安葬', '祈福'], 'ji' => ['修造', '动土']],
                '未' => ['yi' => ['祭祀', '祈福', '酬神', '订婚', '嫁娶', '出行', '求财', '入宅', '安葬', '修造', '盖屋', '移徙', '作灶', '安床'], 'ji' => ['无']],
                '申' => ['yi' => ['求嗣', '求财', '嫁娶', '安葬'], 'ji' => ['祭祀', '祈福', '斋醮', '开光', '赴任', '出行']],
                '酉' => ['yi' => ['求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床'], 'ji' => ['朱雀须用', '凤凰符制', '否则', '诸事不宜', '祭祀', '祈福', '斋醮', '开光', '赴任', '出行']],
                '戌' => ['yi' => ['祈福', '订婚', '嫁娶', '开市', '安葬'], 'ji' => ['赴任', '出行', '求财']],
                '亥' => ['yi' => ['无'], 'ji' => ['日时相冲', '诸事不宜']]
            ],
            '庚午' => [
                '子' => ['yi' => ['无'], 'ji' => ['日时相冲', '诸事不宜']],
                '丑' => ['yi' => ['祈福', '求嗣', '出行', '求财', '嫁娶', '安葬', '祭祀'], 'ji' => ['无']],
                '寅' => ['yi' => ['订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '赴任', '见贵'], 'ji' => ['祈福', '求嗣']],
                '卯' => ['yi' => ['求嗣', '订婚', '嫁娶', '修造', '入宅', '求财', '开市', '交易', '安葬', '赴任', '出行', '见贵'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神']],
                '辰' => ['yi' => ['祭祀', '祈福', '求嗣', '斋醮', '订婚', '嫁娶', '安葬'], 'ji' => ['赴任', '修造', '移徙', '出行', '词讼']],
                '巳' => ['yi' => ['求嗣', '嫁娶', '移徙', '入宅', '开市', '交易', '安葬', '祈福'], 'ji' => ['赴任', '出行', '修造', '动土']],
                '午' => ['yi' => ['酬神', '订婚', '嫁娶', '求财', '入宅', '安葬', '作灶'], 'ji' => ['祭祀', '祈福', '斋醮', '开光', '赴任', '出行']],
                '未' => ['yi' => ['求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床'], 'ji' => ['祭祀', '祈福', '斋醮', '开光', '赴任', '出行']],
                '申' => ['yi' => ['赴任', '出行', '求财', '见贵', '订婚', '嫁娶', '入宅', '开市', '祈福'], 'ji' => ['开光', '修造', '安葬']],
                '酉' => ['yi' => ['求嗣', '嫁娶', '移徙', '入宅', '开市', '交易', '修造', '安葬', '赴任', '出行', '求财'], 'ji' => ['无']],
                '戌' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床'], 'ji' => ['上梁', '盖屋', '入殓', '赴任', '出行']],
                '亥' => [
                    'yi' => ['修造', '入宅', '安葬', '见贵', '嫁娶', '进人口', '移徙'],
                    'ji' => ['赴任', '出行', '求财', '朱雀须用', '凤凰符制', '否则', '诸事不宜']
                ]
            ],
            '辛未' => [
                '子' => ['yi' => ['嫁娶', '移徙', '入宅', '开市', '交易', '修造', '安葬'], 'ji' => ['赴任', '词讼', '祈福', '求嗣']],
                '丑' => ['yi' => ['无'], 'ji' => ['日时相冲', '诸事不宜']],
                '寅' => ['yi' => ['祈福', '求嗣', '出行', '求财', '嫁娶', '安葬'], 'ji' => ['修造', '动土']],
                '卯' => ['yi' => ['求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神']],
                '辰' => ['yi' => ['入宅', '修造', '安葬', '见贵', '求财', '嫁娶', '进人口', '移徙'], 'ji' => ['白虎须用', '麒麟符制', '否则', '诸事不宜', '祭祀', '祈福', '斋醮', '开光', '赴任', '出行']],
                '巳' => ['yi' => ['修造', '盖屋', '移徙', '安床', '入宅', '开市', '开仓', '酬神', '订婚', '嫁娶', '求财'], 'ji' => ['祭祀', '祈福', '斋醮', '开光', '赴任', '出行']],
                '午' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床', '祭祀'], 'ji' => ['赴任', '修造', '移徙', '出行', '词讼']],
                '未' => ['yi' => ['见贵', '求财', '嫁娶', '进人口', '移徙', '安葬'], 'ji' => ['造船', '乘船', '赴任', '出行', '修造', '动土']],
                '申' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '作灶', '祭祀', '赴任', '见贵'], 'ji' => ['上梁', '盖屋', '入殓']],
                '酉' => ['yi' => ['入宅', '安葬', '求财', '见贵', '订婚', '嫁娶'], 'ji' => ['赴任', '出行', '修造']],
                '戌' => ['yi' => ['订婚', '嫁娶', '安床', '移徙', '入宅', '修造', '安葬', '祭祀'], 'ji' => ['祈福', '求嗣', '乘船']],
                '亥' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '开市', '交易', '安床', '盖屋', '移徙', '作灶'], 'ji' => ['赴任', '出行', '求财', '开光', '修造', '安葬']]
            ],
            '壬申' => [
                '子' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床'], 'ji' => ['修造', '动土']],
                '丑' => ['yi' => ['祈福', '嫁娶', '修造', '造庙', '作灶', '入宅', '安葬', '赴任', '见贵', '求财', '出行'], 'ji' => ['无']],
                '寅' => ['yi' => ['无'], 'ji' => ['日时相冲', '诸事不宜']],
                '卯' => ['yi' => ['酬神', '求财', '见贵', '订婚', '嫁娶', '修造', '安葬', '青龙'], 'ji' => ['朱雀须用', '凤凰符制', '否则', '诸事不宜', '祭祀', '祈福', '斋醮', '开光', '赴任', '出行']],
                '辰' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '祭祀', '赴任', '见贵'], 'ji' => ['无']],
                '巳' => ['yi' => ['祈福', '求嗣', '出行', '求财', '嫁娶', '安葬', '祭祀'], 'ji' => ['无']],
                '午' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '赴任'], 'ji' => ['上梁', '盖屋', '入殓', '白虎须用', '麒麟符制', '否则', '诸事不宜']],
                '未' => ['yi' => ['修造', '入宅', '安葬', '祭祀', '祈福', '求嗣', '斋醮', '订婚', '嫁娶', '出行', '赴任'], 'ji' => ['无']],
                '申' => ['yi' => ['嫁娶', '入宅', '开市', '交易', '安葬'], 'ji' => ['赴任', '修造', '移徙', '出行', '词讼', '祈福', '求嗣', '乘船']],
                '酉' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '入宅', '求财', '开市', '交易', '安葬'], 'ji' => ['赴任', '出行', '修造', '动土']],
                '戌' => ['yi' => ['作灶', '祭祀', '祈福', '斋醮', '酬神'], 'ji' => ['赴任', '出行', '求财', '修造', '动土']],
                '亥' => ['yi' => ['求财', '见贵', '订婚', '嫁娶', '入宅', '开市', '安葬'], 'ji' => ['赴任', '出行', '修造']]
            ],
            '癸酉' => [
                '子' => ['yi' => ['求财', '见贵', '订婚', '嫁娶', '入宅', '开市', '安葬', '求嗣', '作灶'], 'ji' => ['祭祀', '祈福', '斋醮', '开光', '赴任', '出行']],
                '丑' => ['yi' => ['求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床'], 'ji' => ['赴任', '出行', '修造', '祭祀', '祈福', '斋醮', '开光']],
                '寅' => ['yi' => ['订婚', '嫁娶', '安床', '移徙', '入宅', '修造', '安葬', '赴任', '见贵', '出行', '求财'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神']],
                '卯' => ['yi' => ['无'], 'ji' => ['日时相冲', '诸事不宜']],
                '辰' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '祭祀'], 'ji' => ['上梁', '盖屋', '入殓']],
                '巳' => ['yi' => ['祈福', '求嗣', '出行', '求财', '嫁娶'], 'ji' => ['开光', '修造', '安葬']],
                '午' => ['yi' => ['订婚', '嫁娶', '开市', '安葬', '修造'], 'ji' => ['祈福', '求嗣', '乘船']],
                '未' => ['yi' => ['祭祀', '祈福', '斋醮', '酬神', '修造', '作灶', '见贵', '求财', '嫁娶', '进人口', '移徙', '安葬'], 'ji' => ['赴任', '出行']],
                '申' => [
                    'yi' => ['赴任', '出行', '求财', '见贵', '嫁娶', '进人口', '移徙', '安葬'],
                    'ji' => ['白虎须用', '麒麟符制', '否则', '诸事不宜', '祭祀', '祈福', '斋醮', '酬神', '修造', '动土']
                ],
                '酉' => ['yi' => ['修造', '盖屋', '移徙', '安床', '入宅', '开市', '开仓', '祈福', '订婚', '嫁娶', '赴任', '出行', '求财'], 'ji' => ['造桥', '乘船']],
                '戌' => ['yi' => ['见贵', '求财', '嫁娶', '进人口', '移徙', '安葬'], 'ji' => ['赴任', '出行', '祭祀', '祈福', '斋醮', '开光']],
                '亥' => ['yi' => ['求嗣', '嫁娶', '移徙', '入宅', '开市', '交易', '安葬', '见贵', '求财'], 'ji' => ['赴任', '出行', '修造', '动土', '祭祀', '祈福', '斋醮', '开光']]
            ],
            '甲戌' => [
                '子' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '入宅', '求财', '开市', '交易', '安葬'], 'ji' => ['赴任', '修造', '移徙', '出行', '词讼']],
                '丑' => ['yi' => ['祭祀', '祈福', '酬神', '求财', '见贵', '订婚', '嫁娶', '安葬', '青龙'], 'ji' => ['赴任', '出行', '修造', '动土']],
                '寅' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '赴任', '祭祀'], 'ji' => ['上梁', '盖屋', '入殓']],
                '卯' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床', '入宅', '安葬'], 'ji' => ['赴任', '出行', '修造']],
                '辰' => ['yi' => ['无'], 'ji' => ['日时相冲', '诸事不宜']],
                '巳' => ['yi' => ['盖屋', '移徙', '作灶', '安床', '入宅', '开市', '祭祀', '祈福', '出行', '订婚', '嫁娶'], 'ji' => ['开光', '修造', '安葬']],
                '午' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床'], 'ji' => ['赴任', '词讼', '修造', '动土']],
                '未' => [
                    'yi' => ['祭祀', '祈福', '酬神', '求财', '见贵', '订婚', '嫁娶', '修造', '安葬', '青龙', '入宅'],
                    'ji' => ['朱雀须用', '凤凰符制', '否则', '诸事不宜', '赴任', '出行']
                ],
                '申' => ['yi' => ['订婚', '嫁娶', '开市', '安葬', '赴任', '出行', '见贵', '求财'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神']],
                '酉' => ['yi' => ['赴任', '出行', '求财', '见贵'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神']],
                '戌' => ['yi' => ['祈福', '订婚', '嫁娶', '移徙', '开市', '修造', '入宅', '安葬'], 'ji' => ['白虎须用', '麒麟符制', '否则', '诸事不宜', '造船', '乘船']],
                '亥' => ['yi' => ['求嗣', '嫁娶', '移徙', '入宅', '开市', '交易', '修造', '安葬', '祭祀', '祈福', '斋醮', '酬神'], 'ji' => ['无']]
            ],
            '乙亥' => [
                '子' => ['yi' => ['祭祀', '祈福', '酬神', '出行', '求财', '见贵', '订婚', '嫁娶', '修造', '安葬', '青龙', '赴任'], 'ji' => ['上梁', '盖屋', '入殓']],
                '丑' => ['yi' => ['祭祀', '祈福', '酬神', '订婚', '嫁娶', '出行', '求财', '入宅', '安葬', '修造', '盖屋', '移徙', '安床', '赴任'], 'ji' => ['无']],
                '寅' => ['yi' => ['订婚', '嫁娶', '求财', '开市', '交易', '安床'], 'ji' => ['祈福', '求嗣', '赴任', '修造', '移徙', '出行', '词讼']],
                '卯' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '赴任'], 'ji' => ['无']],
                '辰' => ['yi' => ['作灶', '祭祀', '祈福', '斋醮', '酬神', '赴任', '见贵', '求财', '出行', '嫁娶', '进人口', '移徙', '安葬'], 'ji' => ['修造', '动土']],
                '巳' => ['yi' => ['无'], 'ji' => ['日时相冲', '诸事不宜']],
                '午' => ['yi' => ['求嗣', '嫁娶', '移徙', '入宅', '开市', '交易', '修造', '安葬', '订婚', '见贵', '求财'], 'ji' => ['祭祀', '祈福', '斋醮', '开光', '赴任', '出行']],
                '未' => ['yi' => ['求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床', '修造', '盖屋', '移徙', '作灶'], 'ji' => ['祭祀', '祈福', '斋醮', '开光', '赴任', '出行']],
                '申' => ['yi' => ['赴任', '出行', '求财', '见贵'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神', '开光', '修造', '安葬']],
                '酉' => ['yi' => ['无'], 'ji' => ['赴任', '出行', '求财', '朱雀须用', '凤凰符制', '否则', '诸事不宜']],
                '戌' => ['yi' => ['订婚', '嫁娶', '开市', '安葬'], 'ji' => ['上梁', '盖屋', '入殓', '祭祀', '祈福', '斋醮', '酬神']],
                '亥' => ['yi' => ['祭祀', '祈福', '酬神', '订婚', '嫁娶', '求财', '入宅', '安葬'], 'ji' => ['赴任', '出行']]
            ],
            '丙子' => [
                '子' => ['yi' => ['赴任', '出行', '求财', '见贵', '祭祀', '酬神'], 'ji' => ['祈福', '求嗣']],
                '丑' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '祭祀'], 'ji' => ['无']],
                '寅' => ['yi' => ['求嗣', '嫁娶', '移徙', '入宅', '开市', '交易', '安葬', '赴任', '出行', '见贵', '求财'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神', '修造', '动土']],
                '卯' => ['yi' => ['修造', '盖屋', '移徙', '安床', '入宅', '开市', '开仓', '见贵', '求财', '订婚', '嫁娶', '进人口'], 'ji' => ['赴任', '出行']],
                '辰' => ['yi' => ['求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床'], 'ji' => ['赴任', '出行', '祭祀', '祈福', '斋醮', '开光']],
                '巳' => ['yi' => ['求财', '见贵', '订婚', '嫁娶', '入宅', '开市', '安葬'], 'ji' => ['赴任', '出行', '修造', '动土', '祭祀', '祈福', '斋醮', '开光']],
                '午' => ['yi' => ['无'], 'ji' => ['日时相冲', '诸事不宜']],
                '未' => ['yi' => ['无'], 'ji' => ['修造', '动土', '赴任', '出行']],
                '申' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床'], 'ji' => ['上梁', '盖屋', '入殓']],
                '酉' => ['yi' => ['修造', '入宅', '安葬', '祭祀', '祈福', '酬神', '出行', '求财', '见贵', '订婚', '嫁娶', '赴任'], 'ji' => ['无']],
                '戌' => ['yi' => ['见贵', '求财', '出行', '嫁娶', '进人口', '移徙', '安葬'], 'ji' => ['赴任', '词讼', '祈福', '求嗣', '乘船']],
                '亥' => ['yi' => ['求嗣', '出行', '求财', '嫁娶'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神', '开光', '修造', '安葬']]
            ],
            '丁丑' => [
                '子' => ['yi' => ['求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神', '修造', '动土']],
                '丑' => ['yi' => ['赴任', '出行', '见贵', '求财', '嫁娶', '进人口', '移徙', '安葬', '祈福'], 'ji' => ['造船', '乘船', '朱雀须用', '凤凰符制', '否则', '诸事不宜']],
                '寅' => ['yi' => ['订婚', '嫁娶', '开市'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神', '开光', '修造', '安葬']],
                '卯' => ['yi' => ['酬神', '修造', '作灶'], 'ji' => ['赴任', '出行', '祭祀', '祈福', '斋醮', '开光']],
                '辰' => ['yi' => ['无'], 'ji' => ['修造', '动土', '白虎须用', '麒麟符制', '否则', '诸事不宜']],
                '巳' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '修造', '盖屋', '移徙', '赴任'], 'ji' => ['无']],
                '午' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床'], 'ji' => ['上梁', '盖屋', '入殓', '赴任', '修造', '移徙', '出行', '词讼']],
                '未' => ['yi' => ['无'], 'ji' => ['日时相冲', '诸事不宜']],
                '申' => ['yi' => ['作灶', '祭祀', '斋醮', '酬神', '修造'], 'ji' => ['祈福', '求嗣', '赴任', '出行', '求财']],
                '酉' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '祭祀'], 'ji' => ['无']],
                '戌' => ['yi' => ['祈福', '订婚', '嫁娶', '安床', '移徙', '入宅', '安葬'], 'ji' => ['赴任', '出行', '修造', '动土']],
                '亥' => ['yi' => ['赴任', '出行', '求财', '见贵', '祭祀', '祈福', '酬神', '修造', '盖屋', '移徙', '作灶', '安床', '入宅', '开市'], 'ji' => ['无']]
            ],
            '戊寅' => [
                '子' => ['yi' => ['订婚', '嫁娶', '开市', '安葬', '见贵', '求财'], 'ji' => ['祭祀', '祈福', '斋醮', '开光', '赴任', '出行']],
                '丑' => ['yi' => ['修造', '盖屋', '移徙', '作灶', '安床', '入宅', '开市', '出行', '求财', '见贵', '订婚', '嫁娶'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神']],
                '寅' => ['yi' => ['求嗣', '嫁娶', '移徙', '入宅', '开市', '交易', '修造', '安葬', '祈福', '订婚'], 'ji' => ['赴任', '词讼']],
                '卯' => ['yi' => ['入宅', '修造', '安葬', '赴任', '出行', '求财', '见贵', '祭祀', '祈福', '酬神'], 'ji' => ['朱雀须用', '凤凰符制', '否则', '诸事不宜']],
                '辰' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '赴任', '见贵'], 'ji' => ['上梁', '盖屋', '入殓']],
                '巳' => ['yi' => ['入宅', '赴任', '出行', '求财', '见贵', '订婚', '嫁娶'], 'ji' => ['开光', '修造', '安葬']],
                '午' => ['yi' => ['订婚', '嫁娶', '移徙', '开市', '修造', '入宅', '安葬'], 'ji' => ['祈福', '求嗣']],
                '未' => ['yi' => ['修造', '盖屋', '移徙', '安床', '入宅', '开市', '开仓', '祭祀', '祈福', '酬神', '出行', '求财', '见贵', '订婚'], 'ji' => ['无']],
                '申' => ['yi' => ['无'], 'ji' => ['日时相冲', '诸事不宜']],
                '酉' => ['yi' => ['无'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神', '赴任', '出行', '修造', '动土']],
                '戌' => ['yi' => ['作灶', '酬神', '修造'], 'ji' => ['祭祀', '祈福', '斋醮', '开光', '赴任', '出行']],
                '亥' => ['yi' => ['合脊', '嫁娶', '安葬'], 'ji' => ['赴任', '出行', '修造', '祭祀', '祈福', '斋醮', '开光']]
            ],
            '己卯' => [
                '子' => ['yi' => ['祭祀', '祈福', '酬神', '出行', '求财', '见贵', '订婚', '嫁娶', '修造', '安葬', '青龙', '作灶'], 'ji' => ['无']],
                '丑' => ['yi' => ['祭祀', '祈福', '求嗣', '斋醮', '订婚', '嫁娶', '安葬'], 'ji' => ['赴任', '出行', '修造']],
                '寅' => ['yi' => ['求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床'], 'ji' => ['上梁', '盖屋', '入殓', '祭祀', '祈福', '斋醮', '酬神']],
                '卯' => ['yi' => ['修造', '入宅', '安葬'], 'ji' => ['造船', '乘船']],
                '辰' => ['yi' => ['祭祀', '斋醮', '订婚', '嫁娶', '出行', '安葬'], 'ji' => ['赴任', '词讼', '祈福', '求嗣', '乘船']],
                '巳' => ['yi' => ['赴任', '出行', '见贵', '求财', '嫁娶', '入宅', '移徙', '求嗣'], 'ji' => ['朱雀须用', '凤凰符制', '否则', '诸事不宜', '开光', '修造', '安葬']],
                '午' => ['yi' => ['祈福', '订婚', '嫁娶', '开市', '安葬', '赴任', '出行', '求财', '见贵'], 'ji' => ['修造', '动土']],
                '未' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '祭祀'], 'ji' => ['无']],
                '申' => ['yi' => ['求嗣', '嫁娶', '安葬'], 'ji' => ['赴任', '出行', '求财', '祭祀', '祈福', '斋醮', '开光']],
                '酉' => ['yi' => ['无'], 'ji' => ['日时相冲', '诸事不宜']],
                '戌' => ['yi' => ['祭祀', '祈福', '合脊', '嫁娶', '安葬'], 'ji' => ['赴任', '修造', '移徙', '出行', '词讼']],
                '亥' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床', '见贵'], 'ji' => ['赴任', '出行']]
            ],
            '庚辰' => [
                '子' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床'], 'ji' => ['上梁', '盖屋', '入殓', '赴任', '修造', '移徙', '出行', '词讼']],
                '丑' => ['yi' => ['入宅', '安葬', '祭祀', '祈福', '酬神', '求财', '见贵', '订婚', '嫁娶'], 'ji' => ['赴任', '出行', '修造', '动土']],
                '寅' => ['yi' => ['作灶', '祭祀', '斋醮', '酬神', '修造', '赴任', '出行', '见贵', '求财', '嫁娶', '入宅', '移徙', '安葬'], 'ji' => ['祈福', '求嗣']],
                '卯' => ['yi' => ['求嗣', '订婚', '嫁娶', '修造', '入宅', '求财', '开市', '交易', '安葬', '赴任', '出行', '见贵'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神']],
                '辰' => ['yi' => ['祈福', '订婚', '嫁娶', '安床', '移徙', '入宅', '安葬', '赴任', '出行', '求财', '见贵'], 'ji' => ['造桥', '乘船', '修造', '动土']],
                '巳' => ['yi' => ['求嗣', '嫁娶', '移徙', '入宅', '开市', '交易', '修造', '安葬', '祭祀', '祈福', '斋醮', '酬神'], 'ji' => ['无']],
                '午' => ['yi' => ['出行', '求财', '见贵', '酬神'], 'ji' => ['赴任', '词讼', '祭祀', '祈福', '斋醮', '开光']],
                '未' => ['yi' => ['见贵', '求财', '嫁娶', '进人口', '移徙', '安葬', '酬神'], 'ji' => ['祭祀', '祈福', '斋醮', '开光', '赴任', '出行', '朱雀须用', '凤凰符制', '否则', '诸事不宜']],
                '申' => ['yi' => ['赴任', '出行', '求财', '见贵', '订婚', '嫁娶', '入宅', '开市', '祈福', '求嗣'], 'ji' => ['开光', '修造', '安葬']],
                '酉' => ['yi' => ['求嗣', '嫁娶', '移徙', '入宅', '开市', '交易', '修造', '安葬', '祭祀', '祈福', '斋醮', '酬神'], 'ji' => ['无']],
                '戌' => ['yi' => ['无'], 'ji' => ['日时相冲', '诸事不宜']],
                '亥' => ['yi' => ['修造', '入宅', '安葬', '赴任', '出行', '见贵', '求财', '订婚', '嫁娶', '进人口', '移徙'], 'ji' => ['无']]
            ],
            '辛巳' => [
                '子' => ['yi' => ['嫁娶', '移徙', '入宅', '开市', '交易', '修造', '安葬', '赴任', '出行', '求财'], 'ji' => ['白虎须用', '麒麟符制', '否则', '诸事不宜', '祈福', '求嗣']],
                '丑' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '修造', '安葬', '赴任'], 'ji' => ['无']],
                '寅' => ['yi' => ['祭祀', '祈福', '酬神', '求财', '见贵', '订婚', '嫁娶', '安葬', '青龙'], 'ji' => ['修造', '动土', '赴任', '出行']],
                '卯' => ['yi' => ['求财', '嫁娶', '移徙', '开市', '安葬'], 'ji' => ['赴任', '出行', '修造', '动土', '祭祀', '祈福', '斋醮', '酬神']],
                '辰' => ['yi' => ['作灶', '修造'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神']],
                '巳' => ['yi' => ['酬神', '订婚', '嫁娶', '求财', '入宅', '安葬'], 'ji' => ['祭祀', '祈福', '斋醮', '开光', '赴任', '出行']],
                '午' => ['yi' => ['祈福', '订婚', '嫁娶', '安床', '移徙', '入宅', '修造', '安葬', '祭祀', '赴任', '出行', '求财', '见贵'], 'ji' => ['无']],
                '未' => ['yi' => ['祭祀', '祈福', '求嗣', '斋醮', '出行', '嫁娶', '安葬', '修造', '盖屋', '移徙', '作灶', '安床', '入宅', '开市'], 'ji' => ['无']],
                '申' => ['yi' => ['祭祀', '祈福', '合脊', '嫁娶', '修造', '安葬', '求嗣'], 'ji' => ['上梁', '盖屋', '入殓']],
                '酉' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床'], 'ji' => ['朱雀须用', '凤凰符制', '否则', '诸事不宜', '赴任', '出行']],
                '戌' => ['yi' => ['订婚', '嫁娶', '开市', '安葬'], 'ji' => ['祈福', '求嗣', '乘船']],
                '亥' => ['yi' => ['无'], 'ji' => ['日时相冲', '诸事不宜']]
            ],
            '壬午' => [
                '子' => ['yi' => ['无'], 'ji' => ['日时相冲', '诸事不宜']],
                '丑' => ['yi' => ['祭祀', '祈福', '斋醮', '酬神', '作灶'], 'ji' => ['修造', '动土']],
                '寅' => ['yi' => ['求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神', '开光', '修造', '安葬']],
                '卯' => ['yi' => ['修造', '盖屋', '移徙', '安床', '入宅', '开市', '开仓', '酬神', '求财', '见贵', '订婚', '嫁娶'], 'ji' => ['祭祀', '祈福', '斋醮', '开光', '赴任', '出行']],
                '辰' => ['yi' => ['祭祀', '祈福', '酬神', '订婚', '嫁娶', '求财', '入宅', '安葬'], 'ji' => ['赴任', '修造', '移徙', '出行', '词讼']],
                '巳' => ['yi' => ['求财', '见贵'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神', '赴任', '出行', '修造', '动土']],
                '午' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床', '作灶', '祭祀'], 'ji' => ['上梁', '盖屋', '入殓', '赴任', '出行']],
                '未' => ['yi' => ['祭祀', '祈福', '合脊', '嫁娶', '安葬'], 'ji' => ['赴任', '出行', '修造']],
                '申' => ['yi' => ['订婚', '嫁娶', '安床', '移徙', '入宅', '修造', '安葬', '赴任', '出行', '见贵', '求财'], 'ji' => ['祈福', '求嗣']],
                '酉' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '修造', '入宅', '开市', '交易', '安葬'], 'ji' => ['赴任', '出行', '求财']],
                '戌' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '见贵'], 'ji' => ['赴任', '词讼', '修造', '动土']],
                '亥' => ['yi' => ['祈福', '求嗣', '出行', '求财', '嫁娶', '安葬', '赴任', '见贵'], 'ji' => ['朱雀须用', '凤凰符制', '否则', '诸事不宜']]
            ],
            '癸未' => [
                '子' => ['yi' => ['出行', '求财', '见贵', '订婚', '嫁娶', '入宅', '开市', '安葬', '求嗣'], 'ji' => ['赴任', '词讼', '祭祀', '祈福', '斋醮', '开光']],
                '丑' => ['yi' => ['无'], 'ji' => ['日时相冲', '诸事不宜']],
                '寅' => ['yi' => ['求嗣', '订婚', '嫁娶', '修造', '入宅', '开市', '交易', '安葬'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神']],
                '卯' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '祭祀'], 'ji' => ['无']],
                '辰' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床'], 'ji' => ['上梁', '盖屋', '入殓', '白虎须用', '麒麟符制', '否则', '诸事不宜']],
                '巳' => ['yi' => ['盖屋', '移徙', '安床', '入宅', '开市', '开仓', '祭祀', '祈福', '酬神', '出行', '求财', '见贵', '订婚', '嫁娶'], 'ji' => ['开光', '修造', '安葬']],
                '午' => ['yi' => ['订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床'], 'ji' => ['祈福', '求嗣', '祭祀']],
                '未' => ['yi' => ['见贵', '求财', '嫁娶', '进人口', '移徙', '安葬'], 'ji' => ['赴任', '出行']],
                '申' => ['yi' => ['作灶', '祭祀', '祈福', '斋醮', '酬神', '赴任', '出行', '求财', '见贵', '嫁娶', '进人口', '移徙', '安葬'], 'ji' => ['修造', '动土']],
                '酉' => ['yi' => ['无'], 'ji' => ['赴任', '出行', '求财']],
                '戌' => ['yi' => ['订婚', '嫁娶', '安床', '移徙', '入宅', '修造', '安葬'], 'ji' => ['祭祀', '祈福', '斋醮', '开光', '赴任', '出行']],
                '亥' => [
                    'yi' => ['求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床', '修造', '盖屋', '移徙', '作灶'],
                    'ji' => ['祭祀', '祈福', '斋醮', '开光', '赴任', '出行']]
            ],
            '甲申' => [
                '子' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '赴任'], 'ji' => ['无']],
                '丑' => ['yi' => ['祈福', '求嗣', '出行', '求财', '嫁娶', '安葬', '修造', '盖屋', '移徙', '作灶', '安床', '入宅', '开市', '赴任'], 'ji' => ['无']],
                '寅' => ['yi' => ['无'], 'ji' => ['日时相冲', '诸事不宜']],
                '卯' => ['yi' => ['修造', '入宅', '安葬', '求嗣', '嫁娶', '移徙', '祭祀', '祈福', '斋醮', '酬神'], 'ji' => ['朱雀须用', '凤凰符制', '否则', '诸事不宜']],
                '辰' => ['yi' => ['祭祀', '出行', '订婚', '嫁娶', '入宅', '修造', '安葬'], 'ji' => ['祈福', '求嗣']],
                '巳' => ['yi' => ['祭祀', '祈福', '合脊', '嫁娶'], 'ji' => ['开光', '修造', '安葬']],
                '午' => ['yi' => ['祈福', '订婚', '嫁娶', '移徙', '入宅', '安葬'], 'ji' => ['赴任', '出行', '白虎须用', '麒麟符制', '否则', '诸事不宜', '修造', '动土']],
                '未' => ['yi' => ['修造', '盖屋', '移徙', '安床', '入宅', '开市', '开仓', '出行', '求财', '见贵', '订婚', '嫁娶'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神']],
                '申' => ['yi' => ['求嗣', '嫁娶', '入宅', '开市', '交易', '安葬'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神', '赴任', '修造', '移徙', '出行', '词讼']],
                '酉' => ['yi' => ['求财', '见贵', '酬神'], 'ji' => ['赴任', '出行', '修造', '动土', '祭祀', '祈福', '斋醮', '开光']],
                '戌' => ['yi' => ['作灶', '祭祀', '祈福', '斋醮', '酬神', '修造', '赴任', '出行', '求财', '见贵', '嫁娶', '进人口', '移徙', '安葬'], 'ji' => ['无']],
                '亥' => ['yi' => ['求嗣', '嫁娶', '移徙', '入宅', '开市', '交易', '修造', '安葬', '祈福'], 'ji' => ['无']]
            ],
            '乙酉' => [
                '子' => ['yi' => ['祈福', '求嗣', '出行', '求财', '嫁娶', '安葬', '作灶', '祭祀'], 'ji' => ['上梁', '盖屋', '入殓']],
                '丑' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '祭祀'], 'ji' => ['无']],
                '寅' => ['yi' => ['订婚', '嫁娶', '安床', '移徙', '入宅', '修造', '安葬', '赴任', '见贵', '出行', '求财'], 'ji' => ['祈福', '求嗣']],
                '卯' => ['yi' => ['无'], 'ji' => ['日时相冲', '诸事不宜']],
                '辰' => ['yi' => ['祭祀', '祈福', '合脊', '嫁娶', '安葬'], 'ji' => ['修造', '动土']],
                '巳' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床'], 'ji' => ['赴任', '出行', '朱雀须用', '凤凰符制', '否则', '诸事不宜']],
                '午' => ['yi' => ['求嗣', '嫁娶', '移徙', '入宅', '开市', '交易', '修造', '安葬', '订婚'], 'ji' => ['赴任', '出行', '求财', '祭祀', '祈福', '斋醮', '开光']],
                '未' => ['yi' => ['酬神', '修造', '作灶'], 'ji' => ['赴任', '出行', '求财', '祭祀', '祈福', '斋醮', '开光']],
                '申' => ['yi' => ['赴任', '出行', '求财', '见贵'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神', '开光', '修造', '安葬']],
                '酉' => ['yi' => ['修造', '盖屋', '移徙', '安床', '入宅', '开市', '开仓', '赴任', '出行', '求财', '嫁娶'], 'ji' => ['造桥', '乘船']],
                '戌' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '赴任'], 'ji' => ['上梁', '盖屋', '入殓']],
                '亥' => ['yi' => ['祭祀', '祈福', '酬神', '订婚', '嫁娶', '求财', '入宅', '安葬'], 'ji' => ['赴任', '出行', '修造', '动土']]
            ],
            '丙戌' => [
                '子' => ['yi' => ['求财', '见贵', '祭祀', '酬神'], 'ji' => ['赴任', '修造', '移徙', '出行', '词讼', '祈福', '求嗣']],
                '丑' => ['yi' => ['修造', '安葬', '求财', '见贵', '嫁娶', '进人口', '移徙'], 'ji' => ['赴任', '出行']],
                '寅' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '作灶', '祭祀'], 'ji' => ['修造', '动土']],
                '卯' => ['yi' => ['祭祀', '祈福', '合脊', '嫁娶', '安葬'], 'ji' => ['赴任', '出行', '修造']],
                '辰' => ['yi' => ['无'], 'ji' => ['日时相冲', '诸事不宜']],
                '巳' => ['yi' => ['求财', '见贵', '订婚', '嫁娶', '入宅', '开市', '安葬', '修造', '盖屋', '移徙', '作灶', '安床'], 'ji' => ['祭祀', '祈福', '斋醮', '开光', '赴任', '出行']],
                '午' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '赴任'], 'ji' => ['无']],
                '未' => ['yi' => ['见贵', '求财', '嫁娶', '进人口', '移徙', '安葬'], 'ji' => ['赴任', '出行', '朱雀须用', '凤凰符制', '否则', '诸事不宜']],
                '申' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '赴任', '见贵'], 'ji' => ['上梁', '盖屋', '入殓']],
                '酉' => ['yi' => ['修造', '入宅', '安葬', '出行', '求财', '见贵', '订婚', '嫁娶'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神']],
                '戌' => ['yi' => ['祭祀', '斋醮', '订婚', '嫁娶', '出行', '安葬'], 'ji' => ['造船', '乘船', '祈福', '求嗣', '白虎须用', '麒麟符制', '否则', '诸事不宜']],
                '亥' => ['yi' => ['盖屋', '移徙', '安床', '入宅', '开市', '开仓', '祭祀', '祈福', '酬神', '出行', '求财', '见贵', '订婚', '嫁娶'], 'ji' => ['开光', '修造', '安葬']]
            ],
            '丁亥' => [
                '子' => ['yi' => ['赴任', '出行', '求财', '嫁娶', '移徙', '开市', '安葬'], 'ji' => ['白虎须用', '麒麟符制', '否则', '诸事不宜', '修造', '动土']],
                '丑' => ['yi' => ['修造', '盖屋', '移徙', '安床', '入宅', '开市', '开仓', '赴任', '出行', '见贵', '求财', '订婚', '嫁娶', '进人口'], 'ji' => ['无']],
                '寅' => ['yi' => ['合脊', '嫁娶', '修造', '安葬'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神']],
                '卯' => ['yi' => ['求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床'], 'ji' => ['赴任', '出行', '修造', '动土', '祭祀', '祈福', '斋醮', '开光']],
                '辰' => ['yi' => ['作灶', '祭祀', '祈福', '斋醮', '酬神', '修造', '赴任', '见贵', '求财', '出行', '嫁娶', '进人口', '移徙', '安葬'], 'ji' => ['无']],
                '巳' => ['yi' => ['无'], 'ji' => ['日时相冲', '诸事不宜']],
                '午' => ['yi' => ['祈福', '求嗣', '出行', '求财', '嫁娶', '安葬'], 'ji' => ['修造', '动土']],
                '未' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '修造', '入宅', '安葬', '祭祀'], 'ji' => ['无']],
                '申' => ['yi' => ['入宅', '修造', '安葬'], 'ji' => ['赴任', '词讼', '祈福', '求嗣', '乘船']],
                '酉' => ['yi' => ['祭祀', '祈福', '酬神', '出行', '求财', '见贵', '订婚', '嫁娶', '修造', '安葬', '青龙'], 'ji' => ['朱雀须用', '凤凰符制', '否则', '诸事不宜']],
                '戌' => ['yi' => ['订婚', '嫁娶', '开市', '安葬'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神', '修造', '动土']],
                '亥' => ['yi' => ['求财', '见贵', '祭祀', '祈福', '酬神'], 'ji' => ['赴任', '出行']]
            ],
            '戊子' => [
                '子' => ['yi' => ['订婚', '嫁娶', '开市', '安葬', '见贵', '求财'], 'ji' => ['祭祀', '祈福', '斋醮', '开光', '赴任', '出行']],
                '丑' => ['yi' => ['合脊', '嫁娶', '修造', '安葬'], 'ji' => ['祭祀', '祈福', '斋醮', '开光', '赴任', '出行']],
                '寅' => ['yi' => ['求嗣', '嫁娶', '移徙', '入宅', '开市', '交易', '修造', '安葬', '见贵', '求财'], 'ji' => ['赴任', '出行']],
                '卯' => ['yi' => ['求财', '见贵', '祭祀', '祈福', '酬神', '修造', '盖屋', '移徙', '安床', '入宅', '开市', '开仓'], 'ji' => ['赴任', '出行']],
                '辰' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '祭祀'], 'ji' => ['上梁', '盖屋', '入殓']],
                '巳' => ['yi' => ['入宅', '赴任', '出行', '求财', '见贵', '订婚', '嫁娶'], 'ji' => ['开光', '修造', '安葬']],
                '午' => ['yi' => ['无'], 'ji' => ['日时相冲', '诸事不宜']],
                '未' => ['yi' => ['祈福', '求嗣', '求财', '嫁娶', '安葬'], 'ji' => ['赴任', '出行', '修造']],
                '申' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '祭祀'], 'ji' => ['修造', '动土']],
                '酉' => ['yi' => ['修造', '盖屋', '移徙', '作灶', '安床', '入宅', '开市', '赴任', '出行', '求财', '嫁娶'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神']],
                '戌' => ['yi' => ['见贵', '求财', '嫁娶', '进人口', '移徙', '安葬'], 'ji' => ['祭祀', '祈福', '斋醮', '开光', '赴任', '出行']],
                '亥' => ['yi' => ['赴任', '见贵', '出行', '求财', '嫁娶', '进人口', '移徙', '安葬'], 'ji' => ['朱雀须用', '凤凰符制', '否则', '诸事不宜', '祭祀', '祈福', '斋醮', '酬神']]
            ],
            '己丑' => [
                '子' => ['yi' => ['祈福', '求嗣', '出行', '求财', '嫁娶', '安葬'], 'ji' => ['无']],
                '丑' => ['yi' => ['见贵', '求财', '嫁娶', '进人口', '移徙', '安葬'], 'ji' => ['造船', '乘船', '赴任', '出行', '朱雀须用', '凤凰符制', '否则', '诸事不宜']],
                '寅' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '赴任'], 'ji' => ['上梁', '盖屋', '入殓']],
                '卯' => ['yi' => ['修造', '入宅', '安葬', '祈福', '斋醮', '出行', '订婚', '嫁娶', '祭祀'], 'ji' => ['无']],
                '辰' => ['yi' => ['无'], 'ji' => ['祈福', '求嗣', '白虎须用', '麒麟符制', '否则', '诸事不宜']],
                '巳' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '盖屋', '移徙'], 'ji' => ['开光', '修造', '安葬']],
                '午' => ['yi' => ['祈福', '求嗣', '出行', '求财', '嫁娶', '安葬', '赴任'], 'ji' => ['修造', '动土']],
                '未' => ['yi' => ['无'], 'ji' => ['日时相冲', '诸事不宜']],
                '申' => ['yi' => ['作灶', '酬神', '修造', '见贵', '求财', '嫁娶', '进人口', '移徙', '安葬'], 'ji' => ['祭祀', '祈福', '斋醮', '开光', '赴任', '出行']],
                '酉' => ['yi' => ['求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神']],
                '戌' => ['yi' => ['祈福', '订婚', '嫁娶', '安床', '移徙', '入宅', '修造', '安葬', '祭祀'], 'ji' => ['赴任', '出行']],
                '亥' => ['yi' => ['修造', '盖屋', '移徙', '作灶', '安床', '入宅', '开市', '祈福', '嫁娶', '见贵', '求财'], 'ji' => ['赴任', '出行']]
            ],
            '庚寅' => [
                '子' => ['yi' => ['祈福', '订婚', '嫁娶', '安床', '移徙', '入宅', '修造', '安葬', '赴任', '出行', '求财'], 'ji' => ['上梁', '盖屋', '入殓']],
                '丑' => ['yi' => ['出行', '求财', '见贵', '订婚', '嫁娶', '修造', '安葬', '青龙'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神']],
                '寅' => ['yi' => ['嫁娶', '移徙', '入宅', '开市', '交易', '修造', '安葬'], 'ji' => ['赴任', '词讼', '祈福', '求嗣', '乘船']],
                '卯' => ['yi' => ['求嗣', '订婚', '嫁娶', '修造', '入宅', '求财', '开市', '交易', '安葬'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神']],
                '辰' => ['yi' => ['祈福', '斋醮', '出行', '订婚', '嫁娶', '移徙', '开市', '安葬', '赴任', '见贵', '求财'], 'ji' => ['修造', '动土']],
                '巳' => ['yi' => ['祭祀', '祈福', '斋醮', '酬神', '修造', '作灶', '求嗣', '嫁娶', '移徙', '入宅', '开市', '交易'], 'ji' => ['无']],
                '午' => ['yi' => ['求嗣', '订婚', '嫁娶', '开市', '交易', '安床'], 'ji' => ['赴任', '出行', '求财', '祭祀', '祈福', '斋醮', '开光']],
                '未' => ['yi' => ['修造', '盖屋', '移徙', '安床', '入宅', '开市', '开仓', '酬神', '求财', '见贵', '订婚', '嫁娶'], 'ji' => ['祭祀', '祈福', '斋醮', '开光', '赴任', '出行']],
                '申' => ['yi' => ['无'], 'ji' => ['日时相冲', '诸事不宜']],
                '酉' => ['yi' => ['求嗣', '嫁娶', '移徙', '入宅', '开市', '交易', '安葬', '祈福'], 'ji' => ['赴任', '出行', '修造', '动土']],
                '戌' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '作灶', '祭祀'], 'ji' => ['上梁', '盖屋', '入殓']],
                '亥' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床', '入宅', '安葬'], 'ji' => ['赴任', '出行', '修造']]
            ],
            '辛卯' => [
                '子' => ['yi' => ['作灶', '祭祀', '斋醮', '酬神', '修造', '嫁娶', '移徙', '入宅', '开市', '交易'], 'ji' => ['祈福', '求嗣', '赴任', '出行']],
                '丑' => ['yi' => ['安葬', '祭祀', '祈福', '求嗣', '斋醮', '订婚', '嫁娶'], 'ji' => ['赴任', '出行', '修造']],
                '寅' => ['yi' => ['订婚', '嫁娶', '安床', '移徙', '入宅', '修造', '安葬'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神', '上梁', '盖屋', '入殓']],
                '卯' => ['yi' => ['修造', '盖屋', '移徙', '作灶', '安床', '入宅', '开市'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神']],
                '辰' => ['yi' => ['求嗣', '订婚', '嫁娶', '出行', '安葬'], 'ji' => ['赴任', '词讼', '祭祀', '祈福', '斋醮', '开光']],
                '巳' => ['yi' => ['酬神', '订婚', '嫁娶', '求财', '入宅', '安葬'], 'ji' => ['朱雀须用', '凤凰符制', '否则', '诸事不宜', '祭祀', '祈福', '斋醮', '开光', '赴任', '出行']],
                '午' => ['yi' => ['祭祀', '祈福', '酬神', '见贵', '订婚', '嫁娶', '修造', '安葬', '青龙'], 'ji' => ['赴任', '出行', '求财']],
                '未' => ['yi' => ['祭祀', '祈福', '出行', '订婚', '嫁娶', '入宅', '修造', '安葬'], 'ji' => ['无']],
                '申' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床'], 'ji' => ['上梁', '盖屋', '入殓', '白虎须用', '麒麟符制', '否则', '诸事不宜']],
                '酉' => ['yi' => ['无'], 'ji' => ['日时相冲', '诸事不宜']],
                '戌' => ['yi' => ['订婚', '嫁娶', '求财', '开市', '交易', '安床'], 'ji' => ['赴任', '修造', '移徙', '出行', '词讼', '祈福', '求嗣', '乘船']],
                '亥' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床', '见贵'], 'ji' => ['赴任', '出行', '修造', '动土', '开光']]
            ],
            '壬辰' => [
                '子' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床'], 'ji' => ['修造', '动土', '赴任']],
                '丑' => ['yi' => ['求财', '见贵', '嫁娶', '进人口', '移徙', '安葬', '祈福'], 'ji' => ['赴任', '出行', '修造', '动土']],
                '寅' => ['yi' => ['见贵', '求财', '嫁娶', '入宅', '移徙', '安葬'], 'ji' => ['祭祀', '祈福', '斋醮', '开光', '赴任', '出行']],
                '卯' => ['yi' => ['求嗣', '嫁娶', '移徙', '入宅', '开市', '交易', '修造', '安葬', '出行', '求财', '见贵', '订婚'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神']],
                '辰' => ['yi' => ['祈福', '订婚', '嫁娶', '安床', '移徙', '入宅', '修造', '安葬', '祭祀'], 'ji' => ['造桥', '乘船']],
                '巳' => ['yi' => ['求嗣', '出行', '入宅', '嫁娶', '修造', '安葬', '赴任'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神']],
                '午' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '赴任'], 'ji' => ['上梁', '盖屋', '入殓']],
                '未' => ['yi' => ['修造', '入宅', '安葬', '祈福', '嫁娶'], 'ji' => ['朱雀须用', '凤凰符制', '否则', '诸事不宜']],
                '申' => ['yi' => ['订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床'], 'ji' => ['祈福', '求嗣']],
                '酉' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '祭祀'], 'ji' => ['无']],
                '戌' => ['yi' => ['无'], 'ji' => ['日时相冲', '诸事不宜']],
                '亥' => ['yi' => ['赴任', '出行', '求财', '见贵', '订婚', '嫁娶', '入宅', '开市', '安葬', '修造', '盖屋', '移徙', '安床'], 'ji' => ['无']]
            ],
            '癸巳' => [
                '子' => ['yi' => ['求嗣', '求财', '嫁娶', '安葬'], 'ji' => ['祭祀', '祈福', '斋醮', '开光', '赴任', '出行']],
                '丑' => ['yi' => ['修造', '盖屋', '移徙', '安床', '入宅', '开市', '开仓', '求嗣', '订婚', '嫁娶', '求财'], 'ji' => ['祭祀', '祈福', '斋醮', '开光', '赴任', '出行']],
                '寅' => ['yi' => ['无'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神', '赴任', '出行']],
                '卯' => ['yi' => ['求嗣', '嫁娶', '移徙', '入宅', '开市', '交易', '修造', '安葬', '祭祀', '祈福', '酬神', '出行', '求财', '见贵'], 'ji' => ['无']],
                '辰' => ['yi' => ['求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '作灶'], 'ji' => ['上梁', '盖屋', '入殓', '祭祀', '祈福', '斋醮', '酬神']],
                '巳' => ['yi' => ['入宅', '祭祀', '祈福', '酬神', '出行', '求财', '见贵', '订婚', '嫁娶', '赴任'], 'ji' => ['开光', '修造', '安葬']],
                '午' => ['yi' => ['订婚', '嫁娶', '安床', '移徙', '入宅', '修造', '安葬'], 'ji' => ['祈福', '求嗣', '乘船']],
                '未' => ['yi' => ['修造', '盖屋', '移徙', '作灶', '安床', '入宅', '开市', '祭祀', '祈福', '求嗣', '斋醮', '订婚', '嫁娶', '安葬'], 'ji' => ['赴任', '出行']],
                '申' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '赴任'], 'ji' => ['修造', '动土']],
                '酉' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床'], 'ji' => ['赴任', '出行', '朱雀须用', '凤凰符制', '否则', '诸事不宜']],
                '戌' => ['yi' => ['订婚', '嫁娶', '开市', '安葬'], 'ji' => ['祭祀', '祈福', '斋醮', '开光', '赴任', '出行']],
                '亥' => ['yi' => ['无'], 'ji' => ['日时相冲', '诸事不宜']]
            ],
            '甲午' => [
                '子' => ['yi' => ['无'], 'ji' => ['日时相冲', '诸事不宜']],
                '丑' => ['yi' => ['祭祀', '祈福', '斋醮', '酬神', '修造', '作灶'], 'ji' => ['无']],
                '寅' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '赴任', '祭祀'], 'ji' => ['上梁', '盖屋', '入殓']],
                '卯' => ['yi' => ['求嗣', '嫁娶', '移徙', '入宅', '开市', '交易', '修造', '安葬', '赴任', '出行', '见贵', '求财', '订婚'], 'ji' => ['无']],
                '辰' => ['yi' => ['祭祀', '斋醮', '订婚', '嫁娶', '安葬'], 'ji' => ['赴任', '修造', '移徙', '出行', '词讼', '祈福', '求嗣', '乘船']],
                '巳' => ['yi' => ['订婚', '嫁娶', '移徙', '入宅', '安葬'], 'ji' => ['赴任', '出行', '修造', '动土', '祭祀', '祈福', '斋醮', '酬神', '开光']],
                '午' => ['yi' => ['祈福', '嫁娶', '造庙', '作灶', '入宅', '安葬'], 'ji' => ['赴任', '出行', '修造', '动土']],
                '未' => ['yi' => ['祈福', '求嗣', '求财', '嫁娶', '安葬'], 'ji' => ['赴任', '出行', '修造']],
                '申' => ['yi' => ['订婚', '嫁娶', '安床', '移徙', '入宅', '修造', '安葬', '赴任', '出行', '见贵', '求财'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神']],
                '酉' => ['yi' => ['求财', '见贵', '酬神', '修造', '盖屋', '移徙', '作灶', '安床', '入宅', '开市'], 'ji' => ['祭祀', '祈福', '斋醮', '开光', '赴任', '出行']],
                '戌' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '见贵'], 'ji' => ['赴任', '词讼']],
                '亥' => ['yi' => ['求嗣', '嫁娶', '移徙', '入宅', '开市', '交易', '修造', '安葬', '赴任', '见贵', '出行', '求财'], 'ji' => ['朱雀须用', '凤凰符制', '否则', '诸事不宜']]
            ],
            '乙未' => [
                '子' => ['yi' => ['祭祀', '祈福', '酬神', '出行', '求财', '见贵', '订婚', '嫁娶', '修造', '安葬', '青龙'], 'ji' => ['上梁', '盖屋', '入殓', '赴任', '词讼']],
                '丑' => ['yi' => ['无'], 'ji' => ['日时相冲', '诸事不宜']],
                '寅' => ['yi' => ['嫁娶', '移徙', '入宅', '开市', '交易', '修造', '安葬', '订婚'], 'ji' => ['祈福', '求嗣']],
                '卯' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '赴任'], 'ji' => ['无']],
                '辰' => ['yi' => ['无'], 'ji' => ['白虎须用', '麒麟符制', '否则', '诸事不宜', '修造', '动土']],
                '巳' => ['yi' => ['修造', '盖屋', '移徙', '安床', '入宅', '开市', '开仓', '见贵', '求财', '嫁娶'], 'ji' => ['赴任', '出行']],
                '午' => ['yi' => ['求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神']],
                '未' => ['yi' => ['见贵', '求财', '嫁娶', '进人口', '移徙', '安葬'], 'ji' => ['造船', '乘船', '赴任', '出行', '修造', '动土', '祭祀', '祈福', '斋醮', '开光']],
                '申' => ['yi' => ['求嗣', '出行', '求财', '嫁娶'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神', '开光', '修造', '安葬']],
                '酉' => ['yi' => ['无'], 'ji' => ['赴任', '出行', '修造']],
                '戌' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床'], 'ji' => ['上梁', '盖屋', '入殓', '赴任', '出行']],
                '亥' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '祭祀', '修造', '盖屋', '移徙', '作灶'], 'ji' => ['无']]
            ],
            '丙申' => [
                '子' => ['yi' => ['订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '赴任'], 'ji' => ['祈福', '求嗣']],
                '丑' => ['yi' => ['修造', '盖屋', '移徙', '作灶', '安床', '入宅', '开市', '祈福', '求嗣', '订婚', '嫁娶', '赴任', '见贵', '求财'], 'ji' => ['无']],
                '寅' => ['yi' => ['无'], 'ji' => ['日时相冲', '诸事不宜']],
                '卯' => ['yi' => ['赴任', '出行', '见贵', '求财', '嫁娶', '进人口', '移徙', '安葬', '祭祀', '祈福', '斋醮', '酬神'], 'ji' => ['朱雀须用', '凤凰符制', '否则', '诸事不宜']],
                '辰' => ['yi' => ['求嗣', '订婚', '嫁娶', '开市', '交易', '安床'], 'ji' => ['赴任', '出行', '求财', '祭祀', '祈福', '斋醮', '开光']],
                '巳' => ['yi' => ['求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床'], 'ji' => ['祭祀', '祈福', '斋醮', '开光', '赴任', '出行']],
                '午' => ['yi' => ['求嗣', '嫁娶', '移徙', '入宅', '开市', '交易', '修造', '安葬', '祈福'], 'ji' => ['白虎须用', '麒麟符制', '否则', '诸事不宜']],
                '未' => ['yi' => ['修造', '盖屋', '移徙', '安床', '入宅', '开市', '开仓', '求嗣', '订婚', '嫁娶'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神']],
                '申' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床'], 'ji' => ['造船', '乘船', '上梁', '盖屋', '入殓', '赴任', '修造', '移徙', '出行', '词讼']],
                '酉' => ['yi' => ['祭祀', '祈福', '酬神', '求财', '见贵', '订婚', '嫁娶', '安葬', '青龙'], 'ji' => ['赴任', '出行', '修造', '动土']],
                '戌' => ['yi' => ['作灶', '祭祀', '斋醮', '酬神', '修造'], 'ji' => ['祈福', '求嗣', '乘船']],
                '亥' => ['yi' => ['祈福', '求嗣', '求财', '嫁娶', '安葬'], 'ji' => ['赴任', '出行', '修造', '开光']]
            ],
            '丁酉' => [
                '子' => ['yi' => ['作灶', '祭祀', '祈福', '斋醮', '酬神'], 'ji' => ['修造', '动土']],
                '丑' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床', '祭祀'], 'ji' => ['赴任', '出行', '修造']],
                '寅' => ['yi' => ['订婚', '嫁娶', '安床', '移徙', '入宅', '修造', '安葬'], 'ji' => ['祭祀', '祈福', '斋醮', '开光', '赴任', '出行']],
                '卯' => ['yi' => ['无'], 'ji' => ['日时相冲', '诸事不宜']],
                '辰' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '祭祀'], 'ji' => ['赴任', '词讼']],
                '巳' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '开市', '交易', '安床'], 'ji' => ['朱雀须用', '凤凰符制', '否则', '诸事不宜', '赴任', '出行', '求财']],
                '午' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '赴任'], 'ji' => ['上梁', '盖屋', '入殓']],
                '未' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '修造', '入宅', '开市', '交易', '安葬', '祭祀'], 'ji' => ['无']],
                '申' => ['yi' => ['无'], 'ji' => ['祈福', '求嗣', '乘船', '祭祀', '白虎须用', '麒麟符制', '否则', '诸事不宜']],
                '酉' => ['yi' => ['祭祀', '祈福', '酬神', '订婚', '嫁娶', '出行', '求财', '入宅', '安葬', '求嗣'], 'ji' => ['造桥', '乘船']],
                '戌' => ['yi' => ['见贵', '求财', '嫁娶', '进人口', '安葬'], 'ji' => ['赴任', '修造', '移徙', '出行', '词讼']],
                '亥' => ['yi' => ['求财', '见贵', '祭祀', '祈福', '酬神'], 'ji' => ['赴任', '出行', '修造', '动土']]
            ],
            '戊戌' => [
                '子' => ['yi' => ['见贵', '求财', '嫁娶', '进人口', '安葬', '求嗣', '订婚'], 'ji' => ['赴任', '修造', '移徙', '出行', '词讼', '祭祀', '祈福', '斋醮', '开光']],
                '丑' => ['yi' => ['酬神', '求财', '见贵', '订婚', '嫁娶', '修造', '安葬', '青龙'], 'ji' => ['赴任', '出行', '祭祀', '祈福', '斋醮', '开光']],
                '寅' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床'], 'ji' => ['赴任', '出行']],
                '卯' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床', '入宅', '安葬'], 'ji' => ['赴任', '出行', '修造']],
                '辰' => ['yi' => ['无'], 'ji' => ['日时相冲', '诸事不宜']],
                '巳' => ['yi' => ['见贵', '订婚', '嫁娶', '入宅', '开市'], 'ji' => ['赴任', '出行', '求财', '开光', '修造', '安葬']],
                '午' => ['yi' => ['订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '赴任'], 'ji' => ['祈福', '求嗣']],
                '未' => ['yi' => ['祈福', '求嗣', '出行', '入宅', '嫁娶', '修造', '安葬', '赴任', '见贵', '求财'], 'ji' => ['朱雀须用', '凤凰符制', '否则', '诸事不宜']],
                '申' => ['yi' => ['祭祀', '祈福', '酬神', '订婚', '嫁娶', '出行', '求财', '入宅', '安葬', '赴任', '见贵'], 'ji' => ['修造', '动土']],
                '酉' => ['yi' => ['出行', '订婚', '嫁娶', '修造', '移徙', '开市', '安葬'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神']],
                '戌' => ['yi' => ['求嗣', '订婚', '嫁娶', '安葬'], 'ji' => ['造船', '乘船', '白虎须用', '麒麟符制', '否则', '诸事不宜', '祭祀', '祈福', '斋醮', '开光', '赴任', '出行']],
                '亥' => ['yi' => ['修造', '盖屋', '移徙', '安床', '入宅', '开市', '开仓', '见贵', '求财', '订婚', '嫁娶', '进人口'], 'ji' => ['祭祀', '祈福', '斋醮', '开光', '赴任', '出行']]
            ],
            '己亥' => [
                '子' => ['yi' => ['祭祀', '祈福', '酬神', '出行', '求财', '见贵', '订婚', '嫁娶', '修造', '安葬', '青龙', '赴任'], 'ji' => ['白虎须用', '麒麟符制', '否则', '诸事不宜']],
                '丑' => ['yi' => ['修造', '盖屋', '移徙', '安床', '入宅', '开市', '开仓', '见贵', '求财', '嫁娶', '进人口'], 'ji' => ['赴任', '出行']],
                '寅' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床'], 'ji' => ['上梁', '盖屋', '入殓']],
                '卯' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '修造', '入宅', '安葬', '赴任'], 'ji' => ['无']],
                '辰' => ['yi' => ['作灶', '祭祀', '斋醮', '酬神', '修造', '赴任', '见贵', '求财', '出行', '嫁娶', '进人口', '移徙', '安葬'], 'ji' => ['祈福', '求嗣', '乘船']],
                '巳' => ['yi' => ['无'], 'ji' => ['日时相冲', '诸事不宜']],
                '午' => ['yi' => ['祈福', '订婚', '嫁娶', '安床', '移徙', '入宅', '安葬', '赴任', '出行', '求财', '见贵'], 'ji' => ['修造', '动土']],
                '未' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '祭祀'], 'ji' => ['无']],
                '申' => ['yi' => ['求嗣', '出行', '求财', '嫁娶', '安葬'], 'ji' => ['赴任', '词讼', '祭祀', '祈福', '斋醮', '开光']],
                '酉' => ['yi' => ['求嗣', '嫁娶', '移徙', '入宅', '开市', '交易', '修造', '安葬'], 'ji' => ['朱雀须用', '凤凰符制', '否则', '诸事不宜', '祭祀', '祈福', '斋醮', '酬神']],
                '戌' => ['yi' => ['订婚', '嫁娶', '开市', '安葬'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神']],
                '亥' => ['yi' => ['祭祀', '祈福', '斋醮', '酬神', '修造', '作灶'], 'ji' => ['赴任', '出行', '造桥', '乘船']]
            ],
            '庚子' => [
                '子' => ['yi' => ['祈福', '订婚', '嫁娶', '开市', '安葬'], 'ji' => ['造船', '乘船', '上梁', '盖屋', '入殓', '赴任', '出行']],
                '丑' => ['yi' => ['祭祀', '祈福', '酬神', '出行', '求财', '见贵', '订婚', '嫁娶', '修造', '安葬', '青龙'], 'ji' => ['无']],
                '寅' => ['yi' => ['赴任', '见贵', '出行', '求财', '嫁娶', '进人口', '移徙', '安葬'], 'ji' => ['祈福', '求嗣', '白虎须用', '麒麟符制', '否则', '诸事不宜']],
                '卯' => ['yi' => ['修造', '盖屋', '移徙', '安床', '入宅', '开市', '开仓', '祈福', '求嗣', '订婚', '嫁娶', '赴任', '出行', '见贵'], 'ji' => ['无']],
                '辰' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床'], 'ji' => ['赴任', '修造', '移徙', '出行', '词讼']],
                '巳' => ['yi' => ['求嗣', '嫁娶', '移徙', '入宅', '开市', '交易', '安葬'], 'ji' => ['赴任', '出行', '修造', '动土']],
                '午' => ['yi' => ['无'], 'ji' => ['日时相冲', '诸事不宜']],
                '未' => ['yi' => ['酬神', '求财', '见贵', '订婚', '嫁娶', '修造', '安葬', '青龙'], 'ji' => ['赴任', '出行', '祭祀', '祈福', '斋醮', '开光']],
                '申' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '赴任', '入宅'], 'ji' => ['开光', '修造', '安葬']],
                '酉' => ['yi' => ['求嗣', '嫁娶', '移徙', '入宅', '开市', '交易', '修造', '安葬', '祈福', '赴任', '出行', '求财'], 'ji' => ['无']],
                '戌' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床', '见贵'], 'ji' => ['上梁', '盖屋', '入殓', '赴任', '出行']],
                '亥' => ['yi' => ['赴任', '见贵', '出行', '求财', '嫁娶', '进人口', '移徙', '安葬', '修造', '入宅'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神', '朱雀须用', '凤凰符制', '否则', '诸事不宜']]
            ],
            '辛丑' => [
                '子' => ['yi' => ['订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床'], 'ji' => ['祈福', '求嗣']],
                '丑' => ['yi' => ['修造', '安葬'], 'ji' => ['造船', '乘船', '朱雀须用', '凤凰符制', '否则', '诸事不宜']],
                '寅' => ['yi' => ['祈福', '求嗣', '出行', '求财', '嫁娶', '安葬'], 'ji' => ['修造', '动土']],
                '卯' => ['yi' => ['修造', '作灶'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神']],
                '辰' => ['yi' => ['见贵', '求财', '嫁娶', '进人口', '移徙', '安葬', '入宅', '修造'], 'ji' => ['白虎须用', '麒麟符制', '否则', '诸事不宜', '祭祀', '祈福', '斋醮', '开光', '赴任', '出行']],
                '巳' => ['yi' => ['求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床', '修造', '盖屋', '移徙'], 'ji' => ['祭祀', '祈福', '斋醮', '开光', '赴任', '出行']],
                '午' => ['yi' => ['祈福', '求嗣', '出行', '求财', '嫁娶', '安葬', '赴任'], 'ji' => ['无']],
                '未' => ['yi' => ['无'], 'ji' => ['日时相冲', '诸事不宜']],
                '申' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '作灶', '祭祀', '赴任', '见贵'], 'ji' => ['上梁', '盖屋', '入殓']],
                '酉' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '修造', '入宅', '安葬', '赴任'], 'ji' => ['无']],
                '戌' => ['yi' => ['订婚', '嫁娶', '安床', '移徙', '入宅', '修造', '安葬', '祭祀'], 'ji' => ['祈福', '求嗣', '乘船']],
                '亥' => ['yi' => ['盖屋', '移徙', '作灶', '安床', '入宅', '开市', '赴任', '出行', '见贵', '求财', '嫁娶'], 'ji' => ['开光', '修造', '安葬']]
            ],
            '壬寅' => [
                '子' => ['yi' => ['祈福', '订婚', '嫁娶', '安床', '移徙', '入宅', '安葬', '求嗣', '赴任', '出行', '求财'], 'ji' => ['修造', '动土']],
                '丑' => ['yi' => ['修造', '盖屋', '移徙', '作灶', '安床', '入宅', '开市', '求嗣', '订婚', '嫁娶'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神']],
                '寅' => ['yi' => ['无'], 'ji' => ['祭祀', '祈福', '斋醮', '开光', '赴任', '出行']],
                '卯' => ['yi' => ['酬神', '求财', '见贵', '订婚', '嫁娶', '修造', '安葬', '青龙'], 'ji' => ['朱雀须用', '凤凰符制', '否则', '诸事不宜', '祭祀', '祈福', '斋醮', '开光', '赴任', '出行']],
                '辰' => ['yi' => ['祈福', '订婚', '嫁娶', '开市', '安葬', '祭祀', '见贵'], 'ji' => ['赴任', '出行', '求财']],
                '巳' => ['yi' => ['出行', '求财', '见贵', '订婚', '嫁娶', '修造', '安葬', '青龙'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神']],
                '午' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床'], 'ji' => ['上梁', '盖屋', '入殓', '白虎须用', '麒麟符制', '否则', '诸事不宜']],
                '未' => ['yi' => ['修造', '入宅', '安葬', '赴任', '出行', '求财', '见贵', '嫁娶', '进人口', '移徙', '祭祀', '祈福', '求嗣', '斋醮'], 'ji' => ['无']],
                '申' => ['yi' => ['无'], 'ji' => ['日时相冲', '诸事不宜']],
                '酉' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '入宅', '求财', '开市', '交易', '安葬', '祭祀'], 'ji' => ['赴任', '出行', '修造', '动土']],
                '戌' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '作灶', '祭祀'], 'ji' => ['修造', '动土']],
                '亥' => ['yi' => ['祈福', '求嗣', '求财', '嫁娶', '安葬'], 'ji' => ['赴任', '出行', '修造']]
            ],
            '癸卯' => [
                '子' => ['yi' => ['求财', '见贵', '订婚', '嫁娶', '入宅', '开市', '安葬', '求嗣'], 'ji' => ['赴任', '出行', '祭祀', '祈福', '斋醮', '开光']],
                '丑' => ['yi' => ['求嗣', '订婚', '嫁娶', '安葬'], 'ji' => ['赴任', '出行', '修造', '祭祀', '祈福', '斋醮', '开光']],
                '寅' => ['yi' => ['订婚', '嫁娶', '安床', '移徙', '入宅', '修造', '安葬', '赴任', '见贵', '出行', '求财'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神']],
                '卯' => ['yi' => ['祈福', '求嗣', '出行', '求财', '嫁娶', '安葬', '修造', '盖屋', '移徙', '作灶', '安床', '入宅', '开市'], 'ji' => ['无']],
                '辰' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '祭祀'], 'ji' => ['上梁', '盖屋', '入殓', '赴任', '词讼']],
                '巳' => ['yi' => ['祭祀', '祈福', '酬神', '出行', '求财', '见贵', '订婚', '嫁娶', '青龙', '赴任'], 'ji' => ['开光', '修造', '安葬']],
                '午' => ['yi' => ['修造', '安葬', '订婚', '嫁娶', '开市'], 'ji' => ['祈福', '求嗣', '乘船']],
                '未' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床', '祭祀'], 'ji' => ['赴任', '出行']],
                '申' => ['yi' => ['赴任', '出行', '求财', '见贵', '嫁娶', '进人口', '移徙', '安葬'], 'ji' => ['修造', '动土', '白虎须用', '麒麟符制', '否则', '诸事不宜']],
                '酉' => ['yi' => ['无'], 'ji' => ['日时相冲', '诸事不宜']],
                '戌' => ['yi' => ['求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床'], 'ji' => ['赴任', '修造', '移徙', '出行', '词讼', '祭祀', '祈福', '斋醮', '开光']],
                '亥' => ['yi' => ['求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床', '见贵'], 'ji' => ['祭祀', '祈福', '斋醮', '开光', '赴任', '出行']]
            ],
            '甲辰' => [
                '子' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床'], 'ji' => ['赴任', '修造', '移徙', '出行', '词讼']],
                '丑' => ['yi' => ['祈福', '求嗣', '入宅', '嫁娶', '安葬'], 'ji' => ['赴任', '出行', '修造', '动土']],
                '寅' => ['yi' => ['祭祀', '祈福', '酬神', '订婚', '嫁娶', '出行', '求财', '入宅', '安葬', '赴任', '作灶'], 'ji' => ['上梁', '盖屋', '入殓']],
                '卯' => ['yi' => ['求嗣', '嫁娶', '移徙', '入宅', '开市', '交易', '安葬'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神', '赴任', '出行', '修造']],
                '辰' => ['yi' => ['订婚', '嫁娶', '安床', '移徙', '入宅', '修造', '安葬'], 'ji' => ['赴任', '出行', '祈福', '求嗣', '乘船']],
                '巳' => ['yi' => ['盖屋', '移徙', '作灶', '安床', '入宅', '开市', '祭祀', '祈福', '出行', '订婚', '嫁娶'], 'ji' => ['开光', '修造', '安葬']],
                '午' => ['yi' => ['求财', '嫁娶', '移徙', '开市', '安葬'], 'ji' => ['赴任', '出行', '修造', '动土']],
                '未' => ['yi' => ['祈福', '求嗣', '出行', '入宅', '嫁娶', '修造', '安葬', '赴任', '见贵', '求财'], 'ji' => ['朱雀须用', '凤凰符制', '否则', '诸事不宜']],
                '申' => ['yi' => ['求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神']],
                '酉' => ['yi' => ['求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床'], 'ji' => ['祭祀', '祈福', '斋醮', '开光', '赴任', '出行']],
                '戌' => ['yi' => ['无'], 'ji' => ['日时相冲', '诸事不宜']],
                '亥' => ['yi' => ['求嗣', '嫁娶', '移徙', '入宅', '开市', '交易', '修造', '安葬'], 'ji' => ['无']]
            ],
            '乙巳' => [
                '子' => ['yi' => ['祈福', '求嗣', '出行', '求财', '嫁娶', '安葬'], 'ji' => ['上梁', '盖屋', '入殓']],
                '丑' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '修造', '入宅', '安葬', '赴任', '见贵'], 'ji' => ['无']],
                '寅' => ['yi' => ['订婚', '嫁娶', '入宅', '安葬'], 'ji' => ['赴任', '修造', '移徙', '出行', '词讼', '祈福', '求嗣', '乘船']],
                '卯' => ['yi' => ['求财', '见贵', '订婚', '嫁娶', '入宅', '开市', '安葬', '祈福', '求嗣'], 'ji' => ['赴任', '出行', '修造', '动土']],
                '辰' => ['yi' => ['作灶', '赴任', '见贵', '求财', '出行', '嫁娶', '进人口', '移徙', '安葬'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神', '修造', '动土']],
                '巳' => ['yi' => ['祈福', '嫁娶', '修造', '盖屋', '造庙', '作灶', '入宅', '安葬', '见贵', '求财'], 'ji' => ['赴任', '出行', '造船', '乘船']],
                '午' => ['yi' => ['订婚', '嫁娶', '安床', '移徙', '入宅', '修造', '安葬', '求嗣'], 'ji' => ['祭祀', '祈福', '斋醮', '开光', '赴任', '出行']],
                '未' => ['yi' => ['修造', '盖屋', '移徙', '作灶', '安床', '入宅', '开市', '求嗣', '订婚', '嫁娶'], 'ji' => ['祭祀', '祈福', '斋醮', '开光', '赴任', '出行']],
                '申' => ['yi' => ['求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神', '开光', '修造', '安葬']],
                '酉' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床'], 'ji' => ['朱雀须用', '凤凰符制', '否则', '诸事不宜']],
                '戌' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '赴任'], 'ji' => ['上梁', '盖屋', '入殓']],
                '亥' => ['yi' => ['无'], 'ji' => ['日时相冲', '诸事不宜']]
            ],
            '丙午' => [
                '子' => ['yi' => ['无'], 'ji' => ['日时相冲', '诸事不宜']],
                '丑' => ['yi' => ['祭祀', '祈福', '斋醮', '酬神', '修造', '作灶'], 'ji' => ['无']],
                '寅' => ['yi' => ['求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神', '修造', '动土']],
                '卯' => ['yi' => ['修造', '盖屋', '移徙', '安床', '入宅', '开市', '开仓', '祈福', '求嗣', '订婚', '嫁娶', '赴任', '出行', '见贵'], 'ji' => ['无']],
                '辰' => ['yi' => ['求嗣', '订婚', '嫁娶', '安葬', '入宅', '修造'], 'ji' => ['赴任', '出行', '祭祀', '祈福', '斋醮', '开光']],
                '巳' => ['yi' => ['赴任', '出行', '求财', '见贵', '订婚', '嫁娶', '入宅', '开市', '安葬'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神']],
                '午' => ['yi' => ['求嗣', '嫁娶', '移徙', '入宅', '开市', '交易', '修造', '安葬', '祈福', '作灶', '祭祀'], 'ji' => ['造桥', '乘船']],
                '未' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床'], 'ji' => ['赴任', '出行', '修造']],
                '申' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '赴任'], 'ji' => ['上梁', '盖屋', '入殓']],
                '酉' => ['yi' => ['祭祀', '祈福', '酬神', '出行', '求财', '见贵', '订婚', '嫁娶', '修造', '安葬', '青龙', '赴任'], 'ji' => ['无']],
                '戌' => ['yi' => ['订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '赴任', '见贵'], 'ji' => ['祈福', '求嗣', '乘船']],
                '亥' => ['yi' => ['祈福', '求嗣', '出行', '求财', '嫁娶', '赴任', '见贵'], 'ji' => ['开光', '修造', '安葬']]
            ],
            '丁未' => [
                '子' => ['yi' => ['无'], 'ji' => ['赴任', '词讼', '修造', '动土']],
                '丑' => ['yi' => ['无'], 'ji' => ['日时相冲', '诸事不宜']],
                '寅' => ['yi' => ['无'], 'ji' => ['祭祀', '祈福', '斋醮', '开光', '赴任', '出行']],
                '卯' => ['yi' => ['求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床'], 'ji' => ['祭祀', '祈福', '斋醮', '开光', '赴任', '出行']],
                '辰' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '修造', '入宅', '开市', '交易', '安葬'], 'ji' => ['赴任', '出行', '白虎须用', '麒麟符制', '否则', '诸事不宜']],
                '巳' => ['yi' => ['修造', '盖屋', '移徙', '安床', '入宅', '开市', '开仓', '求嗣', '嫁娶', '赴任', '出行', '见贵', '求财'], 'ji' => ['无']],
                '午' => ['yi' => ['求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '赴任'], 'ji' => ['上梁', '盖屋', '入殓', '祭祀', '祈福', '斋醮', '酬神']],
                '未' => ['yi' => ['见贵', '求财', '嫁娶', '进人口', '移徙', '安葬'], 'ji' => ['赴任', '出行', '修造', '动土']],
                '申' => ['yi' => ['赴任', '见贵', '出行', '求财', '嫁娶', '进人口', '移徙', '安葬', '订婚', '作灶', '祭祀'], 'ji' => ['祈福', '求嗣']],
                '酉' => ['yi' => ['祭祀', '祈福', '酬神', '出行', '求财', '见贵', '订婚', '嫁娶', '修造', '安葬', '青龙', '求嗣'], 'ji' => ['无']],
                '戌' => ['yi' => ['祈福', '订婚', '嫁娶', '安床', '移徙', '入宅', '安葬'], 'ji' => ['赴任', '出行', '修造', '动土']],
                '亥' => ['yi' => ['赴任', '出行', '求财', '见贵', '祭祀', '祈福', '酬神', '修造', '盖屋', '移徙', '作灶', '安床', '入宅', '开市'], 'ji' => ['无']]
            ],
            '戊申' => [
                '子' => ['yi' => ['订婚', '嫁娶', '安床', '移徙', '入宅', '修造', '安葬', '见贵', '求财'], 'ji' => ['祭祀', '祈福', '斋醮', '开光', '赴任', '出行']],
                '丑' => ['yi' => ['修造', '盖屋', '移徙', '作灶', '安床', '入宅', '开市', '酬神', '求财', '见贵', '订婚', '嫁娶'], 'ji' => ['祭祀', '祈福', '斋醮', '开光', '赴任', '出行']],
                '寅' => ['yi' => ['无'], 'ji' => ['日时相冲', '诸事不宜']],
                '卯' => ['yi' => ['入宅', '修造', '安葬', '祈福', '求嗣', '订婚', '嫁娶', '赴任', '出行', '求财'], 'ji' => ['朱雀须用', '凤凰符制', '否则', '诸事不宜']],
                '辰' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床'], 'ji' => ['上梁', '盖屋', '入殓']],
                '巳' => ['yi' => ['祈福', '斋醮', '订婚', '嫁娶', '移徙', '开市'], 'ji' => ['赴任', '出行', '开光', '修造', '安葬']],
                '午' => ['yi' => ['修造', '安葬', '嫁娶', '移徙', '入宅', '开市', '交易'], 'ji' => ['祈福', '求嗣', '白虎须用', '麒麟符制', '否则', '诸事不宜']],
                '未' => ['yi' => ['求嗣', '出行', '求财', '嫁娶', '安葬', '修造', '盖屋', '移徙', '安床', '入宅', '开市', '开仓'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神']],
                '申' => ['yi' => ['祭祀', '祈福', '酬神', '订婚', '嫁娶', '求财', '入宅', '安葬'], 'ji' => ['赴任', '修造', '移徙', '出行', '词讼']],
                '酉' => ['yi' => ['无'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神', '赴任', '出行', '修造', '动土']],
                '戌' => ['yi' => ['作灶', '酬神', '修造'], 'ji' => ['祭祀', '祈福', '斋醮', '开光', '赴任', '出行']],
                '亥' => ['yi' => ['嫁娶', '修造', '造庙', '作灶', '入宅', '安葬'], 'ji' => ['赴任', '出行', '祭祀', '祈福', '斋醮', '开光']]
            ],
            '己酉' => [
                '子' => ['yi' => ['祭祀', '祈福', '出行', '订婚', '嫁娶', '入宅', '修造', '盖屋', '安葬', '作灶'], 'ji' => ['无']],
                '丑' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床', '祭祀'], 'ji' => ['赴任', '出行']],
                '寅' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '赴任', '见贵'], 'ji' => ['修造', '动土']],
                '卯' => ['yi' => ['无'], 'ji' => ['日时相冲', '诸事不宜']],
                '辰' => ['yi' => ['订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床'], 'ji' => ['赴任', '词讼', '祈福', '求嗣', '乘船']],
                '巳' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床'], 'ji' => ['朱雀须用', '凤凰符制', '否则', '诸事不宜', '开光', '修造', '安葬']],
                '午' => ['yi' => ['祈福', '订婚', '嫁娶', '开市', '安葬', '赴任', '出行', '求财', '见贵'], 'ji' => ['修造', '动土']],
                '未' => ['yi' => ['祭祀', '祈福', '酬神', '订婚', '嫁娶', '出行', '求财', '入宅', '安葬'], 'ji' => ['无']],
                '申' => ['yi' => ['出行', '求财', '见贵', '订婚', '嫁娶', '修造', '安葬', '青龙'], 'ji' => ['白虎须用', '麒麟符制', '否则', '诸事不宜', '祭祀', '祈福', '斋醮', '酬神']],
                '酉' => ['yi' => ['求嗣', '嫁娶', '移徙', '入宅', '开市', '交易', '修造', '安葬'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神']],
                '戌' => ['yi' => ['见贵', '求财', '嫁娶', '进人口', '移徙', '安葬'], 'ji' => ['赴任', '出行']],
                '亥' => ['yi' => ['见贵', '求财', '嫁娶', '进人口', '移徙', '安葬'], 'ji' => ['赴任', '出行']]
            ],
            '庚戌' => [
                '子' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床'], 'ji' => ['赴任', '修造', '移徙', '出行', '词讼', '上梁', '盖屋', '入殓']],
                '丑' => ['yi' => ['祭祀', '祈福', '酬神', '求财', '见贵', '订婚', '嫁娶', '安葬', '青龙'], 'ji' => ['赴任', '出行', '修造', '动土']],
                '寅' => ['yi' => ['订婚', '嫁娶', '开市', '交易', '安床', '作灶', '祭祀'], 'ji' => ['祈福', '求嗣', '赴任', '出行', '求财']],
                '卯' => ['yi' => ['求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神', '赴任', '出行', '修造']],
                '辰' => ['yi' => ['无'], 'ji' => ['日时相冲', '诸事不宜']],
                '巳' => ['yi' => ['求嗣', '嫁娶', '移徙', '入宅', '开市', '交易', '修造', '安葬', '祭祀', '祈福', '斋醮', '酬神'], 'ji' => ['无']],
                '午' => ['yi' => ['求财', '见贵', '酬神'], 'ji' => ['祭祀', '祈福', '斋醮', '开光', '赴任', '出行']],
                '未' => ['yi' => ['酬神', '求财', '见贵', '订婚', '嫁娶', '修造', '安葬', '青龙'], 'ji' => ['赴任', '出行', '朱雀须用', '凤凰符制', '否则', '诸事不宜', '祭祀', '祈福', '斋醮', '开光']],
                '申' => ['yi' => ['祈福', '订婚', '嫁娶', '开市', '赴任', '出行', '求财', '见贵'], 'ji' => ['开光', '修造', '安葬']],
                '酉' => ['yi' => ['修造', '作灶', '求嗣', '嫁娶', '移徙', '入宅', '开市', '交易'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神']],
                '戌' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '祭祀'], 'ji' => ['上梁', '盖屋', '入殓', '白虎须用', '麒麟符制', '否则', '诸事不宜']],
                '亥' => ['yi' => ['修造', '入宅', '安葬', '赴任', '出行', '见贵', '求财', '订婚', '嫁娶', '进人口', '移徙'], 'ji' => ['无']]
            ],
            '辛亥' => [
                '子' => ['yi' => ['嫁娶', '移徙', '入宅', '开市', '交易', '修造', '安葬', '赴任', '出行', '求财'], 'ji' => ['祈福', '求嗣', '白虎须用', '麒麟符制', '否则', '诸事不宜']],
                '丑' => ['yi' => ['修造', '盖屋', '移徙', '安床', '入宅', '开市', '开仓', '赴任', '见贵', '求财', '出行', '嫁娶', '进人口'], 'ji' => ['无']],
                '寅' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床', '祭祀'], 'ji' => ['赴任', '修造', '移徙', '出行', '词讼']],
                '卯' => ['yi' => ['求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神', '赴任', '出行', '修造', '动土']],
                '辰' => ['yi' => ['作灶', '酬神', '修造', '见贵', '求财', '嫁娶', '进人口', '移徙', '安葬'], 'ji' => ['祭祀', '祈福', '斋醮', '开光', '赴任', '出行']],
                '巳' => ['yi' => ['无'], 'ji' => ['日时相冲', '诸事不宜']],
                '午' => ['yi' => ['赴任', '出行', '求财', '见贵', '祭祀', '祈福', '酬神'], 'ji' => ['无']],
                '未' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '祭祀', '修造', '盖屋', '移徙', '作灶'], 'ji' => ['无']],
                '申' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床'], 'ji' => ['上梁', '盖屋', '入殓', '赴任', '词讼']],
                '酉' => ['yi' => ['求财', '见贵', '订婚', '嫁娶', '入宅', '开市', '安葬', '修造'], 'ji' => ['赴任', '出行', '朱雀须用', '凤凰符制', '否则', '诸事不宜']],
                '戌' => ['yi' => ['订婚', '嫁娶', '开市', '安葬'], 'ji' => ['乘船', '祈福', '求嗣', '祭祀']],
                '亥' => ['yi' => ['祭祀', '祈福', '斋醮', '酬神', '作灶'], 'ji' => ['造桥', '乘船', '开光', '修造', '安葬']]
            ],
            '壬子' => [
                '子' => ['yi' => ['求嗣', '嫁娶', '移徙', '入宅', '开市', '交易', '安葬', '祈福', '订婚'], 'ji' => ['造船', '乘船', '修造', '动土']],
                '丑' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '祭祀'], 'ji' => ['无']],
                '寅' => ['yi' => ['无'], 'ji' => ['白虎须用', '麒麟符制', '否则', '诸事不宜', '祭祀', '祈福', '斋醮', '开光', '赴任', '出行']],
                '卯' => ['yi' => ['求嗣', '求财', '嫁娶', '安葬', '修造', '盖屋', '移徙', '安床', '入宅', '开市', '开仓'], 'ji' => ['祭祀', '祈福', '斋醮', '开光', '赴任', '出行']],
                '辰' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床', '祭祀'], 'ji' => ['赴任', '修造', '移徙', '出行', '词讼']],
                '巳' => ['yi' => ['求嗣', '求财', '嫁娶', '安葬'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神', '赴任', '出行', '修造', '动土']],
                '午' => ['yi' => ['无'], 'ji' => ['日时相冲', '诸事不宜']],
                '未' => ['yi' => ['修造', '入宅', '安葬', '求财', '见贵', '嫁娶', '进人口', '移徙'], 'ji' => ['赴任', '出行']],
                '申' => ['yi' => ['订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床'], 'ji' => ['祈福', '求嗣']],
                '酉' => ['yi' => ['修造', '盖屋', '移徙', '作灶', '安床', '入宅', '开市', '祈福', '求嗣', '订婚', '嫁娶', '赴任', '出行', '求财'], 'ji' => ['无']],
                '戌' => ['yi' => ['见贵', '求财', '出行', '嫁娶', '进人口', '移徙', '安葬'], 'ji' => ['修造', '动土', '赴任', '词讼']],
                '亥' => ['yi' => ['赴任', '出行', '求财', '见贵', '订婚', '嫁娶', '入宅', '开市', '安葬'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神', '朱雀须用', '凤凰符制', '否则', '诸事不宜']]
            ],
            '癸丑' => [
                '子' => ['yi' => ['赴任', '出行', '求财', '见贵', '订婚', '嫁娶', '入宅', '开市', '安葬', '求嗣'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神']],
                '丑' => ['yi' => ['无'], 'ji' => ['朱雀须用', '凤凰符制', '否则', '诸事不宜', '祭祀', '祈福', '斋醮', '开光', '赴任', '出行']],
                '寅' => ['yi' => ['订婚', '嫁娶', '开市', '安葬'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神']],
                '卯' => ['yi' => ['祭祀', '祈福', '酬神', '订婚', '嫁娶', '出行', '求财', '入宅', '安葬', '求嗣'], 'ji' => ['无']],
                '辰' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床'], 'ji' => ['上梁', '盖屋', '入殓', '白虎须用', '麒麟符制', '否则', '诸事不宜']],
                '巳' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '祭祀', '盖屋', '移徙'], 'ji' => ['开光', '修造', '安葬']],
                '午' => ['yi' => ['求财', '嫁娶', '开市', '安葬', '订婚'], 'ji' => ['赴任', '修造', '移徙', '出行', '词讼', '祈福', '求嗣']],
                '未' => ['yi' => ['无'], 'ji' => ['日时相冲', '诸事不宜']],
                '申' => ['yi' => ['作灶', '祭祀', '祈福', '斋醮', '酬神', '赴任', '出行', '求财', '见贵', '嫁娶', '进人口', '移徙', '安葬'], 'ji' => ['修造', '动土']],
                '酉' => ['yi' => ['祭祀', '祈福', '订婚', '嫁娶', '入宅', '盖屋', '安葬'], 'ji' => ['赴任', '出行', '修造']],
                '戌' => ['yi' => ['订婚', '嫁娶', '安床', '移徙', '入宅', '修造', '安葬'], 'ji' => ['赴任', '出行', '祭祀', '祈福', '斋醮', '开光']],
                '亥' => ['yi' => ['修造', '盖屋', '移徙', '作灶', '安床', '入宅', '开市', '见贵', '求财', '嫁娶'], 'ji' => ['祭祀', '祈福', '斋醮', '开光', '赴任', '出行']]
            ],
            '甲寅' => [
                '子' => ['yi' => ['祈福', '订婚', '嫁娶', '安床', '移徙', '入宅', '修造', '安葬'], 'ji' => ['赴任', '出行', '求财']],
                '丑' => ['yi' => ['修造', '盖屋', '移徙', '作灶', '安床', '入宅', '开市', '出行', '求财', '见贵', '订婚', '嫁娶', '赴任'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神']],
                '寅' => ['yi' => ['祭祀', '祈福', '酬神', '订婚', '嫁娶', '出行', '求财', '入宅', '安葬', '赴任'], 'ji' => ['上梁', '盖屋', '入殓']],
                '卯' => ['yi' => ['求嗣', '嫁娶', '移徙', '入宅', '开市', '交易', '修造', '安葬', '赴任', '出行', '求财'], 'ji' => ['朱雀须用', '凤凰符制', '否则', '诸事不宜']],
                '辰' => ['yi' => ['订婚', '嫁娶', '开市', '安葬', '赴任', '见贵', '求财', '出行'], 'ji' => ['祈福', '求嗣', '乘船']],
                '巳' => ['yi' => ['祈福', '斋醮', '订婚', '嫁娶', '移徙', '开市', '见贵'], 'ji' => ['赴任', '出行', '开光', '修造', '安葬']],
                '午' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床'], 'ji' => ['白虎须用', '麒麟符制', '否则', '诸事不宜', '赴任', '出行', '修造', '动土']],
                '未' => ['yi' => ['祈福', '求嗣', '出行', '求财', '嫁娶', '安葬', '修造', '盖屋', '移徙', '安床', '入宅', '开市', '开仓', '祭祀'], 'ji' => ['无']],
                '申' => ['yi' => ['无'], 'ji' => ['日时相冲', '诸事不宜']],
                '酉' => ['yi' => ['求财', '见贵', '酬神'], 'ji' => ['赴任', '出行', '修造', '动土', '祭祀', '祈福', '斋醮', '开光']],
                '戌' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '作灶', '祭祀', '赴任'], 'ji' => ['无']],
                '亥' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床'], 'ji' => ['赴任', '出行', '修造']]
            ],
            '乙卯' => [
                '子' => ['yi' => ['作灶', '祭祀', '祈福', '斋醮', '酬神', '修造'], 'ji' => ['上梁', '盖屋', '入殓', '赴任', '出行']],
                '丑' => ['yi' => ['祭祀', '祈福', '酬神', '订婚', '嫁娶', '求财', '入宅', '安葬'], 'ji' => ['赴任', '出行', '修造']],
                '寅' => ['yi' => ['订婚', '嫁娶', '安床', '移徙', '入宅', '修造', '安葬'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神', '乘船']],
                '卯' => ['yi' => ['赴任', '出行', '求财', '见贵', '订婚', '嫁娶', '入宅', '开市', '安葬', '祈福', '求嗣', '修造', '盖屋', '移徙'], 'ji' => ['无']],
                '辰' => ['yi' => ['祭祀', '祈福', '求嗣', '斋醮', '订婚', '嫁娶', '安葬'], 'ji' => ['赴任', '出行', '修造', '动土']],
                '巳' => ['yi' => ['祈福', '嫁娶', '修造', '盖屋', '造庙', '作灶', '入宅', '安葬', '见贵', '求财'], 'ji' => ['赴任', '出行', '朱雀须用', '凤凰符制', '否则', '诸事不宜']],
                '午' => ['yi' => ['求嗣', '嫁娶', '移徙', '入宅', '开市', '交易', '修造', '安葬', '订婚'], 'ji' => ['祭祀', '祈福', '斋醮', '开光', '赴任', '出行']],
                '未' => ['yi' => ['求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床'], 'ji' => ['祭祀', '祈福', '斋醮', '开光', '赴任', '出行']],
                '申' => ['yi' => ['出行', '求财', '见贵', '订婚', '嫁娶', '青龙'], 'ji' => ['白虎须用', '麒麟符制', '否则', '诸事不宜', '祭祀', '祈福', '斋醮', '酬神', '开光', '修造', '安葬']],
                '酉' => ['yi' => ['无'], 'ji' => ['日时相冲', '诸事不宜']],
                '戌' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床'], 'ji' => ['上梁', '盖屋', '入殓', '赴任', '修造', '移徙', '出行', '词讼']],
                '亥' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床', '入宅', '安葬', '祭祀'], 'ji' => ['赴任', '出行', '修造', '动土']]
            ],
            '丙辰' => [
                '子' => ['yi' => ['订婚', '嫁娶', '求财', '开市', '交易', '安床', '祭祀'], 'ji' => ['赴任', '修造', '移徙', '出行', '词讼', '祈福', '求嗣']],
                '丑' => ['yi' => ['安葬', '求财', '见贵', '嫁娶', '进人口', '移徙'], 'ji' => ['赴任', '出行', '修造', '动土']],
                '寅' => ['yi' => ['求嗣', '嫁娶', '移徙', '入宅', '开市', '交易', '安葬', '作灶', '祭祀', '祈福', '斋醮', '酬神', '赴任', '出行'], 'ji' => ['修造', '动土']],
                '卯' => ['yi' => ['无'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神', '赴任', '出行']],
                '辰' => ['yi' => ['订婚', '嫁娶', '安床', '移徙', '入宅', '修造', '安葬'], 'ji' => ['造桥', '乘船', '赴任', '出行', '祭祀', '祈福', '斋醮', '开光']],
                '巳' => ['yi' => ['修造', '盖屋', '移徙', '作灶', '安床', '入宅', '开市', '求财', '见贵', '订婚', '嫁娶'], 'ji' => ['祭祀', '祈福', '斋醮', '开光', '赴任', '出行']],
                '午' => ['yi' => ['求嗣', '嫁娶', '移徙', '入宅', '开市', '交易', '修造', '安葬', '祈福', '出行', '求财'], 'ji' => ['赴任', '词讼']],
                '未' => ['yi' => ['赴任', '见贵', '求财', '出行', '嫁娶', '进人口', '移徙', '安葬'], 'ji' => ['修造', '动土', '朱雀须用', '凤凰符制', '否则', '诸事不宜']],
                '申' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床'], 'ji' => ['上梁', '盖屋', '入殓']],
                '酉' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '祭祀', '修造', '入宅', '安葬'], 'ji' => ['无']],
                '戌' => ['yi' => ['无'], 'ji' => ['日时相冲', '诸事不宜']],
                '亥' => ['yi' => ['盖屋', '移徙', '安床', '入宅', '开市', '开仓', '祭祀', '祈福', '酬神', '出行', '求财', '见贵', '订婚', '嫁娶'], 'ji' => ['开光', '修造', '安葬']]
            ],
            '丁巳' => [
                '子' => ['yi' => ['嫁娶', '移徙', '开市', '安葬'], 'ji' => ['白虎须用', '麒麟符制', '否则', '诸事不宜', '赴任', '出行', '求财', '修造', '动土']],
                '丑' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '开市', '交易', '安床', '修造', '盖屋', '移徙'], 'ji' => ['赴任', '出行', '求财']],
                '寅' => ['yi' => ['求嗣', '订婚', '嫁娶', '修造', '入宅', '开市', '交易', '安葬'], 'ji' => ['祭祀', '祈福', '斋醮', '开光', '赴任', '出行']],
                '卯' => ['yi' => ['求嗣', '订婚', '嫁娶', '修造', '入宅', '开市', '交易', '安葬'], 'ji' => ['赴任', '出行', '祭祀', '祈福', '斋醮', '开光']],
                '辰' => ['yi' => ['作灶', '修造'], 'ji' => ['赴任', '出行', '祭祀', '祈福', '斋醮', '酬神']],
                '巳' => ['yi' => ['赴任', '见贵', '出行', '求财', '嫁娶', '进人口', '移徙', '安葬', '求嗣'], 'ji' => ['造船', '乘船', '祭祀', '祈福', '斋醮', '酬神']],
                '午' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '赴任'], 'ji' => ['上梁', '盖屋', '入殓']],
                '未' => ['yi' => ['修造', '入宅', '安葬', '祭祀', '祈福', '求嗣', '斋醮', '订婚', '嫁娶', '出行'], 'ji' => ['无']],
                '申' => ['yi' => ['订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床'], 'ji' => ['赴任', '词讼', '祈福', '求嗣', '乘船']],
                '酉' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '祭祀'], 'ji' => ['无']],
                '戌' => ['yi' => ['祈福', '斋醮', '出行', '订婚', '嫁娶', '修造', '移徙', '开市', '安葬', '祭祀'], 'ji' => ['无']],
                '亥' => ['yi' => ['无'], 'ji' => ['日时相冲', '诸事不宜']]
            ],
            '戊午' => [
                '子' => ['yi' => ['无'], 'ji' => ['日时相冲', '诸事不宜']],
                '丑' => ['yi' => ['酬神', '求财', '见贵', '订婚', '嫁娶', '修造', '安葬', '青龙'], 'ji' => ['赴任', '出行', '祭祀', '祈福', '斋醮', '开光']],
                '寅' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床'], 'ji' => ['赴任', '出行', '白虎须用', '麒麟符制', '否则', '诸事不宜']],
                '卯' => ['yi' => ['赴任', '出行', '求财', '见贵', '祭祀', '祈福', '酬神', '修造', '盖屋', '移徙', '安床', '入宅', '开市', '开仓'], 'ji' => ['无']],
                '辰' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床', '祭祀'], 'ji' => ['上梁', '盖屋', '入殓', '赴任', '修造', '移徙', '出行', '词讼']],
                '巳' => ['yi' => ['订婚', '嫁娶', '移徙', '开市', '入宅'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神', '开光', '修造', '安葬']],
                '午' => ['yi' => ['作灶', '祭祀', '斋醮', '酬神', '修造', '嫁娶', '移徙', '入宅', '开市', '交易'], 'ji' => ['祈福', '求嗣', '造桥', '乘船']],
                '未' => ['yi' => ['祈福', '求嗣', '求财', '嫁娶', '安葬'], 'ji' => ['赴任', '出行', '修造']],
                '申' => ['yi' => ['祭祀', '祈福', '酬神', '订婚', '嫁娶', '出行', '求财', '入宅', '安葬', '赴任'], 'ji' => ['修造', '动土']],
                '酉' => ['yi' => ['修造', '盖屋', '移徙', '作灶', '安床', '入宅', '开市', '求嗣', '订婚', '嫁娶', '赴任', '出行', '求财'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神']],
                '戌' => ['yi' => ['订婚', '嫁娶', '入宅', '修造', '安葬', '见贵', '求财'], 'ji' => ['祭祀', '祈福', '斋醮', '开光', '赴任', '出行']],
                '亥' => ['yi' => ['嫁娶', '修造', '造庙', '作灶', '入宅', '安葬', '见贵', '求财'], 'ji' => ['朱雀须用', '凤凰符制', '否则', '诸事不宜', '祭祀', '祈福', '斋醮', '开光', '赴任', '出行']]
            ],
            '己未' => [
                '子' => ['yi' => ['祈福', '求嗣', '出行', '求财', '嫁娶', '安葬'], 'ji' => ['赴任', '词讼']],
                '丑' => ['yi' => ['无'], 'ji' => ['日时相冲', '诸事不宜']],
                '寅' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '赴任'], 'ji' => ['上梁', '盖屋', '入殓']],
                '卯' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '修造', '入宅', '安葬', '祭祀'], 'ji' => ['无']],
                '辰' => ['yi' => ['订婚', '嫁娶', '修造', '入宅', '开市', '交易', '安葬'], 'ji' => ['祈福', '求嗣', '白虎须用', '麒麟符制', '否则', '诸事不宜']],
                '巳' => ['yi' => ['求嗣', '嫁娶', '移徙', '入宅', '开市', '交易', '赴任', '出行', '见贵', '求财'], 'ji' => ['开光', '修造', '安葬']],
                '午' => ['yi' => ['求嗣', '出行', '求财', '嫁娶', '安葬'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神', '修造', '动土']],
                '未' => ['yi' => ['祭祀', '祈福', '酬神', '订婚', '嫁娶', '求财', '入宅', '安葬', '见贵'], 'ji' => ['造船', '乘船', '赴任', '出行', '修造', '动土']],
                '申' => ['yi' => ['作灶', '酬神', '修造', '见贵', '求财', '嫁娶', '进人口', '移徙', '安葬'], 'ji' => ['祭祀', '祈福', '斋醮', '开光', '赴任', '出行']],
                '酉' => ['yi' => ['求嗣', '嫁娶', '移徙', '入宅', '开市', '交易', '安葬'], 'ji' => ['赴任', '出行', '修造', '祭祀', '祈福', '斋醮', '酬神']],
                '戌' => ['yi' => ['祈福', '订婚', '嫁娶', '安床', '移徙', '入宅', '修造', '安葬', '祭祀'], 'ji' => ['赴任', '出行']],
                '亥' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床', '修造', '盖屋', '移徙', '作灶'], 'ji' => ['赴任', '出行']]
            ],
            '庚申' => [
                '子' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床'], 'ji' => ['上梁', '盖屋', '入殓', '赴任', '出行']],
                '丑' => ['yi' => ['祭祀', '祈福', '酬神', '见贵', '订婚', '嫁娶', '修造', '安葬', '青龙'], 'ji' => ['赴任', '出行', '求财']],
                '寅' => ['yi' => ['无'], 'ji' => ['日时相冲', '诸事不宜']],
                '卯' => ['yi' => ['求嗣', '订婚', '嫁娶', '修造', '入宅', '开市', '交易', '安葬'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神', '朱雀须用', '凤凰符制', '否则', '诸事不宜']],
                '辰' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床', '赴任'], 'ji' => ['修造', '动土']],
                '巳' => ['yi' => ['祭祀', '祈福', '斋醮', '酬神', '修造', '作灶', '求嗣', '嫁娶', '移徙', '入宅', '开市', '交易'], 'ji' => ['赴任', '出行']],
                '午' => ['yi' => ['求财', '见贵', '酬神'], 'ji' => ['白虎须用', '麒麟符制', '否则', '诸事不宜', '祭祀', '祈福', '斋醮', '开光', '赴任', '出行']],
                '未' => ['yi' => ['修造', '盖屋', '移徙', '安床', '入宅', '开市', '开仓', '出行', '求财', '见贵', '订婚', '嫁娶'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神']],
                '申' => ['yi' => ['求财', '见贵', '订婚', '嫁娶', '入宅', '开市', '安葬'], 'ji' => ['赴任', '修造', '移徙', '出行', '词讼', '开光']],
                '酉' => ['yi' => ['求嗣', '嫁娶', '移徙', '入宅', '开市', '交易', '安葬', '祈福', '祭祀'], 'ji' => ['赴任', '出行', '修造', '动土']],
                '戌' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床', '作灶', '祭祀'], 'ji' => ['上梁', '盖屋', '入殓', '赴任', '出行']],
                '亥' => ['yi' => ['修造', '入宅', '安葬'], 'ji' => ['赴任', '出行']]
            ],
            '辛酉' => [
                '子' => ['yi' => ['嫁娶', '移徙', '入宅', '开市', '交易', '修造', '安葬', '作灶', '祭祀', '斋醮', '酬神'], 'ji' => ['祈福', '求嗣', '赴任', '出行', '求财']],
                '丑' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床', '祭祀'], 'ji' => ['赴任', '出行', '修造']],
                '寅' => ['yi' => ['祈福', '订婚', '嫁娶', '安床', '移徙', '入宅', '修造', '安葬', '祭祀', '赴任', '见贵', '出行', '求财'], 'ji' => ['无']],
                '卯' => ['yi' => ['无'], 'ji' => ['日时相冲', '诸事不宜']],
                '辰' => ['yi' => ['求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床'], 'ji' => ['赴任', '词讼', '祭祀', '祈福', '斋醮', '开光']],
                '巳' => ['yi' => ['求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床'], 'ji' => ['祭祀', '祈福', '斋醮', '开光', '赴任', '出行']],
                '午' => ['yi' => ['祭祀', '祈福', '酬神', '出行', '求财', '见贵', '订婚', '嫁娶', '修造', '安葬', '青龙'], 'ji' => ['无']],
                '未' => ['yi' => ['祭祀', '祈福', '斋醮', '酬神', '修造', '作灶'], 'ji' => ['无']],
                '申' => ['yi' => ['求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床'], 'ji' => ['白虎须用', '麒麟符制', '否则', '诸事不宜', '上梁', '盖屋', '入殓', '祭祀', '祈福', '斋醮', '酬神']],
                '酉' => ['yi' => ['祈福', '求嗣', '出行', '求财', '嫁娶', '安葬', '修造', '入宅'], 'ji' => ['造桥', '乘船']],
                '戌' => ['yi' => ['见贵', '求财', '嫁娶', '进人口', '移徙', '安葬'], 'ji' => ['赴任', '出行', '祈福', '求嗣']],
                '亥' => ['yi' => ['见贵', '求财', '嫁娶', '入宅', '移徙', '安葬'], 'ji' => ['赴任', '出行', '修造', '动土', '开光']]
            ],
            '壬戌' => [
                '子' => ['yi' => ['求嗣', '嫁娶', '移徙', '入宅', '开市', '交易', '安葬'], 'ji' => ['赴任', '出行', '求财', '修造', '动土']],
                '丑' => ['yi' => ['祈福', '嫁娶', '修造', '造庙', '作灶', '入宅', '安葬'], 'ji' => ['赴任', '出行', '求财']],
                '寅' => ['yi' => ['求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神']],
                '卯' => ['yi' => ['求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床'], 'ji' => ['赴任', '出行', '修造', '祭祀', '祈福', '斋醮', '开光']],
                '辰' => ['yi' => ['无'], 'ji' => ['日时相冲', '诸事不宜']],
                '巳' => ['yi' => ['出行', '求财', '见贵', '订婚', '嫁娶', '修造', '安葬', '青龙'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神']],
                '午' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '出行', '求财', '开市', '交易', '安床'], 'ji' => ['上梁', '盖屋', '入殓', '赴任', '词讼']],
                '未' => ['yi' => ['见贵', '求财', '嫁娶', '进人口', '移徙', '安葬'], 'ji' => ['赴任', '出行', '朱雀须用', '凤凰符制', '否则', '诸事不宜']],
                '申' => ['yi' => ['订婚', '嫁娶', '开市', '安葬', '见贵', '求财'], 'ji' => ['祈福', '求嗣', '赴任', '出行']],
                '酉' => ['yi' => ['修造', '作灶'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神']],
                '戌' => ['yi' => ['祭祀', '祈福', '求嗣', '斋醮', '订婚', '嫁娶', '出行', '安葬'], 'ji' => ['造船', '乘船', '白虎须用', '麒麟符制', '否则', '诸事不宜']],
                '亥' => ['yi' => ['修造', '盖屋', '移徙', '安床', '入宅', '开市', '开仓', '赴任', '出行', '求财', '见贵', '订婚', '嫁娶'], 'ji' => ['无']]
            ],
            '癸亥' => [
                '子' => ['yi' => ['求财', '见贵', '订婚', '嫁娶', '入宅', '开市', '安葬', '求嗣'], 'ji' => ['白虎须用', '麒麟符制', '否则', '诸事不宜', '祭祀', '祈福', '斋醮', '开光', '赴任', '出行']],
                '丑' => ['yi' => ['修造', '盖屋', '移徙', '安床', '入宅', '开市', '开仓', '见贵', '订婚', '嫁娶', '进人口'], 'ji' => ['赴任', '出行', '求财', '祭祀', '祈福', '斋醮', '开光']],
                '寅' => ['yi' => ['求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床'], 'ji' => ['赴任', '修造', '移徙', '出行', '词讼', '祭祀', '祈福', '斋醮', '酬神']],
                '卯' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床', '祭祀'], 'ji' => ['赴任', '出行', '修造', '动土']],
                '辰' => ['yi' => ['作灶', '祭祀', '祈福', '斋醮', '酬神', '修造'], 'ji' => ['上梁', '盖屋', '入殓']],
                '巳' => ['yi' => ['无'], 'ji' => ['日时相冲', '诸事不宜']],
                '午' => ['yi' => ['订婚', '嫁娶', '安床', '移徙', '入宅', '修造', '安葬'], 'ji' => ['祈福', '求嗣', '乘船']],
                '未' => ['yi' => ['祈福', '求嗣', '订婚', '嫁娶', '求财', '开市', '交易', '安床', '修造', '盖屋', '移徙', '作灶', '祭祀'], 'ji' => ['赴任', '出行']],
                '申' => ['yi' => ['求财', '见贵', '嫁娶', '进人口', '移徙', '安葬'], 'ji' => ['赴任', '出行', '修造', '动土']],
                '酉' => ['yi' => ['赴任', '出行', '见贵', '求财', '嫁娶', '入宅', '移徙', '安葬'], 'ji' => ['朱雀须用', '凤凰符制', '否则', '诸事不宜']],
                '戌' => ['yi' => ['订婚', '嫁娶', '开市', '安葬'], 'ji' => ['祭祀', '祈福', '斋醮', '酬神']],
                '亥' => ['yi' => ['求嗣', '嫁娶', '移徙', '入宅', '开市', '交易', '修造', '安葬', '订婚'], 'ji' => ['造桥', '乘船', '祭祀', '祈福', '斋醮', '开光', '赴任', '出行']]
            ],
        ];
        $hourList = [
            "子" => "23:00-00:59", "丑" => "01:00-02:59", "寅" => "03:00-04:59", "卯" => "05:00-06:59",
            "辰" => "07:00-08:59", "巳" => "09:00-10:59", "午" => "11:00-12:59", "未" => "13:00-14:59",
            "申" => "15:00-16:59", "酉" => "17:00-18:59", "戌" => "19:00-20:59", "亥" => "21:00-22:59"
        ];
        $strJi = isset($list[join('', $jiNianDay)]) ? $list[join('', $jiNianDay)] : $list['甲子'];
        foreach ($hourList as $k => $v) {
            $tmp = [
                'h' => self::getGanzhiHour($jiNianDayT, $k),
                'hour' => $v,
            ];
            $hourgz = join('', $tmp['h']);
            //时宜忌
            $shiYiJi = isset($list2[$dgz][$k]) ? $list2[$dgz][$k] : $list2['甲子'][$k];
            $tmp['zheng_chong'] = self::getZhengChong(join('', $tmp['h']));
            $tmp['sha'] = self::getSanSha($k)[0];
            $tmp['position'] = self::getPositionbyTg($tmp['h'][0]);
            $tmp['sheng'] = self::getBaMenbyGz($hourgz)['生'];
            $tmp['jix'] = '吉';
            if (false === strpos($strJi, $k)) {
                $tmp['jix'] = '凶';
            }
            $tmp['shiyi'] = isset($shiYiJi['yi']) ? $shiYiJi['yi'] : [];
            $tmp['shiji'] = isset($shiYiJi['ji']) ? $shiYiJi['ji'] : [];
            foreach ($this->dzChong as $v1) {
                if (in_array($k, $v1)) {
                    if ($v1[0] == $k) {
                        $tmp['sx_chong'] = $this->dzTosx[$v1[1]];
                    } else {
                        $tmp['sx_chong'] = $this->dzTosx[$v1[0]];
                    }
                    break;
                }
            }
            $res[] = $tmp;
        }
        return $res;
    }

    /**
     * 根据日支获得胎神
     */
    public function getTaiShen()
    {
        $list = [
            '甲子' => ['占门碓外东南', '孕妇房门和盛米处之外的东南方位'],
            '乙丑' => ['占碓磨厕外东南', '盛米处石磨处和厕所之外的东南方位'],
            '丙寅' => ['占厨堂炉外正南', '厨房和炉灶之外的正南方位'],
            '丁卯' => ['占仓库门外正南', '仓库和孕妇房门之外的正南方位'],
            '戊辰' => ['占房床栖外正南', '孕妇卧室和家禽宠物栖息处之外的正南方位'],
            '己巳' => ['占门床外正南', '孕妇房门和睡床之外的正南方位'],
            '庚午' => ['占碓磨外正南', '盛米处和石磨处之外的正南方位'],
            '辛未' => ['占厨厕炉外西南', '厨房和厕所之外的西南方位'],
            '壬申' => ['占仓库炉外西南', '仓库和炉灶之外的西南方位'],
            '癸酉' => ['占房床门外西南', '孕妇卧室之外的西南方位'],
            '甲午' => ['占门碓房内北', '孕妇房门和盛米处房内的北面'],
            '乙未' => ['占碓磨厕房内北', '盛米处石磨处和厕所之内的北面'],
            '丙申' => ['占厨灶炉房内北', '厨房和炉灶所在房间之内的北面'],
            '丁酉' => ['占仓库门房内北', '仓库和孕妇房门之外的北面'],
            '戊戌' => ['占房床栖房内南', '孕妇卧室和家禽宠物栖息处所在房间之内的南面'],
            '己亥' => ['占门床房内南', '孕妇卧室之内的南面'],
            '庚子' => ['占碓磨房内南', '盛米处和石磨所在房间之内的南面'],
            '辛丑' => ['占厨灶厕房内南', '厨房和厕所之内的南面'],
            '壬寅' => ['占仓库炉房内南', '仓库和厨房之内的南面'],
            '癸卯' => ['占房床门房内南', '孕妇卧室之内的南面'],
            '甲戌' => ['占门鸡栖外西南', '孕妇房门和家禽宠物栖息之处的西南方位'],
            '乙亥' => ['占碓磨床外西南', '盛米处石磨处和孕妇睡床之外的西南方位'],
            '丙子' => ['占厨灶碓外西南', '厨房和盛米处所在房间之外的西南方位'],
            '丁丑' => ['占仓库厕外西南', '仓库和厕所之外的西南方位'],
            '戊寅' => ['占房床炉外正南', '孕妇房间和炉灶之外的正南方位'],
            '己卯' => ['占大门外正南', '楼房大门之外的正南方位'],
            '庚辰' => ['占碓磨栖外正西', '盛米处石磨处和家禽宠物栖息处之外的正西方位'],
            '辛巳' => ['占厨灶床外正西', '厨房和孕妇睡床之外的正西方位'],
            '壬午' => ['占仓库碓外西北', '仓库和盛米处之外的西北方位'],
            '癸未' => ['占房床厕外西北', '孕妇卧室和厕所之外的西北方位'],
            '甲辰' => ['占门鸡栖房内东', '孕妇房门和家禽宠物栖息之处的西南方位'],
            '乙巳' => ['占碓磨床房内东', '盛米处石磨处和孕妇卧室之内的东面'],
            '丙午' => ['占厨灶碓内东', '厨房和盛米处所在房间之内的东面'],
            '丁未' => ['占仓库厕内东', '仓库和厕所之内的东面'],
            '戊申' => ['占房床炉内东', '孕妇卧室和厨房之内的东面'],
            '己酉' => ['占大门外东北', '楼房大门之外的正南方位'],
            '庚戌' => ['占碓磨栖外东北', '盛米处石磨处和家禽宠物栖息处之外的东北方位'],
            '辛亥' => ['占厨灶床外东北', '厨房和孕妇睡床之外的东北方位'],
            '壬子' => ['占仓库碓外东北', '仓库和盛米处之外的东北方位'],
            '癸丑' => ['占房床厕外东北', '孕妇卧室和厕所之外的东北方位'],
            '甲申' => ['占门炉外西北', '孕妇房门和炉灶之外的西北方位'],
            '乙酉' => ['占碓磨门外西北', '盛米处石磨处和孕妇房门之外的西北方位'],
            '丙戌' => ['占厨灶栖外西北', '厨房和家禽宠物栖息处之外的正东方位'],
            '丁亥' => ['占仓库床外西北', '仓库和睡床之外的西北方位'],
            '戊子' => ['占房床碓外正北', '孕妇卧室和盛米所在房间之外的正北方位'],
            '己丑' => ['占门厕外正北', '孕妇房门和厕所之外的正北方位'],
            '庚寅' => ['占碓磨炉外正北', '盛米处石磨处和炉灶之外的正北方位'],
            '辛卯' => ['占厨灶门外正北', '厨房和孕妇房门之外的正北方位'],
            '壬辰' => ['占仓库栖外正北', '仓库和家禽宠物栖息处之外的正北方位'],
            '癸巳' => ['占房床内北', '孕妇卧室之内的北面'],
            '甲寅' => ['占门炉外东北', '孕妇房门和炉灶之外的东北方位'],
            '乙卯' => ['占碓磨门外正东', '盛米处石磨处和孕妇房门之外的正东方位'],
            '丙辰' => ['占厨灶栖外正东', '厨房和家禽宠物栖息处之外的正东方位'],
            '丁巳' => ['占仓库床外正东', '仓库和睡床之外的正东方位'],
            '戊午' => ['占房床碓外正东', '孕妇卧室和盛米所在房间之外的正东方位'],
            '己未' => ['占门厕外正东', '孕妇房门和厕所之外的正东方位'],
            '庚申' => ['占碓磨炉外东南', '盛米处石磨处和炉灶之外的东南方位'],
            '辛酉' => ['占厨灶门外东南', '厨房和孕妇房门之外的东南方位'],
            '壬戌' => ['占仓库栖外东南', '仓库和家禽宠物栖息处之外的东南方位'],
            '癸亥' => ['占房床外东南', '孕妇房间和睡床之外的东南面'],

        ];
        $rgz = join('', $this->getLunarGanzhiDay());
        $res = ['', ''];
        if (isset($list[$rgz])) {
            $res = $list[$rgz];
            $res[1] = "本日胎神在" . $res[1] . "，在这些方位不可随意敲打、动剪刀或移动物件，以免对孕妇和胎儿不利。";
        }
        return $res;
    }

    /**
     * 获取当天节日数据
     * @return array
     */
    public function getJieRi()
    {
        $time = $this->dateTime->getTimestamp();
        $year = (int)$this->dateTime->format('Y');
        //节气列表
        $jieQiList = self::getAllJieQi($year);
        //节日列表
        $jieRiList = self::getJieRiListByYear($year);
        //节气
        $str = [];
        foreach ($jieQiList as $k => $v) {
            if (date('Y-m-d', strtotime($v)) == $this->dateTime->format('Y-m-d')) {
                $str[] = $k;
                break;
            }
        }
        if (isset($jieRiList['jie'][$time])) {
            $str[] = array_merge($str, $jieRiList['jie'][$time]);
        }
        if (isset($jieRiList['fo'][$time])) {
            $str[] = $jieRiList['fo'][$time];
        }
        return $str;
    }

    //**************解释部分*************

    /**
     * 黄历现代文
     */
    public function getDetail()
    {
        $jiNianYear = $this->getLunarGanzhiYear();
        $jiNianDay = $this->getLunarGanzhiDay();
        $sanSha = self::getSanSha($jiNianDay[1]);
        //今日合害
        $getTodayHeHai = $this->getTodayHeHai();
        //28星宿
        $xingSu = $this->getXingSu();
        $xingSuList = [
            "虚日鼠" => "虚宿造作则有灾殃，男女相克无法成双。家庭不和睦，而且儿孙媳妇都不守节操，甚至乱了伦理。假如开门放水更有灾祸，损人口，有伤亡，疾病接二连叁，直至家破人亡。",
            "危月燕" => "危宿造作则有刑吊及血光之灾，叁年内孩子会遭水厄，损人口，年青出外不归家。若行埋葬则更悲伤，周年或百日年长的有灾厄，要是开门放水，则会上官堂 (打官司) 。",
            "室火猪" => "室宿修造则大吉利，富贵荣华，而且财源广进，长寿。开门放水则可招财进宝，行婚礼则可生贵子。要是行埋葬则子孙兴旺、福禄无穷。",
            "壁水獝" => "璧宿造作可招进财、财源广进，事业有成。开打放水则後代贤能，埋葬则可招财，并且有利於仕途，家庭生活幸福美满。如果行婚礼则大吉利，早生贵子而有名声。",
            "奎木狼" => "奎宿造作算得了祯祥，可使家内繁荣而和睦。但是不可用来埋葬，否则一年内必有伤亡，而且有官事及怪病发生。要是开门放水则有灾祸，对儿子不利。",
            "娄金狗" => "娄宿造作则可使家业兴旺，财源广进，兄弟和睦有名望。行婚礼则早生贵子，要是开门放水则身体健康而长寿，经济很好。",
            "胃土雉" => "胃宿造作则荣华富贵，喜气洋洋。行埋葬则有利於仕途，夫妇可白首偕老。行婚礼则可使家内富贵，儿孙代代有名望。",
            "昴日鸡" => "昴宿造作可使家业兴盛。但埋葬则常有官灾，且会继续死人，更会变卖田产。开门放水则会招灾祸，孩童会得怪病，行婚礼则更悲哀，会有死别生离。",
            "毕月乌" => "毕宿造作则财源广进，行埋葬则有利於仕途，事业兴旺，开门放水，则合家欢乐，行婚礼则早生贵子而福寿双全。",
            "觜火猴" => "觜宿造作则有刑害，会变成伶仃。假若行埋葬则容易有暴死的现象，多数应於寅年，灾祸不断，直至使田地退散而破家。",
            "参水猿" => "参宿造作可旺人家，文星高照，并对田产有利，但是行埋葬则大凶。开门放水则有利於仕途，与田产及子孙兴旺。但是行婚礼则大凶，会遭刑克，感情无法和睦。",
            "井木犴" => "井宿造作则财源广进，可金榜题名。埋葬则不利，容易得怪病而命归黄泉。开门放水可招财进宝，贵人重重，儿孙兴旺。",
            "鬼金羊" => "鬼宿造作则大凶，有伤人口。埋葬用此日则可加冠进禄，对儿孙的仕途有利，但是开门放水则有伤人口，要是行婚礼夫修土建墙也大凶。",
            "柳土獐" => "柳宿造作则有官事，无日安宁，埋葬则多疾病，并且田产退败。开门放水则会产生耳聋及瞎眼的毛病，甚至弯背，严重的话甚至遭刑打，妇人不守妇道。",
            "星日马" => "星宿造作则有利於仕途。但不可埋葬与放水，否则大凶，会遭生离死别之祸。",
            "张月鹿" => "张宿造作则财源广进，埋葬则有利於仕途。开门放水则可招财进宝，行婚礼则夫妻恩爱和合福绵绵，事事如意，安然自得。",
            "翼火蛇" => "翼宿修造则容易得怪病，要是行埋葬则子孙远走他乡。行婚礼则不利，妇女不守妇道。开门放水则家破，少女会淫奔。",
            "轸水蚓" => "轸宿造作则有利於仕途，荣华富贵，增福寿，财源广进。行埋葬则宅舍安宁。",
            "角木蛟" => "角宿造作则可荣昌，可置田产及早办喜事。如果用角星来办嫁娶则可出贵子，读书人的功名可一帆风顺。但是不可用角星行埋葬，否则叁年之後有瘟疫。如果用角星起工修建坟墓或地基，则主人不利。",
            "亢金龙" => "亢宿造作则长房在十日之中有灾殃，祖田不保且会失去官职，及会受小人所伤。如果用亢星行嫁娶，则儿孙新妇要守空房。如果用亢星行埋葬则有灾祸、重伤。",
            "氐土貉" => "氐宿造作会有灾殃，田园财产一时空。用氐星进行埋葬，则有人会悬吊自缢、灾祸接二连叁。用氐星行婚礼则会离别、妇人不贞，航行又不利，更会生产聋哑的子孙，而闹得家庭更穷。",
            "房日兔" => "房宿造作则财源滚滚来，享受荣华富贵、有福禄，并且身体健康。用房星行埋葬则仕途平稳，嫁娶用此，日婚姻美满，叁年得贵子。",
            "心月狐" => "心宿造作则大凶，有囚狱之灾，忤逆长辈、惹官非，损失宅产。埋葬则大凶，用於婚姻则伤子，凶事接二连叁，令人寝食难安。",
            "尾火虎" => "尾宿造作可荣华富贵、福禄、财源滚滚而来。行婚姻则大吉利、子孙有利，有贵气。用尾星行埋葬则子孙兴旺，地理方面的开门放水则财源滚滚而来，并且有名望。",
            "箕水豹" => "箕宿造作可年年大吉昌，埋葬修坟也大吉利，风水方面的开门放水，则可升官，使财源滚滚而来，六亲丰足，生活过得快乐平安且身体健康，仕途平稳。",
            "斗木獬" => "斗宿造作可招财、有利於仕途，家业欣欣向荣。修辑坟地可招富贵，开门放水则有进财，可使家庭和睦，有福而无灾。",
            "牛金牛" => "牛宿造作有灾厄，天灾横祸不能免，家庭不安而且伤人口，事业不利。如果行婚姻则不利，钱财渐退，假若开门放水则不利六畜。",
            "女土蝠" => "女宿造作则不利妇女，恐会损人口。兄弟互相猜忌，感情不和睦，好比水火不能相容。如果行埋葬则容易招鬼怪，有怪病发生，作事易惹事生非而失财。要是开门放水，则家庭破散，离乡别井。",
        ];
        array_push($xingSu, $xingSuList[$xingSu[0]]);
        //建除12神解释
        $jianChu = $this->getJianChu();
        //执神
        $zhiShen = $this->getZhiRi();
        $shenShaList = [
            "玄武" => "四象之一，其形为龟，或龟蛇合体，位于北方，属水，色黑。此处代表欺诈、不实。该时辰容易被骗、易买到假货等。",
            "天牢" => "指设置在京由朝廷直接掌管的牢狱，也指北斗中的贯索星。泛指易入难出的地方。该时辰容易落入陷阱、圈套等困局的事。",
            "司命" => "文昌宫的第四星，掌控生命的神，亦指关系生命的者。引申为负重大责任，发号司令的人，该时辰宜晋升、见贵、看病等。",
            "勾陈" => "为紫微恒中星座名，古代传说五帝中即有勾陈大帝统御万雷。因形弯曲如钩，引申为曲折、缓慢。该时辰容易发生阻滞不前之事。",
            "青龙" => "四象之一。其形象龙，位于东方，属木，色青，总称青龙。此处代表贵人，也即能帮助你的人，该时辰各类事情都较合适，特别利于向他人求助。",
            "明堂" => "古代帝王宣明政教的地方。凡朝会、祭祀、庆赏、选士、养老、教学等大典，都在此举行。引申为公开活动的地方。该时辰宜开会、集会等公开活动。",
            "天刑" => "指上天的法则，天降的刑罚，也特指古代的宫刑。引申为意外之灾。该时辰容易发生意外、带来身体伤害，或东西发生的破损等。",
            "朱雀" => "四象之一，其形象鸟，位于南方，属火，色赤，总称朱雀。此处代表口舌，争吵。该时辰容易发生争吵、意见较难统一，或东西容易引起噪音。",
            "金匮" => "亦称“金柜”，铜制的柜，古时用以收藏文献或文物。引申为久远、博学，富贵。该时辰宜物品收藏、文书合同签订、订婚、购物等。",
            "天德" => "指天之福德，即自然界养育万特的生机之所。天德所在的方位和时间适宜兴举各种事务。该时辰各类事情都较合适，特另适合结婚典礼。",
            "白虎" => "四象之一，其形象虎，位于西方，属金，色白，总称白虎。此处代表凶杀，血光。该时辰容易发生车祸等较严重的意外，购物则容易破损。",
            "玉堂" => "玉饰的殿堂，亦为宫殿的美称，宋以后的翰林院亦称为玉堂。引申为豪华、高档住宅、贵人居所。该时辰宜见贵、装修、观光旅游等。"
        ];
        $zhiShen['shen_sha_detail'] = isset($shenShaList[$zhiShen['shen_sha']]) ? $shenShaList[$zhiShen['shen_sha']] : '';
        $list = [
            "建" => "万物生育、强健、健壮的日子。",
            "除" => "扫除恶煞、去旧迎新的日子。",
            "满" => "丰收、美满、天帝宝库积满的日子。",
            "平" => "平常、官人集合平分的日子。",
            "定" => "安定、平常、天帝众客定座的日子。",
            "执" => "执日之从神，曰小耗，天帝执行万物赐天福，较差的日子。",
            "破" => "日月相冲，曰大耗，斗柄相冲相向必破坏的日子，大事不宜。",
            "危" => "危机、危险，诸事不宜的日子。",
            "闭" => "十二建中最后一日，关闭、收藏、天地阴阳闭寒的日子。",
            "成" => "成功、天帝纪万物成就的大吉日子，凡事皆顺。",
            "收" => "收成、收获，天帝宝库收纳的日子。",
            "开" => "开始、开展的日子。"
        ];
        $res = [
            'jian_chu' => [$jianChu, isset($list[$jianChu]) ? $list[$jianChu] : ''],
            'chong_sha' => [
                'chong' => $getTodayHeHai['xian_chong'], 'sha' => str_replace('煞', '', $sanSha['0']),
            ],
            'na_yin' => self::getDetailNaYin(join('', $jiNianDay)),
            'tai_shen' => $this->getTaiShen(),
            'peng_zu' => [$this->getPengZuBaiJi(), $this->getDetailPengZuBaiJi()],
            'xing_su' => $xingSu,
            'zhi_shen' => $zhiShen,
            'lucky' => ['shengxiao' => '', 'ganzhi' => '', 'info' => '生肖六合是一种暗合，指的是暗中帮助你的贵人。'],
            'jishen' => [],
            'xiong' => [],
            'yi' => [],
            'ji' => [],
        ];
        //幸运生肖
        if (isset($getTodayHeHai['liu_he'])) {
            $res['lucky'] = [
                'shengxiao' => $getTodayHeHai['liu_he'],
                'ganzhi' => array_search($getTodayHeHai['liu_he'], $this->dzTosx),
            ];
        }

        $jixiongList = $this->getJiXiong();
        //吉凶宜忌

        foreach ($jixiongList as $k => $v) {
            foreach ($v as $v1) {
                $res[$k][$v1] = self::getDetailJiXiong($v1);
            }
        }

        return $res;
    }

    /**
     * 吉凶宜忌解释
     * @param $value 吉凶神
     * @return mixed|string
     */
    public static function getDetailJiXiong($value)
    {
        $list = [
            "不将" => "宜嫁娶、订婚、招赘、纳婿吉利。",
            "福德" => "福德之神，宜祈福、嫁娶、入宅、修造、安葬吉。",
            "福生" => "宜祈福、设斋醮、入宅、求财，百事皆吉。",
            "吉期" => "宜上官、兴造、入宅、百事皆吉。",
            "金匮" => "宜修宅、造宅、订婚、嫁娶、求嗣、入宅、开市吉。",
            "金堂" => "宜修宅、造宅、移徒、入宅，百事吉利。",
            "六合" => "宜祈福、嫁娶、订婚、开市、入宅、造葬吉。",
            "明堂" => "宜上官、安床、安灶、修宅、造宅、入宅吉。",
            "鸣吠" => "宜破土、啟攒、成服、除服、安葬、傍附、葬吉。",
            "鸣吠对" => "宜破土、啟攒、成服、除服、修坟、安葬吉。",
            "母仓" => "宜订婚、嫁娶、牧养、纳畜、起造、修造仓库、纳财大吉显。",
            "普护" => "宜祈福、斋醮、出行、移徒、嫁娶、百事皆吉。",
            "青龙" => "宜祈福、嫁娶、订婚、造宅、造葬，百事皆吉。",
            "三合" => "宜祈福、嫁娶、订婚、入宅、开市、造葬吉。",
            "生气" => "宜安床、移徒、医病、求嗣、嫁娶、订婚皆吉。",
            "圣心" => "宜祭祀、祀神、斋醮、祈福、功果、嫁娶大吉。",
            "时德" => "宜祭祀、上官、订婚、纳采、嫁娶、造、修宅、上梁吉。",
            "司命" => "宜起造、修作、修灶、造灶、祀灶、受封吉利。",
            "四相" => "宜祭祀、上官、订婚、纳采、嫁娶、造、修宅、上梁吉。",
            "天仓" => "宜订婚、嫁娶、牧养、纳畜、起造、修造仓库、纳财大吉显。",
            "天德" => "福德之神，宜祈福、嫁娶、入宅、修造、安葬吉。",
            "天德合" => "宜兴造、修宅、入宅、安葬、祈福、嫁娶、订婚、六礼吉。",
            "天恩" => "宜祈福、斋醮、上官、移徒、订婚、嫁娶、造葬，百事皆吉。",
            "天后" => "宜求医、疗病、针灸、服药吉利。",
            "天马" => "宜出行、移居、入宅、开市、求财、营商吉。",
            "天赦" => "宜祭祀、祈福、求嗣、斋醮、嫁娶、订婚、兴修、造葬吉。",
            "天喜" => "宜祈福、订婚、嫁娶、入宅、开市、造宅吉。",
            "天医" => "宜求医、疗病、针灸、服药吉利。",
            "天愿" => "宜祭祀、祈福、求嗣、斋醮、嫁娶、订婚、兴修、修坟、造葬吉。",
            "五富" => "宜开市、修宅、造宅、入宅、造灶、安葬吉。",
            "五合" => "宜祈福、斋醮、开光、嫁娶、开市、造船吉。",
            "续世" => "宜祭祀、祈福、求嗣、订婚、嫁娶、修作、造葬，百事皆吉。",
            "阳德" => "宜嫁娶、订婚、开市、入宅、造葬吉。",
            "要安" => "宜嫁娶、订婚、求财、修方、造葬、百事皆吉。",
            "驿马" => "宜上官、赴任、出行、经商、求财、开市吉。",
            "益后" => "宜祭祀、祈福、求嗣、订婚、嫁娶、修作、造葬，百事皆吉。",
            "阴德" => "宜祭祀、设斋醮、施恩、行惠、功果吉。",
            "玉堂" => "宜修宅、造宅、安床、开仓、作灶、入宅吉。",
            "玉宇" => "宜修宅、造宅、移徒、入宅，百事吉利。",
            "月德" => "福德之神，宜祈福、嫁娶、入宅、造宅、订婚、修造、安葬吉。",
            "月德合" => "宜兴造、修宅、入宅、安葬、安葬、祈福、嫁娶、订婚、六礼吉。",
            "月恩" => "宜祈福、斋醮、上官、移徒、订婚、嫁娶、造葬，百事皆吉。",
            "月空" => "宜上表、斋醮、修造、动土吉。",
            "官日" => "适合新官上任、拜访官员。",
            "宝光" => "宜祈福、搬家",
            "除神" => "适合打扫卫生、理发、沐浴。",
            "敬安" => "恭顺之神当值，宜召开有关家族、企业组织等相关会议、拜访长辈、推荐朋友、求职、上任等。",
            "临日" => "宜祭祀、上册、上表章，入学、出行、上官、上任。",
            "六仪" => "六仪，为小节，一为祀祭之容，二为宾客之容，三为朝廷之容，四为丧纪之容，五为军旅之容，六为车马之容。适合各类仪式。",
            "民日" => "月神中吉神的一种，能增强普通老百姓的运势。",
            "时阳" => "时辰的阳神。",
            "时阴" => "指，秋冬之时，这里指时辰的阴神。",
            "守日" => "宜上任。",
            "天巫" => "象征地位的提升。",
            "王日" => "适合新官上任、拜访官员。",
            "相日" => "五行之旺衰，得令则为旺为相，不得令则相反，四相日为四季干支所生，宜修造、起基、动土、迁徙、出行均可取用。",
            "解神" => "月中善神。主消灾解难，能解危扶困，遇难成祥。",
            "白虎" => "忌嫁娶、移徒、入宅、安香。以麒麟符、凤凰符制化。",
            "大耗" => "忌祈福、设斋醮、嫁娶、订婚、安床、竖造、修置產室、纳财、开市、纳畜、牧养、修方、安葬、百事皆凶。",
            "地火" => "忌栽种月属火、作窑、修窑凶。",
            "地囊" => "忌动土、破土、修宅、修坟、修造仓库、修筑隄防、修置產室、开渠井、安堆磨磑、修饰垣墙、栽种凶。",
            "复日" => "忌安葬、修坟、破土、啟攒、入殮、移柩、成除服、开生坟、合寿木、修齐凶勿用。",
            "归忌" => "忌移徒、入宅、出火、嫁娶、远迴归寧凶。",
            "河魁" => "忌起造，安门。",
            "九坎" => "忌开、求财、出行、铸鎔、造车、造器、栽种凶。",
            "死气" => "忌赴举、修置產室、偃武、医病、断乳、栽种凶。",
            "四废" => "百事皆忌，惟入殮、移柩、安葬不忌。",
            "四耗" => "忌开市、交易、纳财、出行、造仓库凶。",
            "四穷" => "忌订婚、开市、交易、纳财、立券凶。",
            "天罡" => "及河魁钓纹全自縊俗忌嫁娶、祭祀，其餘不忌。",
            "天火" => "忌修造、盖屋、合脊、上梁、安门、安灶、入宅、出火凶。",
            "土符" => "忌动土、破、修造、修坟、修仓库、修筑隄防、修饰垣墙、栽种、安堆磨磑。",
            "土府" => "忌动土、破、修造、修坟、修仓库、修筑隄防、修饰垣墙、栽种、安堆磨磑。",
            "往亡" => "忌上官赴任、上册表章、出行、进人口、偃武习艺、嫁娶、订婚、入宅、出火、医病皆凶。",
            "五离" => "忌嫁娶、订婚、安床、会亲友凶。",
            "咸池" => "忌淫乱、嫁娶、和合、口舌是非、家宅不宁。",
            "小耗" => "忌开市、交易、纳财、立券、造仓库凶。",
            "血支" => "只忌针灸、穿耳孔。",
            "阳错" => "大忌上官、赴任、安床凶。",
            "阴错" => "大忌上官、赴任、安床凶。",
            "游祸" => "忌祈福、祭祀、建醮、医病、服药凶。",
            "月破" => "忌祈福、设斋醮、嫁娶、订婚、安床、竖造、修置產室、纳财、开市、纳畜、牧养、修方、安葬、百事皆凶。",
            "月煞" => "忌安葬、经络逢三德制化吉。",
            "朱雀" => "初一忌嫁娶，初九忌上梁，十七日忌安葬、开池塘凶。",
            "勾陈" => "容易发生停滞不前的事，忌起造、安葬，犯此绝嗣。",
            "劫煞" => "别名年夜耗，忌求财、嫁娶、订婚、纳采。",
            "九焦" => "忌种植、破土、修造之事。",
            "九空" => "忌种植、出行、求财、开仓。",
            "死神" => "忌绘塑、动土。",
            "四击" => "忌上官、远行、出行、嫁娶、进人口、迁徙。",
            "四忌" => "忌安葬、纳采、嫁娶、进人口。",
            "天牢" => "指设置在京由朝廷直接掌管的牢狱，也指北方的贯索星。易入难出之地，犯之容易落入陷阱、圈套等困局。",
            "天吏" => "凶日、百事忌。",
            "天刑" => "指天降惩罚，犯之易有意外之灾、身体伤害、东西发生破损。",
            "天贼" => "忌动土、竖造、入宅、开仓、埋葬、主招灾祸。",
            "三阴" => "三阴由月破、月厌推导而来，一岁中共有两日。",
            "五虚" => "忌闻张、闻库、闻铺、闻店。",
            "小时" => "犯之小而肚胀、泄痢。",
            "厌对" => "对冲为厌对，主鬼神，妨婚姻。",
            "元武" => "忌北方七宿总称，即玄武。",
            "月害" => "忌修造、词讼、出阵、行军、嫁娶、迁徙，犯之损人丁、六畜，凶日。",
            "月建" => "忌修造、起工，动土及凶，宜避之。",
            "月刑" => "忌修造、词讼、出阵、行军、嫁娶、迁徙，犯之损人丁、六畜，凶日。",
            "月虚" => "忌造门、开张、开店。",
            "月厌" => "忌嫁娶、造酒、出行。",
            "灾煞" => "忌出行、迁徙、词讼",
            "招摇" => "忌出行、迁徙、词讼",
            "致死" => "天吏，凶神，忌临官、上任、词讼。",
            "重日" => "忌订婚、嫁娶、治病、词讼。",
            "八风" => "忌行船，犯之翻船损财。",
            "八龙" => "无",
            "八专" => "忌行军、出阵、安营。",
            "触水龙" => "忌造船、修船、行船。",
            "大会" => "所谓阴阳大会，是月内阴阳正会之辰，由月建和月厌的干支推导而来。",
            "大煞" => "忌出行、迁徙、词讼",
            "大时" => "日聚殃，往来其下，必致死门。",
            "大败" => "忌出行、营谋、求婚、百事凶。",
            "游涡" => "忌求医、祭祀。",
            "祭祀" => "指祠堂之祭祀，即拜祭祖先或庙寺的祭拜、神明等事。",
            "入学" => "古时指入学堂，现代可用于应聘中的报名，开学典礼。",
            "沐浴" => "祈福、许愿而沐浴斋戒，洗澡。",
            "订婚" => "老黄历中“纳采”。古时指缔结婚姻的仪式，受授聘金，现代可用于合婚订婚。",
            "嫁娶" => "男婚女嫁，举行结婚大典的吉日。",
            "疗病" => "治疗疾病。",
            "破土" => "仅指埋葬用的破土，与一般建筑房屋的[动土]不同。即[破土]属阴宅，[动土]指阳宅也。现今社会上多已滥用，择日时，须辨别之。",
            "安葬" => "举行埋葬等仪式。",
            "会友" => "与亲戚好友联络交往。",
            "上梁" => "装上建筑物屋顶的梁木，同架马。",
            "出行" => "外出旅游，观光游览。",
            "上官" => "走马上任，上官赴任。",
            "拆屋" => "拆掉房屋或建筑物。",
            "作灶" => "安修厨灶、厨炉移位。",
            "搬家" => "指迁移住所之意，俗称搬家，指搬入旧屋（非新宅）。",
            "祈福" => "祈求神明降福或设醮还愿之事。",
            "求嗣" => "向神明祈求后嗣（子孙）之意。",
            "求医" => "就医，请大夫看病。",
            "装修" => "指阳宅之建造与修理。",
            "剃头" => "古时指初生婴儿剃胎头或削发出家。现代可用于日常的理发、做发型。",
            "破屋" => "拆屋或局部改造。",
            "安床" => "指安置睡床卧铺之意。古时安床后，要请生肖属龙的孩童在床上翻转，俗称[翻床、翻铺]，为[早生贵子]的象征。并于晚间祭拜[床母]。安床后不能安房，亦忌单人独睡，所以大喜之前，准新郎睡觉时，需由一伴郎陪伴。",
            "打井" => "开凿水井，安装取水设备。",
            "渡水" => "乘船通过江河。",
            "平道" => "指铺平道路等工事。",
            "捕捉" => "黄历中的“捕捉”，即扑灭农作物害虫或生物。",
            "取鱼" => "亦作“取渔”，指把养好的鱼取出来卖。",
            "领养" => "黄历之中的“进人口”，指收纳养子养女。",
            "修补" => "修理破损之物使之完好。",
            "开渠" => "开挖水渠，兴修水利。",
            "伐木" => "指砍伐树木，修剪花木花枝。",
            "裁衣" => "古时临近婚期前一个月，男方还要备酒、蓝布和金银钗环交给媒人送到女方家，谓之[裁衣]。现指逛街买新衣服。",
            "坏垣" => "拆除围墙。",
            "求财" => "相对于纳财来说，求财是指未属于自己的财富而祈求通过投资等活动赚取博得财富。",
            "置业" => "指购买建成的房子。",
            "考试" => "参加考核、面试等。",
            "签约" => "签订合同，订立契约、签约合同等商业、法律行为。",
            "出货" => "商家之发货、出货、销货的意思。",
            "交易" => "订立各种契约互相买卖之事，同立券，古时候做买卖都要写字据的，如买房有房契，买地有地契，把自己的权利通过契约这种方式写下来就叫做立券。",
            "开市" => "开业之意。商店行号开张做生意。同“开幕礼”“开工”。包括",
            "立契" => "签订合同，订立契约、签约同等商业、法律行为。",
            "收购" => "指购置产业、进货、收账、收租、讨债、五谷入仓等。",
            "买卖" => "订立各种契约互相买卖之事。",
            "开仓" => "指打开粮仓货仓，取粮，出货。",
            "诉讼" => "打官司，起诉状。",
            "放债" => "借钱给人以收取利息。",
            "诸事不宜" => "在当天做什么事都不好，都不适宜。",
            "入宅" => "指搬入新房子而非二手房",
            "纯阳" => "四月厌干为己，阳建为已，卦象为纯阳无阴的乾卦，因此四月的已己日为纯阳，主不吉。",
            "纯阴" => "十月厌干为己，阳建为亥，卦象为纯阴无阳的坤卦，因此，十月的己亥日为纯阴、主不吉。",
            "单阴" => "三月厌干为戊，阳建为辰，卦象为五阳一阴的夬卦，因此，三月的戊辰日为单阴，主不吉。",
            "孤辰" => "在十二个月中，三月、四月、九月、十月这四个月没有阴阳大会日，因此古代术数家按照天干方位与月建的对照规则，将相隔更远而与阳建不合的天干与月厌地支相配，成为孤辰。",
            "孤阳" => "阳建为戌，卦象为五阴对一阳九月厌干为戊，的剥卦,因此,九月的戊戌日为孤阳，主不吉。",
            "行狠" => "在十二个月中，三月、四月、九月、十月这四个月没有阴阳大会日，因此古代术数家按照天干方位与月建的对照规则，将阳建方己错过的天干与月厌地支相配，成为行狠。",
            "九虎" => "无",
            "绝阳" => "指九月、十月阳气灭绝的过程，是所谓绝阳，孤阳的进一步发展。具体日辰从九月小会之即戊戌日起，延伸至十月。",
            "了戾" => "在十二个月中，三月、四月、九月、十月这四个月没有阴阳大会日，因此古代术数家按照天干方位与月建的对照规则，将阳建前方尚不及的天千与月厌地支相配，称为了戾。",
            "六蛇" => "无",
            "七鸟" => "无",
            "岁薄" => "薄含有迫近的意思。岁薄指阴阳二建相向而行，交相迫近。",
            "天符" => "无",
            "天狗" => "不适合嫁娶。",
            "五墓" => "凶日，百事忌。",
            "小会" => "所谓的阴阳小会，为月内阴阳偶会之辰，由月建和月厌的干支推导而来的。",
            "血忌" => "忌针灸、刺血、阉割、六畜、穿牛鼻。",
            "阳破阴冲" => "阳破阴冲是阴阳二建分别冲破的干支的合称，这种情况在一年中共有两次，即两日。六月阳建在未而冲破丑，阴建在己而冲破癸，因此六月的癸丑日被称为阳破阴冲。同样的，十二月的阳建在丑而冲破未，阴建在亥而冲破丁因此，十二月的丁未日也被称为阳破阴冲。",

            "阴道冲阳" => "阴道冲阳指阴阳二建分出二支且相互冲击，这种情况在一年中共有两次，即两日。二月阳建在卯而冲击酉，阴建在酉而冲击卯，因此，二月己卯月宿在卯，己卯日为阴道冲阳。同样的，八月阳建在酉而冲击卯，阴建在卯而冲击酉,因此，八月己酉月宿在酉，己酉日为阴道阳冲。",
            "阴绝" => "所谓绝阴，指三月、四月阴气灭绝的过程，是单阴的进一步发展。具体日辰从三月小会之即戊辰日期，延伸至四月。",
            "阴位" => "阴位由阴阳二建推导而来，一岁中共有两日。三月阳建在辰，阴建在申，因此三月庚辰日为阴位，月宿在辰，同样的，九月阳建在戌，阴建在寅，因此九月甲戌日为阴位，月宿在戌。",
            "阴阳击冲" => "阴阳冲击在一岁中共有两日。五月的壬子日及十一月的丙午日被称为阴阳冲击。",
            "阴阳交破" => "阴阳交破在一岁中共有两日。四月阳建在己，破于亥，亥为阴，被阳所破；阴建在未，破于癸，癸为阳，被阴所破。十月的丁巳日也被称为阴阳交破。",
            "阴阳俱错" => "指阴阳同建且又叠同建之干。这种情况在一年之中共有两日。五月的丙午日和十一月的壬子日即为阴阳俱错。",
            "逐阵" => "指阴阳二建背道而驰，各随其阵。",
            '筑堤防' => '修筑拦水的堤坝',
            '诸事不利' => '在这天举办结婚、入宅、开市等事情不适合。',
            '整手足甲' => '初生婴儿第一次修剪手足甲。',
            '针刺' => '古代指针灸或给奴隶纹身、现代包括打针',
            '斋醮' => '庙宇建斋前需举行的斋戒仪式。',
            '栽种' => '栽种植物，或接枝。',
            '酝酿' => '指酿酒、造酱料等事。',
            '远回' => '归乡、回家',
            '移徙' => '指搬家迁移人主所之意。',
            '修置产室' => '装修房子',
            '修造' => '指阳宅之坚造与修理。',
            '修饰垣墙' => '修缮矮墙。现在多理解成装修或修建墙院之类的建筑',
            '修仓库' => '建筑仓库或修理仓库。',
            '问名' => '男女双方各取年庚，供于神案，经数日无事即可合婚。',
            '畋猎' => '打猎或捕捉禽兽。',
            '竖柱' => '竖立建筑物的柱子。',
            '上官赴任' => '走马上任。',
            '上册受封' => '适合给中央写信，接受中央的任命、表彰',
            '苫盖' => '采用专用苫盖材料对货垛进行遮盖',
            '扫舍宇' => '冲洗宅舍、解除灾厄',
            '求医疗病' => '仅指求医治疗慢性痼疾或动手术。',
            '启攒' => '指“洗骨”之事。俗谓“拾金”也。',
            '破屋坏垣' => '指拆除房屋或围墙。',
            '平治道涂' => '指铺平道路等工事。',
            '纳畜' => '买入家畜饲养之事。',
            '纳采' => '缔结婚姻的仪式、受授聘金。',
            '纳财' => '购置产业、进货、收帐、收租、讨债、贷款、五谷入仓等。',
            '牧养' => '牧养家畜。',
            '疗目' => '治疗眼睛',
            '立券交易' => '订立各种契约互相买卖之事。',
            '开仓库' => '出货财、商家之出货、销货、放债',
            '经络' => '安机器、织布、收蚕、安纺车、机器。',
            '进人口' => '指收纳养子女而言。',
            '解除' => '扫舍；指冲洗宅舍、解除灾厄。',
            '结婚姻' => '(嫁娶)结婚典礼、迎亲之日',
            '会亲友' => '和亲友相聚',
            '冠笄' => '“冠”指男、“笄”指女、举行男女成人的仪式、称之为冠笄。',
            '鼓铸' => '鼓风扇火,冶炼金属 ',
            '动土' => '建筑房屋时、第一次动起锄头挖土。',
            '大事勿用' => '结婚、入宅、开市等重大事情不适宜在这天进行。',
            '穿井' => '开井，开水井',
            '出货财' => '借贷财物或货物的意思',
            '乘船' => '坐船',
            '补垣塞穴' => '修补墙垣，堵塞洞穴',
            '补垣' => '修补房屋或者围墙。',
            '安碓硙' => '安放舂米的石磨',
            '掘井' => '黄历中的“开渠穿井”，开凿水井，安装取水设备',
        ];
        return isset($list[$value]) ? $list[$value] : "无";
    }

    /**
     * 获取钠音解释
     * @param $gz 干支
     * @return mixed|string
     */
    public static function getDetailNaYin($gz)
    {
        $list = [
            '白腊金' => '白蜡金者，昆山片玉，交栖日月之光，凝聚阴阳之气，形明体洁，乃金之正色也。此金惟喜火炼，需炉中炎火。然庚辰见之，若无水济，主贫夭，辛巳却以贵论，缘巳金生之地，见丙寅化水逢贵故也。山下火生早，主荣贵，亦需水助方得。井泉、大溪俱为贵格，庚官在丁，辛官在丙，故庚见丁丑，官贵俱全；辛见丙子，不如癸巳更清，不贵即富。论中见木，逢多无益，以此金不能相克。若柱遇无气之火，却要木生，有禄马贵人方吉。见土只宜磨砌，方成器物，则吉，别土无用。金忌海砂，为汩没，日时逢火则荣。若见清金，加水相助，火亦不爱，只怕冲刑。妙选有哨风猛虎格，以此金日时遇辛巳或乙巳是也。',
            '金箔金' => '金泊金者，润色杯盘，增光宫室，打薄须藉乎别金，描彩必假乎水力。此金甚微，非木则无所依。以平地为上，有此不宜见火，有火主夭。遇太阳为日间之显，二火相反，不宜同见。山下、山头，有清水助之，亦吉。惟忌炉火，就位相克。此金体薄，不能反源定夭，限运同论。井泉、涧下、天河水清，日时喜见，须月令有木，方吉；溪流、大海水浊，见溪流主漂荡，见大海无木为基，主凶残。金遇剑锋、钗钏，可以装饰，有辅成造化之理，故喜见；砂海、白蜡无益，有火济之，亦吉，无则终凶。城头、壁上二土有靠安身，城头多主寄人，壁上加木则贵，再遇灯火辉光照耀，主权贵。丙戊土中藏火，干支却不宜太炎，亦为贵格，考妙选。金命而遇戊寅，昆山片玉格也；癸卯而遇己卯，玉兔东升格也，与前海金同。',
            '海中金' => '海中金者，宝藏龙宫，珠孕蛟室，出现虽假于空动，成器无藉乎火力，故东方朔以蛤蚌名之，良有理也。妙选有珠藏渊海格。以甲子见癸亥，是不用火，逢空有蚌珠照月格。以甲子见己未是欲合化互贵，盖以海金无形，非空动则不能出现。而乙丑金库，非旺火则不能陶铸故也。如甲子见戊寅庚午是土生金，乙丑见丙寅丁卯是火制金，又天干逢三奇，此等格局，无有不贵。旧说甲子乙丑俱喜见炉中火，丙寅旺火不宜木助。丁卯败火却宜木助。佛灯山头山下诸火性微不能炼金，故宜木助。天上火不能克金，须假凡火再得水济，无冲破为佳。霹火就位相克，性主昏蒙，运如再犯大凶，见木则无造化以此金未能成器不能制物故也。若月日有火而时遇木却以财论则吉。井涧溪天河等水，无火俱不宜见。海水亦不宜，然以妙选论之，则为贵格。据理甲子见癸亥，逢生趋乾，何不可有。路傍屋壁城头大驿诸土，在日时柱中，天元支辰纳音俱无火制主贱，中年夭。佘见亦未然。以庚午辛未，戊寅己卯二土造化有情故也。如甲子见庚午，坎离相济，见辛未官星带贵。乙丑见庚午官贵互换。甲子见戊寅绝地逢生，见己卯天干合化。乙丑见戊寅亦绝地逢生，见己卯则归禄带财。佘土又当仍分年年上禄马贵人方准。沙土埋金诚不宜见，有火宜不吉。柱中逢金，沙蜡原未成器，海中又未成器，彼此无益，故无火不宜。剑钗巳成器金相见有助。妙选谓之脱体化神主贵，泊金亦好。如甲子见甲子乙丑见乙丑同类相资，柱中喜见一寅，见戊寅谓之昆山片玉，如甲子见乙丑谓之干支连珠，非得火炼不可，即子平金神格之义也。',
            '砂石金' => '砂中金者，刚形布地，宝质藏砂，直教陶洗为珍，必须因人始贵。此金非炉火则不能制，但甲午见丙寅，寅中火生，寅午合局，柱无长生之土则燥，更值木助。主疾夭；丙午纳音虽水，而支干纯火，加逢尤凶。山头、山下、覆灯三火既有木生，克制此金，又须清水济之，决主少年荣贵。戊子、己丑龙火相逢，子午有交媾之妙，甲己有合化之理，主贵，杂以凡火则不为奇。水惟宜井泉、涧下、天河，清静则吉；长流、大海，动而不静，并见则金泛不安；海水尤忌，见木有何关系？火衰却喜生扶，更有禄马贵人互换朝拱为上，如柱无火，逢一二木则危。若甲午远己巳，是谓采精金于黄碛，乃贵格也；金生于砂，得造化则吉，若更逢砂土，反有埋没之忧；路旁、大驿亦在所忌，有火庶几；城头戊寅、乙未喜见，谓之采精金于青沙，乃贵格也。唯丙戌之土中藏火库，乃喜见之金，为同类最喜，清气为上。海中，白蜡有火制亦得。',
            '剑锋金' => '剑锋金者，白帝司权，刚由百炼，红光射于斗牛，白刃凝于霜雪。此金造化，非水不能生，大溪、海水，日时相逢为上格；井泉、涧下，有霹雳助或得乙卯之雷方好，若无雷雳，亦金白水清格也。秋生更吉，日时遇长流在壬辰，为宝剑化为青龙，癸巳亦得。此剑不能通变。然癸丑为剑气冲头，最吉。松柏、杨柳亦吉，但多聚散；大林、平地嫌有土制，主劳苦。火见神龙，阴阳交遇，如壬申逢己丑、癸酉逢戊子，方为上格。遇天上、炉中二火，无水救则夭。诸土见皆不吉，以其埋没，只壁上、城头有磨锋淬砺之用，此二土则可。金喜同类，如壬申见壬申，癸酉见癸酉，有木制之，是谓盘根错节，所以别利器也。无木主带疾。大抵剑锋乃金之最利者，只宜水，不宜火刑，如见寅己三刑，全者大凶。',
            '钗环金' => '钗钏金者，美容首饰，增光腻肌，偎红倚翠之珍，枕玉眠香之宝。此金藏之闺阁，惟宜静水井涧溪流见之皆吉多见则泛。海水贫夭，天河辛亥见之无妨，丙午真火庚戍凑成火局有伤此金也，太阳火，日生显耀。佛灯火夜间显耀皆宜见。但甲辰乙巳与庚戍辛亥相冲，阴阳互见为妙。戊子己丑与丙午丁未相持二火忌叠见，非贫则夭。炉中火庚戍最忌，辛亥见之有丙辛合化水稍吉。山下山头俱不宜见，若有水济亦可。柱中有木此金入于匣中有福贵方吉。土见砂中相生相养更有涧下水助荣华富贵。金喜剑锋则成造化。泊金增光钗钏须假微火济之。别金无用。若命中只有金水更无夹杂，为金白水清在活法推之。',
            '桑柘木' => '桑柘木者，缯彩镒基，绮罗根本，士民飘飘之袂，圣贤楚楚之衣。此木供蚕为弧，其用甚大。最爱砂土，以为根基，又以辰巳为蚕食之地，不宜刑冲互破，路旁、大驿二土次吉，余土无益。水喜天河，为雨露之滋，长流、溪涧、井泉诸水皆可相依，亦须先得土为基，更加禄贵为妙，沧海水漂泛无定，无土主夭。见火灯头最吉，亦以辰巳之中为蚕位故也；炉中位居寅卯，木之旺地；天上、霹雳二火与此木干支有合化之情，有坎离交媾之妙，俱吉，但诸火不宜叠见。以金言之，砂中第一，剑锋能修整此木，为次，钗泊二金须得土为基，如逢冲破，又凶。木喜庚寅辛卯，为以弱就强，以小变大，作贵格论，纵无砂土，亦吉；平地、石榴，无土则凶；大林乃东南蚕食之位，有土资生，主大贵；遇杨柳为桑柳成林，亦是贵格，须生春夏方吉。',
            '松柏木' => '松柏木者，泼雪凑霜，参天覆地，风撼笙篁之奏，雨余旌旆之张。此木藏居金下，位列正东，乃为极旺，最喜山为根基，水为滋润。天河雨露之水可以滋润，涧下丁丑属山，可为根基，丙子不如大溪有乙卯为雷，可以发荣，却嫌风霹，有损折之凶；大海水有山则吉，癸亥清静无山，亦吉。若柱有平地，得屋土，则为已成栋梁，无用山水。无此二件，乃山间之茂木也，须要山水。命中有火，最忌炉中，就位相生，再加风木，灰飞烟灭，五行无水，主夭折；山头、山下、太阳、覆灯皆不可犯；寅人尤忌戊午、丙寅，以木不南奔，寅午三合火局故也，辛卯无害；霹火虽可滋生，运加凡火，主凶。土见路旁，似无足贵，若无死木，其福还真；驿土无山贫夭，更加海水，尤凶。金逢乙丑，为印为山；泊金就位自旺，主吉；剑锋能削能斫，更得壁土相成，松柏相资，主贵。大林有风，杨柳会火，二木最忌；桑柘癸丑为山，可以相助；石榴是辛酉金反化死木，有造化，却吉。妙选有苍松冬秀格，是以此木生人月日时属三冬为贵；有日合辛卯、日值庚寅二格，虽取戊午已未，生居夏秋，然专论此木为贵。',
            '大林木' => '大林木者，枝干撼风，柯条撑月，耸壑昂霄之德，凌云蔽日之功。此木生居东南，春夏之交，长养成林，金假艮土为源，癸丑为山，三命无破陷，最为福厚权贵，戊辰为上，己巳次之。土遇路旁，为负载，戊辰见辛未为贵，己巳见庚午为禄，主富；壁、屋二土，再得剑金，则大林之木取为栋梁，成格最吉，无此乃山间茂林之木也。此木无论死活，皆欲见土，如己人见甲，虽云化土，然不如辰戌丑未，土局纯金为妙。若此木已死在山之下；见甲戌乙亥烧之，主凶夭；灯火就位相生，乙巳不如甲辰更吉；霹雳、太阳二火皆能长育运中，遇之亦吉，然二火嫌并见，持胜须有土为根基方可。水见天河，戊辰见丁未带贵，虽无土与山，亦主有衣食，即灵槎入天河格也，生秋冬死绝方是；溪、海二水重见，主贫夭，有山稍得。妙选有苍龙驾海格，是戊辰见癸亥为贵，涧下丁丑最吉，丙子不如。诸金俱不宜见，海中有乙丑为山，剑锋得屋壁为本，余金无用，逢之主夭贱。木喜桑柘，唯癸丑最妙；平地还须得路旁土，谓之平林在野；松柏，东方生旺之地，柱有癸丑而得松柏为密荫，最佳。',
            '杨柳木' => '杨柳木者，隋堤袅娜，汉苑轻盈，万缕不蚕之丝，千条不针之带，午未木之死墓，壬癸木之滋润。此木根基唯喜砂土，见艮山则依倚摇金，遇寅卯东方得地；辛丑有山，庚子不如；戊寅虽吉，己卯尤胜；丙辰丁已却嫌戌亥对冲；若见大驿，有丑为山边之驿，稍可，无丑独见此土，主夭贱；路旁就位，复值死墓，日时遇之，主人卑弱；屋土壬午见丁亥，丁壬合化则吉，丙戌不如。水见井泉、长流、大溪、涧下皆吉，中间又分合化之位，尤吉。丙午丁未，丙丁真火，午未亦火，此木至午未死墓，壬午见之，大凶，癸庶几有别，水济之无害；此木午未已自有火，更见别火，恐引起伤寿，灯头乙已有风木折，主夭；炉中寅卯本位，木旺反吉；霹火如壬午见己丑，癸未见戊子，阴阳交遇，更有砂土为基，主贵，若子午丑未对冲则不为吉。金见木无造化，钗钏、金泊却喜成功，海、蜡、剑、砂虽忌见之，其间轻重当以禄贵德煞，参祥见松柏木，为脱体化神之格也，主贵。桑柘癸丑为山，作倚傍成林，主吉；庚申辛酉木既死绝，又逢金克，以弱遇小，其人必贱。妙选有花红柳禄格，是以此木遇石榴，生于春夏，不以贱论；有杨柳拖金格，是以此木生于三春而时得一金，辛亥、甲子、癸卯、辛巳最妙，乃壬癸禄贵之地故也。',
            '石榴木' => '石榴木者，性辛如姜，花红似火，数颗枝头，累累多子，房内莹莹，干支纯金而纳音属木，乃木之变者也。可以移盆内而妆做山，故喜成器之土，以为根基，城头为上，屋上次之，然必阴阳交见，则丙辛丁庚互官，戊辛己寅互印，主吉；路、壁、驿、砂四土有山助之，亦吉，若无何用？见金砂中最吉，泊金干支水木而纳音金，榴木干支金而纳音木，皆脱去本性而互换归旺，以木旺寅卯，金旺申酉，各得其位，谓之功侔造化格，主大贵；海中乙丑为山，更逢水助则吉，或壁上，城头，亦得剑锋，就位相克，最凶，若先有砂金，能制其毒，亦不为害。水见天河，雨露相滋，井泉、溪涧，清水浇灌，大海太泛滥，非贫则夭，有艮土稍得。太阳、霹雳二火虽喜，不宜并见；炉中寅卯旺位，本吉，再加别火则凶。若此木生于五月，日时止带一火，谓之石榴喷火，主贵。桑柘、大林、杨柳三木皆喜见之，见大林戊辰脱体，见杨柳花红柳绿，皆主功名；见桑柘癸丑为山，见松柏则强，见平地则大，若无别物夹杂，则禄绕红围，亦主富贵，如得城土为基，水运为助，享福优游，最为长久。',
            '平地木' => '平地木者，初生萌蘖，始发枝条，唯资雨露之功，不喜雪霜之积，此乃地上之茂材，人间之屋木。戊戌为栋，已亥为梁，最宜互换见之，须以土为基，土爱路旁，为正格，更逢子午，尤贵，以子午为天地正柱故也；屋、壁、城头三土以此木相资，中间有升化，尤吉；砂、驿无用，日时见之，主灾；太阳、霹雳，最为显耀，炉中遇水则福，灯头无风则固，余火无水则凶；此已成之木，不宜剑金，有木相资则可；泊金增饰光辉，又天干合，地支旺，更有旁土为基，主大贵。余金无用。水见天河，为润泽，主吉；溪、海无山俱凶；井泉、涧下虽吉，内甲申合丁丑为山，遇之尤吉。木见大林，有风摇动，主寿促；桑柘癸丑最吉，壬子己亥人见之为贵，戊戌人不堪；松柏木倚辅平地为栋梁，更有土助，主贵。大抵此木恶金而喜水、土，若生三冬时，得寅卯为寒谷回春，亦贵论也。',
            '涧下水' => '涧下水者，山环细浪，雪涌飞端，相连南北之流，对峙坎离之脉。此水清澄，喜见金养，砂中、剑锋二金最宜。钗钏庚戌丁丑不宜，以丑戌相刑，辛亥见丙子则丙辛化水，尤贵；余金以禄贵参之，取其资生，恶其冲破。见木一位不妨，二三则主劳苦，亦以贵人禄马参之。命中见土，主人多浊天元，若木或化水，则主清吉；砂中、屋上二土，其气稍清，路旁、大驿则浊甚矣，主财散祸生，如辰、戌、丑、未土局，其凶尤甚，以水浊土浑故也。火见太阳，虽炎，中间有既济未济之论；霹雳就位相争，最所不宜。若二火并论，无金资助，主荒淫，有金别论；山下、山头亦吉，若并临，时日则嫌。命中遇水，反成漂荡，见天河为引凡入圣，见大海为福贵朝宗，皆吉，独丁丑见壬戌，则丑戌相刑，丁壬淫合，主风声不雅；大溪性急，长流不静，皆不为吉，大抵此水须以多为主，而无火土夹杂，再得甲寅乙卯之水，则源远流清，真君子人也。',
            '大溪水' => '大溪水者，惊涛薄岸，骇浪浮天，光涵万里之宽，碧倒千山之影，最喜有归有养，遇坎则为有归，得金则为有养，所嫌者，日月时中，有申酉冲动，或辰巳风吹，主飘流；井泉水净而止，涧下有丑为艮，天河沾润，大海朝宗，此四水皆吉；长流有风，独不宜见。此水以清金为助养，唯钗、砂最宜，蜡金亦清，若有钗金对冲则不宜；海中虽无造化，甲子属坎，乙丑为艮，乃归源之地，亦吉；泊金最微，不能相生，岂有超显之理？剑金虽化于大溪，却忌卯雷巽风，主性不定。五行有土，皆为无益，屋上、城头壅阻此水，路旁稍可，亦不为奇；壁上独辛丑为山，大驿唯己酉有合，戊申则冲，庚子则刑，皆不为吉。火见太阳，虽假照耀，霹雳尤忌相逢，若二火互见，主贫，单见别论。木见此水，徒被漂荡，唯桑拓木壬子有坎，癸丑为山，为水绕山环之贵，内甲寅人见壬子吉，乙卯人见癸丑吉；余木以禄贵参之，尤忌冲破。',
            '长流水' => '长流水者，混混无穷，滔滔不竭，就下必纳于东南，顺流自归于辰巳。此水喜金生养，金要白蜡、钗钏，以天干有庚辛真金，地支辰巳就位相生，戌亥为归源之地；剑锋纯是金水，泊金水木居东，皆以吉论；海中，砂中无取。嫌土蹇涸，而土有堤防之用，六土之中，取庚辛丙丁为吉，戊己无用。遇火则相刑，而有既济之妙，内壬辰喜见丁卯、丁酉，癸巳喜见戊子、戊午，以天干合化故也；灯头癸巳尤喜见甲辰，山头壬辰尤喜遇乙亥，化龙归禄，取义更佳。逢木虽漂泛，而桑拓癸丑为山，杨柳癸未为园，年时得此水围之，为水绕花堤，大贵格也；松柏、石榴，天干有金相生；大林、平地，虽嫌有土，而癸巳见戊辰，壬辰见己亥，俱吉。水为同类，涧下则丁壬合化，天上则雨露相资；井泉、大溪无益；海乃众流所归，而壬辰之龙得癸亥则龙跃天门，春夏秋生为吉，或龙潜大海，则冬生乃宜，柱中须先得金为妙。又壬辰为自印之水，再见壬辰则刑，刑则自害，见戊戌则冲，冲则泛滥，主凶；癸巳，自绝之水，名为涸流，若遇丙戌、丁亥、庚子、辛丑之土，其涸可待，柱中如得三合生旺之金生之则吉。',
            '天河水' => '天河水者，乱洒六野，密沛千郊，淋淋泻下银河，细细飞来碧落，此乃天上雨露，发生万物，无不赖之。银河之水，土不能克，故见土不忌，而且有滋润之益；天上之水，地金难生，故见金难益，而亦有涵秀之情；生旺太过则为淫潦，反伤于物，死绝太多则为旱干，又不能生物，要生三秋得时为贵也。水喜长流、大海，内丙午宜癸巳、癸亥，丁未宜壬辰、壬戌，阴阳互见，尤吉；大溪乙卯为雷，井泉己酉为贵，俱以吉论。火喜霹雳，为神龙之火，与此水相济。而倏忽变化，云行雨施，岂有不贵？炉中火旺，大海水旺，如柱中得二火二水，上下上相济，谓之精神俱足，大贵格也；灯头有风，山头有贵，皆以吉论，又须以别水济之方吉；天上就位相克，则忌见之。木石榴、杨柳俱吉，大林有巽，平地有亥，亦吉；松柏、石榴遇丙辛合化，亦以吉论。妙选有灵槎入天河格，是取死绝无根之木，柱无土培则漂流天河是也。土虽不能克，而柱逢庚午辛未，就位相克，土壅水滞，或水又冬生，则水结池塘，必主浊滥；余土如砂中、屋上皆吉，城头，大驿无用，壁上对冲，亦坏造化。水、金虽不能生，独辛亥钗金却属乾天，水在天上，只此最吉；余金亦取天干有庚辛、壬癸者为用，甲乙无益，再以禄马贵人参之始得。妙选又以水生人得庚子、壬子为云腾雨施，生春则旱，夏则潦，冬则寒，独三秋最吉；遇甲辰乙巳、庚辰辛巳，柱中有壬为云，有辰为龙，为风雨作霖；若生冬月，是为霜凝薄露，日时喜遇寅卯温和之气，可解斯冻，俱贵格也。 ',
            '泉中水' => '泉中水者，寒泉清冽，取养不穷，八家凿之以同饮，万民资之以生活。此水生于金而出于木，故喜见金为福，砂中有土，性与之最宜，钗钏清秀次之，蜡金与钗金相冲，故不宜再见；剑锋申酉太旺，恐有泛滥之灾；海金无取，乙丑为艮，山下出泉，亦吉。此非木不能出，譬之桶论，故见木皆吉，如见平地、大林，须假剑金削之，方可取用；桑拓、杨柳无用；松柏则互换归禄，此其最吉。诸火阴阳互见则吉，霹雳名为入圣，太阳号为显照，二火相见最吉，但不宜并有则凶。诸土路旁、砂中最吉，屋上有天门生水之源，亦吉；城头，壁上与此水则无干涉；大驿就位相克，水为土掩则井不食，须有木去之方可。水喜大海，为引凡入圣；天上、涧下、长流亦不为在灾；大溪甲寅乙卯为吉，如甲申见乙酉，乙酉见甲申，官星互换，最吉；如二水在年时，二木在月日，谓之水绕花堤，乃贵格也。',
            '大海水' => '大海水者，总纳百川，汪洋无际，包括乾坤之大，升沉日月之光。此水原有清浊，以两般分论：壬戌有土气为浊，癸亥干支纯水而纳音又水，故清。壬戌人嫌山，以土气太盛，有金清之方吉，癸亥最喜见山，然后海水之性始安；涧下丁丑为山，天河与海上下相通，柱中有木为槎则乘槎入于天河，极为上格；长流、大溪等水毕竟皆归于海，以海水不择细流，故能成其大也；壬辰为龙归大海，尤吉，中间又分阴阳互见，干支合化方可；井泉则有所制，与海不通，故不喜见之。诸金独海中第一，以壬戌癸亥喜见甲子乙丑；砂中亦得，余金又当以贵人禄马参之。火喜天上，与海水相为照耀，最吉；霹雳己丑为山，戊癸合化，柱得木火旺地，亦吉；山下、山头、覆灯诸火不宜见。木唯壬子癸丑、壬午癸未俱吉；大林有风冲动，水性不安；平地厚载，则就位相得；松柏、石榴若无土制则漂泊无定。土爱路旁、大驿，唯此二土足以振之不泄，况癸亥见戊申为天关地轴大格，日时遇此厚土，纵有风雷，亦不为害；城头己卯须资艮则吉，如逢霹雳，则雷火变化，海水汹涌，亦主贫寒。',
            '霹雳火' => '霹雳火者，一缕毫光，九天号令，电掣金蛇之势，云驱铁马之奔。此火须资风水雷方为变化，若五行得值一件，皆主亨通。如日时见大海，癸亥为引凡入圣，己丑为上，戊子次之；见大溪，乙卯为雷火变化，己丑为吉，戊子忌之；辰巳为风运中，遇之尤佳；天上水名为既济，主吉，遇之者禀性含灵，聪明特异，长流无用，涧下虽就位相克，此神火也，不忌，有风亦显。五行见木，辛卯有雷，大林有风，平地有天门，与此火相资，余木无用。土见路旁，加巽则吉，砂中，丁巳有风，己卯有雷，得泉助之，亦主贵显。剑金加水，海金遇风，蜡金逢涧，皆吉，余金无用。见炉中丁卯为吉，戊子逢丙寅，太燥性凶，主夭。己丑见丙申却得，戊子忌之；灯火，东南巽地，有风最宜；戊午己未天上火，日时遇之，防刑克。再考妙选，有烈风雷雨格，即霹雳见天河是也，有天地中分格，即戊子见戊午是也，有雷霆得门格，即戊子己丑日时遇卯是也。',
            '炉中火' => '炉中火者，天地为炉，阴阳为炭，腾光辉于宇宙，成陶冶于乾坤。此火炎上，喜得木生，惟平地之木为上，以丙寅见己亥，谓之天乙贵，见戊戌，谓之归库，故吉，丁卯次之。然丙寅火自生，无木庶几，丁卯火自败，若无木则凶，且此火以金为用，更得金来，方应化机，但丁卯无木而更遇金，主劳苦之命。夫寅见木多火，炎而无水制，主夭，卯见三、四木不妨，如庚寅辛卯就位相生，壬午癸未化为真火，寅见之多主凶暴或疾夭。若天地原有水制，亦主中寿，丁卯无妨。此火虽喜得金为财，内剑金寅见之稍可，丁卯火既自败，又到申酉而死绝，如何能克！非贫即夭。海中、砂蜡诸金，须资木生，方喜见之，钗泊无用。井涧、溪流皆凶，有木不在此论。火见同类，若日月上衰败则吉；霹雳火本自无益，若得木生，更日时有海水则宜，无木遇水，凶；天上火须有屋土遮之，灯火巽风，又为鼓舞，亡神须兼造化，断如丙寅、丁酉、己酉、丙寅火为无气，不失大贵，如丙寅、甲午、己巳、丙寅则漂泛不安。',
            '覆灯火' => '覆灯火者，金盏光，玉台吐艳，照日月不照之处，明天地未明之时。此火乃人间夜明之火，以木为心，以水为油，遇阴则吉，遇阳则不利。凡日时最忌再见辰巳，地支有冲，恐风吹灯灭，主夭。或以戌亥，子丑为阴，或以自未至亥为阴。五行见木为根本，凡木皆好，更得官星、禄贵相扶，干头化水，尤吉；限运遇相助，主大贵。水以井泉、涧下为真油，长流假油，妙选有暗灯添油格，即此理也；大海、河水则不可以为油，遇者主寻常。大凡此火，见水须资木，不喜长生旺气，水太泛，反凶。命值泊金照耀，最为清贵，亦须水木相资，方能显达；砂中、钗钏二金皆吉；剑锋一金，谓之灯花拂剑，尤吉；蜡金不宜。五行见土，须防克破。若壁土可以安身，屋土可以覆庇，日时并见，主福贵，砂土有木，亦主衣食，余土无用。火爱同类，却怕风吹。霹雳为龙神变化之火，必带风来，此火难存；天上、炉中二火相见，最凶。再考妙选，有魁星格、指南格，以甲辰生人，日时遇午未为是；有火土入堂格，以此火怕风，日时遇丙戌丁亥屋上土，则灯在屋中，更得添油，尤贵。',
            '天上火' => '天上火者，温暖山海，辉光宇宙，阳德丽天之照，阴精离海之明，戊午为太阳则刚，己未为太阴则柔，或以为夏日则刚，冬日则温，诬也。俱要戌亥为天门，卯酉为出入之门，东南为行陆之地则吉。此火见木谓之震折，要日时有风与水方得。大林木有辰巳，松柏、石榴有卯酉，故惟此三木主贵。午见木多犹可，未三、四木，劳苦之命也。见金且能照耀，不能克济。钗金有戌亥，泊金有寅卯，主吉；剑金为耀日月之光，必主少年登第；余金则殃。水宜涧下，须戊午见丁丑，己未见丙子，阴阳交互，方为福贵，柱中更有木滋生，富贵双金；大溪有乙卯，井泉有已酉，出入得门，皆吉；天河雨露相济，不以就位克论，戌午见丁未，亦吉，丙午则不明。火爱灯头，再有别火则燥；霹雳带云雨则日月无光，故主昏蒙；炉中午忌丙寅，以午为刚火，才见丙寅，便为火生之地，若无清水解救，主犯刑凶死，丁卯稍可；土见砂中，有巽风相假；路旁、城屋皆吉，柱中更有金木相助，尤吉。考妙选，戊午遇卯，己未遇酉，为日月分秀格，而卯以乙卯、辛卯为正，已卯、丁卯次之，酉以乙酉、癸酉为正，已酉、丁酉次之；有日出扶桑格，即日分秀，再见已午日时；有日轮当表格，以戊午生于午，日逢已午日，又以戊午见戊子为坎离正位；有月生沧海格，即月分秀，而酉得乙癸是也；有月照寒潭格，是取壬癸亥子，纳音属水为潭，然必秋生为贵；有月桂芬芳格，是己未生人，柱有三、四木拱集，与桂林一枝，同桂林以少为贵，芬芳以多为贵，义各有所取也。再考凶格中，太阳损明，戊午不禁于水溢，是嫌水盛；太阴薄食，已未岂堪于土多？是嫌土重也。须如是并参，方尽其理。',
            '山下火' => '山下火者，草间熠耀，花理荧煌，寒林缀叶之光，隔幔点衣之彩，方朔以荧火名之，故妙选有荧火照水格，遇秋生则贵，为卿监，是以此火喜水，地支逢亥子，或纳音水更逢申酉月是也。或以山下之火最喜木与山，更得风来增辉为贵，又不以荧火论矣。大林木有辰巳为风，桑柘木有癸丑为山，松柏平地最吉，更得风助，主贵，若风多吹散，主夭。水爱井泉、涧下，有木相资，主爵位崇显，大海水不宜，然有山亦应贵格。寅卯为东方木旺火生之地，只甲寅水吉，乙卯为震，有风，见之不佳。若无火无山，更加霹火，主夭。天上水为骤雨，此火不宜相见，若先得山水滋助，亦无大害。命里有金，以清秀为吉，无木多逢，以窃气论之。乙丑为山，主贵；余金若无克破，遇贵人禄马，只以财论。土见砂中，辰巳有风，若有木有山加助，主大贵，无则虚名。火忌太阳，霹雳、灯头，是巽主光显大都。五行有火，须资木则吉，限数喜忌，俱依此断。',
            '山头火' => '山头火者，野焚燎原，延烧极目，依稀天际斜晖，仿佛山头落日，此乃九月烧荒，衰草尽烬之火也。大概宜山木与风木，喜大林、松柏，以辰巳有风，寅卯归禄，更得癸丑为山上木，主贵。无山则木无所依，火无所见，纵有风亦不光显，余木无用，只以禄马看。水宜涧下，多为交泰，主吉，井泉清水，有木助之，亦吉；大溪，甲戌见甲寅，乙亥见乙卯，却真禄俱吉；天上须有雨露，而火到午未得地，再得清水济之，不至于燥，主福，不然则夭；大海就位相克，最凶，有山逢之，稍得。日时见金为财，须有山木助之则吉，无则凶。见土惟砂中有巽，能扬此火，别土无益。大凡此火无木见害，多是下贱之命。见火炉中太炎，霹火凶害，太阳昏蒙，山下战刑，皆所不宜，命带二、三火，如限数逢木，主祸生不测，或夭，大都此火大怕刑冲。',
            '屋上土' => '屋上土者，埏埴为林，水火既济，盖蔽雪霜之积，震凌风雨之功，此土瓦也。非木无以架之，故以木为根基，平地为上，大林次之，余取天干化木，亦吉，只怕冲破。此巳城之土，不宜见火，炉中丙寅最凶，丁卯稍可；太阳、霹雳可取相资；山下、山头，有木生之则祸；灯头丙戌见乙巳为上，丁亥见甲辰次之，谓之火土入堂格，若柱中木多，亦不为吉。水宜天河、井泉、涧下，皆吉，如先得平地木成格，大贵；溪流无木多夭，若丙戌而得癸巳，丁亥而得甲寅，则又别论，再看日时所成造化何如；大海无山则不宜见土。土见路旁，如丙戌得辛未，丁亥得庚午，阴阳互见，更假木为基，主贵；壁土亦宜；余则汨没。若缺木而三刑聚，纵是二土亦凶，砂土独丁巳不妨。金唯剑锋、钗钏最吉，丁见壬申，天干化木，地支乾坤清夷，丙见辛亥，天干化水，地支丙入乾户，皆大贵格，若丁亥见庚戌，丙戌见癸酉，则不为吉；泊金有粉饰之用，亦吉；余金无用，当以贵禄参详。',
            '大驿土' => '大驿土者，堂堂大道，坦坦平途，九州无所不通，万国无所不至，此乃位属坤方，德乃厚载，轮天转日，负海乘山之土也。发生万物，以木为基。戊申，长生之土，德厚无疆，见三、四木皆能滋生，己酉，自败之土，木多则窃气；大林合中逢冲，主夭，别木则吉，更以禄贵参之。井泉、涧下二水清贵不燥，如戊申见丁丑或乙酉，己酉见丙子或甲申，谓之官贵，主吉；天河丙午而己酉得之，丁未而戊申得之，亦为贵禄，主福；长流戊申见癸巳，己酉见壬辰，亦吉，多逢则不宁静；大溪乙卯为东震发生之义，单见亦吉；海水对穿，土不能胜，日时遇主夭，得山稍轻，内戊申见癸亥，戊癸合申亥，为地天交泰，反吉。火见太阳、霹雳，谓之圣火，最能发生，此土如逢水助，主显达，其于凡火，再逢木生之，更燥，主凶夭。五行见土，唯路旁最宜，屋上、壁上、砂中纵先得木，亦为泯绝，城头有水，稍吉。命若有金，清秀，吉；钗钏得辛亥，金泊得壬寅，戊申遇之，柱中更加水助，乃地天交泰，水绕山环大格，主贵，己酉见庚戌、癸卯稍次；砂金造化亦同，剑金须候木得用，不然无益。',
            '路旁土' => '路旁土者，大地连途，平田万顷，禾稼赖以资生，草木由之畅茂。此乃火暖土温，长养万物之土也，故须假水为先，乃灌溉滋润之论，次第尤宜水化为妙，更得金来相助，则禾稼成实。如庚午见甲申，辛未见乙酉为禄，若无冲破，主早贵；天上水雨露相滋，庚午喜见丁未，辛未喜见丙午，为官贵禄合之妙；涧下庚午见丁丑，贵禄交驰，辛未见丙子，化水逢生；大溪乙卯为雷，能发生，此土又乙庚合化，故皆主吉；长流、大海二水以其不能浇灌，此土故最忌之，主凶夭。火逢霹雳，庚午见己丑，贵禄交穿，辛未见戊子，印贵朝阳，皆吉，天上火就位相生，太燥则土反不能生物，有水润之始得，若独见，主夭；炉中火亦燥，亦主妨寿；灯头有屋土，方应造化，名超凡入圣，不然亦凶。见木可以发生，然有贵人禄马则吉，刑煞冲破则凶。只有庚寅木，此土逢之大好，大林不能胜载，如土位见丙辰、丙戊、辛丑、辛未，皆吉；若庚午见辛未，辛未见庚午，为二仪贵偶，无有不贵。钗钏、砂中二金可以滋助，清水金水并见，大吉，若命已见水，无金运，遇此金亦福；乙丑海金可为山论，若得天河清水助之，庚人大好。妙选有金马嘶风格，以庚午、甲午生人得辛巳时；有马化龙驹格，又以午生人见辰时；有哨风猛虎格，以庚辛生人得辛巳、乙巳。俱以贵论，而水、火、土、金似不相拘。',
            '沙中土' => '沙中土者，浪回所积，波渚而成，龙蛇盘隐之宫，陵谷变迁之地。此土清秀，唯喜清金养之，更得犯净之土，主早贵；钗、砂、剑、泊此四金清秀相助，如丙人见辛亥为丙丁入于乾户，号曰驾海长虹，又有星拱北之论，皆贵格也，更得水相涵，尤为上吉，若无水而时日得天上火照，亦可，如丙辰乙未癸酉戊午，此命有二金资养，却全无水，得太阳火照，故贵；如丁巳癸卯己未壬申，此命二金资养，得天上火照，亦贵。然戊午太燥，己未稍缓，寿夭不同。水以井涧清洁为吉，若有金以养之，贵；如此土已得金养而日时有海水便坏造化，癸亥轻清，丙人见之限运，逢亦主显荣，余水无用。火喜太阳，在格号为朱雀腾空，主贵；山头、山下、炉中，覆灯诸火若无水济，主寿夭。木爰桑拓、杨柳，以此土能载二木故也，余木却以禄马贵人参之，如日中刑破冲克之木，虽见之有何造化？不如无为吉。五行最忌土相刑，路旁安身，有金木资生，亦主福庆；大驿往来，最不宜见，纵有金水亦凶，余土尤不为吉。',
            '城头土' => '城头土者，天京玉垒，帝里金城，龙盘千里之形，虎踞四维之势。此土有成有未成，作两般论。凡遇见路旁，为已成之土，不必用火，若无路旁，为未成之土，必须用火；大都城土皆须资木，杨柳癸未最佳，壬午则忌；桑拓癸丑为上，壬子次之；庚寅辛卯就位相克则城崩不宁，何以安人也耶？如见木无夹辅，只以贵人禄马论之。见水有山为显贵，甲申、丁丑俱吉，天河滋助，亦吉，唯忌霹雳、大海，壬戌不忌，合化俱以吉。推土爱路旁，防见诸火，大驿逢山，须作贵观，若独见无根本，贫夭孤寒。五行见金，只有白蜡，怕巽，二者相妨，余金无用，亦须以贵人禄马看之。',
            '壁上土' => '壁上土者，恃栋依梁，兴门立户，却暑御寒之德，遮霜护雪之功。此乃人间壁土，非平地何以为靠？子午，天地正柱，逢之尤为吉庆。凡见木皆可为主。庚寅辛卯亦是栋梁，只申酉冲破，子卯相刑；大林有风，若无承载之土，加凡火，主作事难成，贫贱而夭。土爱路旁，谓之负载，屋上、城头可以护身，皆吉。见火全无造化，太阳、霹雳虽云照耀，到底蹇危，若命先已见木，遇火助，鬼焚克运，再逢之，主祸患夭折，柱有水救济，稍得。水见甲申为最吉，乙酉次之；天上雨露，亦吉；大海漂泛，此土何安？纵有根基，亦凶。金唯爱泊金，命里先有木神则贵，以其成宫室而金碧辉煌，非朝廷不敢用也；剑金伤害，余金无用。',

        ];
        $value = isset(self::$naYin[$gz]) ? self::$naYin[$gz] : '白腊金';
        return [$value, isset($list[$value]) ? $list[$value] : ""];
    }

    //**************解释部分结束*************

    /**
     * 获取指定日期对应星座
     *
     * @param integer $month 月份 1-12
     * @param integer $day 日期 1-31
     * @return boolean|string
     */
    public static function getConstellation($month, $day)
    {
        $day = intval($day);
        $month = intval($month);
        if ($month < 1 || $month > 12 || $day < 1 || $day > 31) {
            return false;
        }
        $signs = [
            ['20' => '水瓶'],
            ['19' => '双鱼'],
            ['21' => '白羊'],
            ['20' => '金牛'],
            ['21' => '双子'],
            ['22' => '巨蟹'],
            ['23' => '狮子'],
            ['23' => '处女'],
            ['23' => '天秤'],
            ['24' => '天蝎'],
            ['23' => '射手'],
            ['22' => '摩羯']
        ];
        list($start, $name) = each($signs[$month - 1]);
        if ($day < $start)
            list($start, $name) = each($signs[($month - 2 < 0) ? 11 : $month - 2]);
        return $name;
    }

    /**
     * 获得空亡
     * @param string $gz 干支
     * @return string
     */
    public static function getKongWangbyGz($gz)
    {
        $kongwangList = [
            "戌,亥" => ["甲子", "乙丑", "丙寅", "丁卯", "戊辰", "己巳", "庚午", "辛未", "壬申", "癸酉"],
            "申,酉" => ["甲戌", "乙亥", "丙子", "丁丑", "戊寅", "己卯", "庚辰", "辛巳", "壬午", "癸未"],
            "午,未" => ["甲申", "乙酉", "丙戌", "丁亥", "戊子", "己丑", "庚寅", "辛卯", "壬辰", "癸巳"],
            "辰,巳" => ["甲午", "乙未", "丙申", "丁酉", "戊戌", "己亥", "庚子", "辛丑", "壬寅", "癸卯"],
            "寅,卯" => ["甲辰", "乙巳", "丙午", "丁未", "戊申", "己酉", "庚戌", "辛亥", "壬子", "癸丑"],
            "子,丑" => ["甲寅", "乙卯", "丙辰", "丁巳", "戊午", "己未", "庚申", "辛酉", "壬戌", "癸亥"],
        ];
        $res = '';
        foreach ($kongwangList as $k => $v) {
            if (in_array($gz, $v)) {
                $res = $k;
                break;
            }
        }
        return $res;
    }

    /**
     * 三煞 煞方    劫煞    灾煞    岁煞
     * @param $dz 地支
     * @return array
     */
    public static function getSanSha($dz)
    {
        $list = [
            '子' => ['煞南', '巳山', '午山', '未山'],
            '丑' => ['煞东', '寅山', '卯山', '辰山'],
            '寅' => ['煞北', '亥山', '子山', '丑山'],
            '卯' => ['煞西', '申山', '酉山', '戌山'],
            '辰' => ['煞南', '巳山', '午山', '未山'],
            '巳' => ['煞东', '寅山', '卯山', '辰山'],
            '午' => ['煞北', '亥山', '子山', '丑山'],
            '未' => ['煞西', '申山', '酉山', '戌山'],
            '申' => ['煞南', '巳山', '午山', '未山'],
            '酉' => ['煞东', '寅山', '卯山', '辰山'],
            '戌' => ['煞北', '亥山', '子山', '丑山'],
            '亥' => ['煞西', '申山', '酉山', '戌山'],

        ];
        return $list[$dz];
    }

    /**
     * 纳音
     * @param $gz
     * @return mixed
     */
    public static function getNaYinbyGz($gz)
    {
        return isset(self::$naYin[$gz]) ? self::$naYin[$gz] : '';
    }

    /**
     * 获得五行
     * @param string $gz 干支
     * @return string
     */
    public static function getWuXingByGz($gz)
    {
        return isset(self::$wuXing[$gz]) ? self::$wuXing[$gz] : '';
    }

    /**
     * 获得正冲
     * @param string $gz 干支
     * @return string
     */
    public static function getZhengChong($gz)
    {
        $list = [
            "甲子" => "戊午", "乙丑" => "己未", "丙寅" => "庚申", "丁卯" => "辛酉", "戊辰" => "壬戌", "己巳" => "癸亥",
            "庚午" => "甲子", "辛未" => "乙丑", "壬申" => "丙寅", "癸酉" => "丁卯", "甲戌" => "戊辰", "乙亥" => "己巳",
            "丙子" => "庚午", "丁丑" => "辛未", "戊寅" => "壬申", "己卯" => "癸酉", "庚辰" => "甲戌", "辛巳" => "乙亥",
            "壬午" => "丙子", "癸未" => "丁丑", "甲申" => "戊寅", "乙酉" => "己卯", "丙戌" => "庚辰", "丁亥" => "辛巳",
            "戊子" => "壬午", "己丑" => "癸未", "庚寅" => "甲申", "辛卯" => "乙酉", "壬辰" => "丙戌", "癸巳" => "丁亥",
            "甲午" => "戊子", "乙未" => "己丑", "丙申" => "庚寅", "丁酉" => "辛卯", "戊戌" => "壬辰", "己亥" => "癸巳",
            "庚子" => "甲午", "辛丑" => "乙未", "壬寅" => "丙申", "癸卯" => "丁酉", "甲辰" => "戊戌", "乙巳" => "己亥",
            "丙午" => "庚子", "丁未" => "辛丑", "戊申" => "壬寅", "己酉" => "癸卯", "庚戌" => "甲辰", "辛亥" => "乙巳",
            "壬子" => "丙午", "癸丑" => "丁未", "甲寅" => "戊申", "乙卯" => "己酉", "丙辰" => "庚戌", "丁巳" => "辛亥",
            "戊午" => "壬子", "己未" => "癸丑", "庚申" => "甲寅", "辛酉" => "乙卯", "壬戌" => "丙辰", "癸亥" => "丁巳"
        ];

        return isset($list[$gz]) ? $list[$gz] : '';
    }

    /**
     * 值 日
     * @param $month 农历月地支
     * @param $dz 日地支
     * @return array
     */
    public static function getZhiRiByDz($month, $dz)
    {
        $list = [
            '寅' => ["子", "丑", "寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌", "亥"],
            '卯' => ["寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌", "亥", "子", "丑"],
            '辰' => ["辰", "巳", "午", "未", "申", "酉", "戌", "亥", "子", "丑", "寅", "卯"],
            '巳' => ["午", "未", "申", "酉", "戌", "亥", "子", "丑", "寅", "卯", "辰", "巳"],
            '午' => ["申", "酉", "戌", "亥", "子", "丑", "寅", "卯", "辰", "巳", "午", "未"],
            '未' => ["戌", "亥", "子", "丑", "寅", "卯", "辰", "巳", "午", "未", "申", "酉"],
            '申' => ["子", "丑", "寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌", "亥"],
            '酉' => ["寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌", "亥", "子", "丑"],
            '戌' => ["辰", "巳", "午", "未", "申", "酉", "戌", "亥", "子", "丑", "寅", "卯"],
            '亥' => ["午", "未", "申", "酉", "戌", "亥", "子", "丑", "寅", "卯", "辰", "巳"],
            '子' => ["申", "酉", "戌", "亥", "子", "丑", "寅", "卯", "辰", "巳", "午", "未"],
            '丑' => ["戌", "亥", "子", "丑", "寅", "卯", "辰", "巳", "午", "未", "申", "酉"]

        ];
        //黄道日
        $list2 = ["黄道", "黄道", "黑道", "黑道", "黄道", "黄道", "黑道", "黄道", "黑道", "黑道", "黄道", "黑道"];
        //星神
        $list3 = ["天乙星", "贵人星", "天刑星", "天讼星", "福德星", "天德星", "天杀星", "天开星", "镇神星", "天狱星", "凤辇星", "地狱星"];
        //
        $list4 = ["青龙", "明堂", "天刑", "朱雀", "金匮", "天德", "白虎", "玉堂", "天牢", "玄武", "司命", "勾陈"];
        $monthList = $list[$month];
        $index = (int)array_search($dz, $monthList);
        return [
            'huan_dao' => $list2[$index],
            'xing_shen' => $list3[$index],
            'shen_sha' => $list4[$index]
        ];
    }

    /**
     * 根据天干来调取数据的喜神、阳贵神、阴贵神、福神的方位
     * @param string $tg 天干
     * @return array
     */
    public static function getPositionbyTg($tg)
    {
        //福神	喜神	财神	阳贵人	阴贵人
        $list = [
            "甲" => ["东南", "东北", "东北", "西南", "东北"],
            "乙" => ["东南", "西北", "东北", "西南", "正北"],
            "丙" => ["正东", "西南", "西南", "正西", "西北"],
            "丁" => ["正东", "正南", "西南", "西北", "正西"],
            "戊" => ["正北", "东南", "正北", "东北", "西南"],
            "己" => ["正南", "东北", "正北", "正北", "西南"],
            "庚" => ["西南", "西北", "正东", "东北", "西南"],
            "辛" => ["西南", "西南", "正东", "东北", "正南"],
            "壬" => ["西北", "正南", "正南", "正东", "东南"],
            "癸" => ["正西", "东南", "正南", "东南", "正东"],
        ];
        $res = isset($list[$tg]) ? $list[$tg] : $list["甲"];
        return [
            'fu_shen' => $res[0],
            'xi_shen' => $res[1],
            'cai_shen' => $res[2],
            'yang_gui_ren' => $res[3],
            'yin_gui_ren' => $res[4],
        ];
    }

    /**
     * 获取时天干地支
     * @param $rtg 日天干
     * @param $hour 时辰
     * @return array
     */
    public static function getGanzhiHour($rtg, $hour)
    {
        $of = [];
        if (in_array($rtg, ['甲', '己'])) {
            $of = [
                '子' => '甲', '丑' => '乙', '寅' => '丙', '卯' => '丁', '辰' => '戊', '巳' => '己',
                '午' => '庚', '未' => '辛', '申' => '壬', '酉' => '癸', '戌' => '甲', '亥' => '乙'
            ];
        } else if (in_array($rtg, ['乙', '庚'])) {
            $of = [
                '子' => '丙', '丑' => '丁', '寅' => '戊', '卯' => '己', '辰' => '庚', '巳' => '辛',
                '午' => '壬', '未' => '癸', '申' => '甲', '酉' => '乙', '戌' => '丙', '亥' => '丁'
            ];
        } else if (in_array($rtg, ['丙', '辛'])) {
            $of = [
                '子' => '戊', '丑' => '己', '寅' => '庚', '卯' => '辛', '辰' => '壬', '巳' => '癸',
                '午' => '甲', '未' => '乙', '申' => '丙', '酉' => '丁', '戌' => '戊', '亥' => '己'
            ];
        } else if (in_array($rtg, ['丁', '壬'])) {
            $of = [
                '子' => '庚', '丑' => '辛', '寅' => '壬', '卯' => '癸', '辰' => '甲', '巳' => '乙',
                '午' => '丙', '未' => '丁', '申' => '戊', '酉' => '己', '戌' => '庚', '亥' => '辛'
            ];
        } else if (in_array($rtg, ['戊', '癸'])) {
            $of = [
                '子' => '壬', '丑' => '癸', '寅' => '甲', '卯' => '乙', '辰' => '丙', '巳' => '丁',
                '午' => '戊', '未' => '己', '申' => '庚', '酉' => '辛', '戌' => '壬', '亥' => '癸'
            ];
        }
        return [$of[$hour], $hour];
    }

    /**
     * 获得中文星期
     * @param $time 时间戳
     * @return mixed
     */
    public static function getWeekChs($time)
    {
        $list = ['', '星期一', '星期二', '星期三', '星期四', '星期五', '星期六', '星期日'];
        $num = date('N', $time);
        return $list[$num];
    }

    /**
     * 获得所有节气
     * @param $year 阳历年
     * @return array 返回所有的节气【节气=>时间，】
     */
    public static function getAllJieQi($year)
    {
        $jieQi = [
            '00' => "立春", '01' => "雨水", '02' => "惊蛰", '03' => "春分", '04' => "清明",
            '05' => "谷雨", '06' => "立夏", '07' => "小满", '08' => "芒种", '09' => "夏至",
            '10' => "小暑", '11' => "大暑", '12' => "立秋", '13' => "处暑", '14' => "白露",
            '15' => "秋分", '16' => "寒露", '17' => "霜降", '18' => "立冬", '19' => "小雪",
            '20' => "大雪", '21' => "冬至", '22' => '小寒', '23' => '大寒'
        ];
        $cacheKeyName = "Alljieqi_" . $year;
        //获取节气数据
        $res = cache($cacheKeyName);
        if (empty($res)) {
            foreach ($jieQi as $k => $v) {
                $fp = fopen(__DIR__ . '/data/' . $k . '.dat', 'r');
                $content = fread($fp, filesize(__DIR__ . '/data/' . $k . '.dat'));
                $arr = explode("\n", $content);
                fclose($fp);
                $res[$v] = trim($arr[$year]);
            }
            asort($res);
            cache($cacheKeyName, $res, 86400);
        }
        return $res;
    }

    /**
     * 判断是否为节气日期，是返回节气名，否则返回false
     * @param integer $time 时间戳
     * @return bool|string
     */
    public static function isJieQi($time)
    {
        $year = date('Y', $time);
        $riZi = date('Y-m-d', $time);
        $jieqi = self::getAllJieQi($year);
        $res = '';
        foreach ($jieqi as $k => $v) {
            $tmp = date('Y-m-d', strtotime($v));
            if ($riZi == $tmp) {
                $res = $k;
                break;
            }
        }
        if (empty($res)) {
            return false;
        }
        return $res;
    }

    /**
     * 阳历节日
     * @param $year 公历年
     * @param $isCache bool 是否走缓存默认是
     * @return bool|array
     */
    public static function getJieRiListByYear($year)
    {
        static $huangliJieri;
        if (isset($huangliJieri[$year])) {
            $res = $huangliJieri[$year];
        } else {
            $res = [];
            //农历节日
            $nongliJieRi = [
                "12_8" => "腊八节",
                "12_23" => "北方小年",
                "12_24" => "南方小年",
                //"1-1" => "春节",
                "1_15" => "元宵节",
                "2_2" => "龙抬头",
                "3_3" => "上巳节",
                "5_5" => "端午节",
                "7_7" => "七夕",
                "7_15" => "中元节",
                "8_15" => "中秋节",
                "9_9" => "重阳节",
                "10_1" => "寒衣节"
            ];
            //公历节日
            $gongliJieRi = [
                "1月1日" => "元旦",
                "2月10日" => "气象节",
                "2月14日" => "情人节",
                "3月3日" => "爱耳日",
                "3月8日" => "妇女节",
                "3月12日" => "植树节",
                "3月14日" => "圆周率日",
                "3月15日" => "消费者权益日",
                "3月22日" => "世界水日",
                "3月23日" => "气象日",
                "4月1日" => "愚人节",
                "4月5日" => "清明节",
                "4月22日" => "地球日",
                "4月26日" => "世界知识产权日",
                "5月1日" => "劳动节",
                "5月4日" => "青年节",
                "5月8日" => "世界微笑日",
                "5月12日" => "护士节",
                //"5月13日" => "母亲节",
                "5月15日" => "世界家庭日",
                "5月19日" => "中国旅游日",
                "5月31日" => "无烟日",
                "6月1日" => "儿童节",
                "6月5日" => "世界环境保护日",
                "6月6日" => "爱眼日",
                //"6月17日" => "父亲节",
                "6月23日" => "国际奥林匹克日",
                "6月26日" => "反毒品日",
                "7月1日" => "建党节",
                "7月7日" => "七七事变纪念日",
                "7月11日" => "中国航海日",
                "8月1日" => "建军节",
                "8月15日" => "日本投降纪念日",
                "8月26日" => "全国律师咨询日",
                "9月3日" => "抗日战争胜利纪念日",
                "9月10日" => "教师节",
                "9月18日" => "九一八纪念日",
                "9月20日" => "爱牙日",
                "9月28日" => "孔子诞辰纪念日",
                "9月30日" => "中国烈士纪念日",
                "10月1日" => "国庆节",
                "10月10日" => "辛亥革命纪念日",
                "10月13日" => "世界保健日",
                "10月16日" => "粮食日",
                "10月24日" => "联合国日",
                "10月31日" => "万圣夜",
                "11月8日" => "记者节",
                "11月11日" => "光棍节",
                "11月17日" => "大学生节",
                "12月1日" => "艾滋病日",
                "12月10日" => "人权日",
                "12月13日" => "南京大屠杀国家公祭日",
                "12月20日" => "澳门回归纪念日",
                "12月24日" => "平安夜",
                "12月25日" => "圣诞节"
            ];
            //佛日
            $foRiList = [
                "1_1" => "弥勒佛圣诞", "1_6" => "定光佛圣诞", "1_9" => "帝释天尊圣诞", "2_8" => "释迦牟尼佛出家",
                "2_15" => "释迦牟尼佛涅盘", "2_19" => "观世音菩萨圣诞", "2_21" => "普贤菩萨圣诞", "3_16" => "准提菩萨圣诞",
                "4_4" => "文殊菩萨圣诞", "4_8" => "释迦牟尼佛圣诞", "4_15" => "佛成道日、佛涅槃日", "4_28" => "药王菩萨圣诞",
                "5_13" => "伽蓝菩萨圣诞", "5_15" => "佛陀吉祥日", "6_3" => "韦驮菩萨圣诞", "6_19" => "观世音菩萨成道",
                "7_13" => "大势至菩萨圣诞", "1_15" => "佛欢喜日", "7_21" => "普庵祖师圣诞", "7_24" => "龙树菩萨圣诞",
                "7_30" => "地藏王菩萨圣诞", "8_20" => "燃灯古佛圣诞", "9_19" => "观世音菩萨出家", "9_30" => "药师佛圣诞",
                "10_5" => "达摩祖师圣诞", "11_17" => "阿弥陀佛圣诞", "12_8" => "释迦牟尼佛成道", "12_29" => "华严菩萨圣诞"
            ];
            $start = strtotime($year . '-01-01');
            $endTime = strtotime(($year + 1) . '-01-01');
            //11月的第几个星期4
            $index = 1;
            for ($i = 0; $i <= 366; $i++) {
                $tmp = strtotime("+{$i} day", $start);
                //没有前导零 的月份和 第几天
                $m = (int)date('n', $tmp);
                $d = (int)date('j', $tmp);
                //格式数字表示的星期中的第几天 1（表示星期一）到 7（表示星期天）
                $w = date('N', $tmp);
                if ($tmp >= $endTime) {
                    continue;
                }
                $tmpYear = date('Y', $tmp);
                $lunar = Lunar::date($tmp);
                $yearMonth = $lunar->getLunarYearMonth();
                $yearDay = $lunar->getLunarYearDay();
                //农历月日数字
                $nL = $yearMonth[1] . '_' . $yearDay[1];
                //求佛日
                if (isset($foRiList[$nL])) {
                    $res['fo'][$tmp] = $foRiList[$nL];
                }
                //节日
                if (isset($nongliJieRi[$nL])) {
                    $res['jie'][$tmp][] = $nongliJieRi[$nL];
                }
                if ($nL == '1_1') {
                    $res['jie'][($tmp - 86400)][] = '除夕';
                    $res['jie'][$tmp][] = '春节';
                }
                $rizi = date('n月j日', $tmp);
                if (isset($gongliJieRi[$rizi])) {
                    $res['jie'][$tmp][] = $gongliJieRi[$rizi];
                }
                if ($m == 5 && ($d > 7 && $d < 15) && ($w == 7)) {

                    $res['jie'][$tmp][] = '母亲节';
                }
                if ($m == 6 && ($d > 14 && $d < 22) && ($w == 7)) {
                    $res['jie'][$tmp][] = '父亲节';
                }
                if ($m == 11 && $w == 4 && ($d > 21 && $d < 29)) {
                    $res['jie'][$tmp][] = '感恩节';
                }

            }
            $huangliJieri[$year] = $res;
        }

        return $res;
    }

    /**
     * 获得八门方位
     * @param $gz 干支
     * @return mixed
     */
    public static function getBaMenbyGz($gz)
    {
        $list = [
            '庚午' => ['休' => '东北', '景' => '西南', '生' => '正东', '死' => '西', '伤' => '东南', '惊' => '西北', '杜' => '南', '开' => '北'],
            '辛未' => ['休' => '东北', '景' => '西南', '生' => '正东', '死' => '西', '伤' => '东南', '惊' => '西北', '杜' => '南', '开' => '北'],
            '壬申' => ['休' => '东北', '景' => '西南', '生' => '正东', '死' => '西', '伤' => '东南', '惊' => '西北', '杜' => '南', '开' => '北'],
            '丁酉' => ['休' => '东北', '景' => '西南', '生' => '正东', '死' => '西', '伤' => '东南', '惊' => '西北', '杜' => '南', '开' => '北'],
            '戊戌' => ['休' => '东北', '景' => '西南', '生' => '正东', '死' => '西', '伤' => '东南', '惊' => '西北', '杜' => '南', '开' => '北'],
            '己亥' => ['休' => '东北', '景' => '西南', '生' => '正东', '死' => '西', '伤' => '东南', '惊' => '西北', '杜' => '南', '开' => '北'],
            '丙子' => ['休' => '东北', '景' => '西南', '生' => '正东', '死' => '西', '伤' => '东南', '惊' => '西北', '杜' => '南', '开' => '北'],
            '丁丑' => ['休' => '东北', '景' => '西南', '生' => '正东', '死' => '西', '伤' => '东南', '惊' => '西北', '杜' => '南', '开' => '北'],
            '戊寅' => ['休' => '东北', '景' => '西南', '生' => '正东', '死' => '西', '伤' => '东南', '惊' => '西北', '杜' => '南', '开' => '北'],
            '癸酉' => ['休' => '东', '景' => '西', '生' => '东南', '死' => '西北', '伤' => '南', '惊' => '北', '杜' => '西南', '开' => '东北'],
            '甲戌' => ['休' => '东', '景' => '西', '生' => '东南', '死' => '西北', '伤' => '南', '惊' => '北', '杜' => '西南', '开' => '东北'],
            '乙亥' => ['休' => '东', '景' => '西', '生' => '东南', '死' => '西北', '伤' => '南', '惊' => '北', '杜' => '西南', '开' => '东北'],
            '庚子' => ['休' => '东', '景' => '西', '生' => '东南', '死' => '西北', '伤' => '南', '惊' => '北', '杜' => '西南', '开' => '东北'],
            '辛丑' => ['休' => '东', '景' => '西', '生' => '东南', '死' => '西北', '伤' => '南', '惊' => '北', '杜' => '西南', '开' => '东北'],
            '壬寅' => ['休' => '东', '景' => '西', '生' => '东南', '死' => '西北', '伤' => '南', '惊' => '北', '杜' => '西南', '开' => '东北'],
            '癸卯' => ['休' => '东', '景' => '西', '生' => '东南', '死' => '西北', '伤' => '南', '惊' => '北', '杜' => '西南', '开' => '东北'],
            '甲辰' => ['休' => '东', '景' => '西', '生' => '东南', '死' => '西北', '伤' => '南', '惊' => '北', '杜' => '西南', '开' => '东北',],
            '乙巳' => ['休' => '东', '景' => '西', '生' => '东南', '死' => '西北', '伤' => '南', '惊' => '北', '杜' => '西南', '开' => '东北',],
            '己卯' => ['休' => '西', '景' => '东', '生' => '西北', '死' => '东南', '伤' => '北', '惊' => '南', '杜' => '东北', '开' => '西南',],
            '庚辰' => ['休' => '西', '景' => '东', '生' => '西北', '死' => '东南', '伤' => '北', '惊' => '南', '杜' => '东北', '开' => '西南',],
            '辛巳' => ['休' => '西', '景' => '东', '生' => '西北', '死' => '东南', '伤' => '北', '惊' => '南', '杜' => '东北', '开' => '西南',],
            '丙午' => ['休' => '西', '景' => '东', '生' => '西北', '死' => '东南', '伤' => '北', '惊' => '南', '杜' => '东北', '开' => '西南',],
            '丁未' => ['休' => '西', '景' => '东', '生' => '西北', '死' => '东南', '伤' => '北', '惊' => '南', '杜' => '东北', '开' => '西南',],
            '戊申' => ['休' => '西', '景' => '东', '生' => '西北', '死' => '东南', '伤' => '北', '惊' => '南', '杜' => '东北', '开' => '西南',],
            '壬午' => ['休' => '西南', '景' => '东北', '生' => '西', '死' => '东', '伤' => '西北', '惊' => '东南', '杜' => '北', '开' => '南',],
            '癸未' => ['休' => '西南', '景' => '东北', '生' => '西', '死' => '东', '伤' => '西北', '惊' => '东南', '杜' => '北', '开' => '南',],
            '甲申' => ['休' => '西南', '景' => '东北', '生' => '西', '死' => '东', '伤' => '西北', '惊' => '东南', '杜' => '北', '开' => '南',],
            '己酉' => ['休' => '西南', '景' => '东北', '生' => '西', '死' => '东', '伤' => '西北', '惊' => '东南', '杜' => '北', '开' => '南',],
            '庚戌' => ['休' => '西南', '景' => '东北', '生' => '西', '死' => '东', '伤' => '西北', '惊' => '东南', '杜' => '北', '开' => '南',],
            '辛亥' => ['休' => '西南', '景' => '东北', '生' => '西', '死' => '东', '伤' => '西北', '惊' => '东南', '杜' => '北', '开' => '南',],
            '乙酉' => ['休' => '北', '景' => '南', '生' => '东北', '死' => '西南', '伤' => '东', '惊' => '西', '杜' => '东南', '开' => '西北',],
            '丙戌' => ['休' => '北', '景' => '南', '生' => '东北', '死' => '西南', '伤' => '东', '惊' => '西', '杜' => '东南', '开' => '西北',],
            '丁亥' => ['休' => '北', '景' => '南', '生' => '东北', '死' => '西南', '伤' => '东', '惊' => '西', '杜' => '东南', '开' => '西北',],
            '壬子' => ['休' => '北', '景' => '南', '生' => '东北', '死' => '西南', '伤' => '东', '惊' => '西', '杜' => '东南', '开' => '西北',],
            '癸丑' => ['休' => '北', '景' => '南', '生' => '东北', '死' => '西南', '伤' => '东', '惊' => '西', '杜' => '东南', '开' => '西北',],
            '甲寅' => ['休' => '北', '景' => '南', '生' => '东北', '死' => '西南', '伤' => '东', '惊' => '西', '杜' => '东南', '开' => '西北',],
            '戊子' => ['休' => '东南', '景' => '西北', '生' => '南', '死' => '北', '伤' => '西南', '惊' => '东北', '杜' => '西', '开' => '东',],
            '己丑' => ['休' => '东南', '景' => '西北', '生' => '南', '死' => '北', '伤' => '西南', '惊' => '东北', '杜' => '西', '开' => '东',],
            '庚寅' => ['休' => '东南', '景' => '西北', '生' => '南', '死' => '北', '伤' => '西南', '惊' => '东北', '杜' => '西', '开' => '东',],
            '乙卯' => ['休' => '东南', '景' => '西北', '生' => '南', '死' => '北', '伤' => '西南', '惊' => '东北', '杜' => '西', '开' => '东',],
            '丙辰' => ['休' => '东南', '景' => '西北', '生' => '南', '死' => '北', '伤' => '西南', '惊' => '东北', '杜' => '西', '开' => '东',],
            '丁巳' => ['休' => '东南', '景' => '西北', '生' => '南', '死' => '北', '伤' => '西南', '惊' => '东北', '杜' => '西', '开' => '东',],
            '甲子' => ['休' => '西北', '景' => '东南', '生' => '北', '死' => '南', '伤' => '东北', '惊' => '西南', '杜' => '东', '开' => '西',],
            '乙丑' => ['休' => '西北', '景' => '东南', '生' => '北', '死' => '南', '伤' => '东北', '惊' => '西南', '杜' => '东', '开' => '西',],
            '丙寅' => ['休' => '西北', '景' => '东南', '生' => '北', '死' => '南', '伤' => '东北', '惊' => '西南', '杜' => '东', '开' => '西',],
            '辛卯' => ['休' => '西北', '景' => '东南', '生' => '北', '死' => '南', '伤' => '东北', '惊' => '西南', '杜' => '东', '开' => '西',],
            '壬辰' => ['休' => '西北', '景' => '东南', '生' => '北', '死' => '南', '伤' => '东北', '惊' => '西南', '杜' => '东', '开' => '西'],
            '癸巳' => ['休' => '西北', '景' => '东南', '生' => '北', '死' => '南', '伤' => '东北', '惊' => '西南', '杜' => '东', '开' => '西'],
            '戊午' => ['休' => '西北', '景' => '东南', '生' => '北', '死' => '南', '伤' => '东北', '惊' => '西南', '杜' => '东', '开' => '西'],
            '己未' => ['休' => '西北', '景' => '东南', '生' => '北', '死' => '南', '伤' => '东北', '惊' => '西南', '杜' => '东', '开' => '西'],
            '庚申' => ['休' => '西北', '景' => '东南', '生' => '北', '死' => '南', '伤' => '东北', '惊' => '西南', '杜' => '东', '开' => '西'],
            '丁卯' => ['休' => '南', '景' => '北', '生' => '西南', '死' => '东北', '伤' => '西', '惊' => '东', '杜' => '西北', '开' => '东南'],
            '戊辰' => ['休' => '南', '景' => '北', '生' => '西南', '死' => '东北', '伤' => '西', '惊' => '东', '杜' => '西北', '开' => '东南'],
            '己巳' => ['休' => '南', '景' => '北', '生' => '西南', '死' => '东北', '伤' => '西', '惊' => '东', '杜' => '西北', '开' => '东南'],
            '甲午' => ['休' => '南', '景' => '北', '生' => '西南', '死' => '东北', '伤' => '西', '惊' => '东', '杜' => '西北', '开' => '东南'],
            '乙未' => ['休' => '南', '景' => '北', '生' => '西南', '死' => '东北', '伤' => '西', '惊' => '东', '杜' => '西北', '开' => '东南'],
            '丙申' => ['休' => '南', '景' => '北', '生' => '西南', '死' => '东北', '伤' => '西', '惊' => '东', '杜' => '西北', '开' => '东南'],
            '辛酉' => ['休' => '南', '景' => '北', '生' => '西南', '死' => '东北', '伤' => '西', '惊' => '东', '杜' => '西北', '开' => '东南'],
            '壬戌' => ['休' => '南', '景' => '北', '生' => '西南', '死' => '东北', '伤' => '西', '惊' => '东', '杜' => '西北', '开' => '东南'],
            '癸亥' => ['休' => '南', '景' => '北', '生' => '西南', '死' => '东北', '伤' => '西', '惊' => '东', '杜' => '西北', '开' => '东南'],
        ];

        return isset($list[$gz]) ? $list[$gz] : $list['庚午'];
    }
}
